; ModuleID = 'CMakeFiles/serial.dir/image-inst.cpp'
source_filename = "CMakeFiles/serial.dir/image-inst.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.std::basic_ostream" = type { i32 (...)**, %"class.std::basic_ios" }
%"class.std::basic_ios" = type { %"class.std::ios_base", %"class.std::basic_ostream"*, i8, i8, %"class.std::basic_streambuf"*, %"class.std::ctype"*, %"class.std::num_put"*, %"class.std::num_get"* }
%"class.std::ios_base" = type { i32 (...)**, i64, i64, i32, i32, i32, %"struct.std::ios_base::_Callback_list"*, %"struct.std::ios_base::_Words", [8 x %"struct.std::ios_base::_Words"], i32, %"struct.std::ios_base::_Words"*, %"class.std::locale" }
%"struct.std::ios_base::_Callback_list" = type { %"struct.std::ios_base::_Callback_list"*, void (i32, %"class.std::ios_base"*, i32)*, i32, i32 }
%"struct.std::ios_base::_Words" = type { i8*, i64 }
%"class.std::locale" = type { %"class.std::locale::_Impl"* }
%"class.std::locale::_Impl" = type { i32, %"class.std::locale::facet"**, i64, %"class.std::locale::facet"**, i8** }
%"class.std::locale::facet" = type <{ i32 (...)**, i32, [4 x i8] }>
%"class.std::basic_streambuf" = type { i32 (...)**, i8*, i8*, i8*, i8*, i8*, i8*, %"class.std::locale" }
%"class.std::ctype" = type <{ %"class.std::locale::facet.base", [4 x i8], %struct.__locale_struct*, i8, [7 x i8], i32*, i32*, i16*, i8, [256 x i8], [256 x i8], i8, [6 x i8] }>

!6 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/x86_64-redhat-linux/bits/c++config.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16}
!8 = !DIEnumerator(name: "_S_app", value: 1)
!9 = !DIEnumerator(name: "_S_ate", value: 2)
!10 = !DIEnumerator(name: "_S_bin", value: 4)
!11 = !DIEnumerator(name: "_S_in", value: 8)
!12 = !DIEnumerator(name: "_S_out", value: 16)
!13 = !DIEnumerator(name: "_S_trunc", value: 32)
!14 = !DIEnumerator(name: "_S_ios_openmode_end", value: 65536)
!15 = !DIEnumerator(name: "_S_ios_openmode_max", value: 2147483647)
!16 = !DIEnumerator(name: "_S_ios_openmode_min", value: -2147483648)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Ios_Iostate", scope: !5, file: !4, line: 153, size: 32, align: 32, elements: !18, identifier: "_ZTSSt12_Ios_Iostate")
!18 = !{!19, !20, !21, !22, !23, !24, !25}
!19 = !DIEnumerator(name: "_S_goodbit", value: 0)
!20 = !DIEnumerator(name: "_S_badbit", value: 1)
!21 = !DIEnumerator(name: "_S_eofbit", value: 2)
!22 = !DIEnumerator(name: "_S_failbit", value: 4)
!23 = !DIEnumerator(name: "_S_ios_iostate_end", value: 65536)
!24 = !DIEnumerator(name: "_S_ios_iostate_max", value: 2147483647)
!25 = !DIEnumerator(name: "_S_ios_iostate_min", value: -2147483648)
!26 = !{!27, !28, !29, !3, !30, !31, !17, !35, !36}
!27 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!30 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamsize", scope: !5, file: !32, line: 98, baseType: !33)
!32 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/bits/postypes.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", scope: !5, file: !6, line: 1970, baseType: !34)
!34 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!35 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "ios_base", scope: !5, file: !4, line: 228, size: 1728, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTSSt8ios_base")
!37 = !{!38}
!38 = distinct !DIGlobalVariable(name: "__ioinit", linkageName: "_ZStL8__ioinit", scope: !5, file: !39, line: 74, type: !40, isLocal: true, isDefinition: true, variable: %"class.std::ios_base::Init"* @_ZStL8__ioinit)
!39 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/iostream", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!40 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Init", scope: !36, file: !4, line: 601, size: 8, align: 8, elements: !41, identifier: "_ZTSNSt8ios_base4InitE")
!41 = !{!42, !45, !47, !51}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_S_refcount", scope: !40, file: !4, line: 609, baseType: !43, flags: DIFlagStaticMember)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Atomic_word", file: !44, line: 32, baseType: !30)
!44 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/x86_64-redhat-linux/bits/atomic_word.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_S_synced_with_stdio", scope: !40, file: !4, line: 610, baseType: !46, flags: DIFlagStaticMember)
!46 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!47 = !DISubprogram(name: "Init", scope: !40, file: !4, line: 605, type: !48, isLocal: false, isDefinition: false, scopeLine: 605, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !50}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!51 = !DISubprogram(name: "~Init", scope: !40, file: !4, line: 606, type: !48, isLocal: false, isDefinition: false, scopeLine: 606, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!52 = !{!53, !69, !72, !76, !134, !142, !146, !153, !157, !161, !163, !165, !169, !178, !182, !188, !194, !196, !200, !204, !208, !212, !223, !225, !229, !233, !237, !239, !244, !248, !252, !254, !256, !260, !268, !272, !276, !280, !282, !288, !290, !297, !301, !305, !309, !313, !317, !321, !323, !325, !329, !333, !337, !339, !343, !347, !349, !351, !355, !361, !366, !371, !372, !373, !374, !378, !381, !385, !390, !395, !397, !399, !401, !403, !405, !407, !409, !411, !413, !415, !417, !419, !421, !422, !428, !430, !431, !433, !435, !437, !439, !443, !445, !447, !449, !451, !453, !455, !457, !459, !463, !467, !469, !473, !477, !479, !484, !489, !493, !495, !497, !499, !501, !508, !512, !516, !520, !524, !528, !533, !537, !539, !543, !549, !553, !560, !562, !567, !571, !575, !579, !581, !583, !587, !589, !593, !595, !597, !601, !605, !609, !613, !617, !619, !621, !625, !629, !633, !637, !639, !641, !645, !649, !650, !651, !652, !653, !654}
!53 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !54, line: 64)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !55, line: 106, baseType: !56)
!55 = !DIFile(filename: "/usr/include/wchar.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !55, line: 94, baseType: !57)
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 82, size: 64, align: 32, elements: !58, identifier: "_ZTS11__mbstate_t")
!58 = !{!59, !60}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !57, file: !55, line: 84, baseType: !30, size: 32, align: 32)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !57, file: !55, line: 93, baseType: !61, size: 32, align: 32, offset: 32)
!61 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !57, file: !55, line: 85, size: 32, align: 32, elements: !62, identifier: "_ZTSN11__mbstate_tUt_E")
!62 = !{!63, !65}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !61, file: !55, line: 88, baseType: !64, size: 32, align: 32)
!64 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !61, file: !55, line: 92, baseType: !66, size: 32, align: 8)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 32, align: 8, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 4)
!69 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !70, line: 139)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !71, line: 132, baseType: !64)
!71 = !DIFile(filename: "/opt/aclang/install/bin/../lib/clang/4.0.0/include/stddef.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!72 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !73, line: 141)
!73 = !DISubprogram(name: "btowc", scope: !55, file: !55, line: 390, type: !74, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!74 = !DISubroutineType(types: !75)
!75 = !{!70, !30}
!76 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !77, line: 142)
!77 = !DISubprogram(name: "fgetwc", scope: !55, file: !55, line: 747, type: !78, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!78 = !DISubroutineType(types: !79)
!79 = !{!70, !80}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !82, line: 64, baseType: !83)
!82 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !84, line: 245, size: 1728, align: 64, elements: !85, identifier: "_ZTS8_IO_FILE")
!84 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !101, !103, !104, !105, !108, !110, !112, !116, !119, !121, !123, !124, !125, !126, !129, !130}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !83, file: !84, line: 246, baseType: !30, size: 32, align: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !83, file: !84, line: 251, baseType: !28, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !83, file: !84, line: 252, baseType: !28, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !83, file: !84, line: 253, baseType: !28, size: 64, align: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !83, file: !84, line: 254, baseType: !28, size: 64, align: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !83, file: !84, line: 255, baseType: !28, size: 64, align: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !83, file: !84, line: 256, baseType: !28, size: 64, align: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !83, file: !84, line: 257, baseType: !28, size: 64, align: 64, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !83, file: !84, line: 258, baseType: !28, size: 64, align: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !83, file: !84, line: 260, baseType: !28, size: 64, align: 64, offset: 576)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !83, file: !84, line: 261, baseType: !28, size: 64, align: 64, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !83, file: !84, line: 262, baseType: !28, size: 64, align: 64, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !83, file: !84, line: 264, baseType: !99, size: 64, align: 64, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !84, line: 160, size: 192, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTS10_IO_marker")
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !83, file: !84, line: 266, baseType: !102, size: 64, align: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !83, file: !84, line: 268, baseType: !30, size: 32, align: 32, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !83, file: !84, line: 272, baseType: !30, size: 32, align: 32, offset: 928)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !83, file: !84, line: 274, baseType: !106, size: 64, align: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !107, line: 131, baseType: !34)
!107 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !83, file: !84, line: 278, baseType: !109, size: 16, align: 16, offset: 1024)
!109 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !83, file: !84, line: 279, baseType: !111, size: 8, align: 8, offset: 1040)
!111 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !83, file: !84, line: 280, baseType: !113, size: 8, align: 8, offset: 1048)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 8, align: 8, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 1)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !83, file: !84, line: 284, baseType: !117, size: 64, align: 64, offset: 1088)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !84, line: 154, baseType: null)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !83, file: !84, line: 293, baseType: !120, size: 64, align: 64, offset: 1152)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !107, line: 132, baseType: !34)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !83, file: !84, line: 302, baseType: !122, size: 64, align: 64, offset: 1216)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !83, file: !84, line: 303, baseType: !122, size: 64, align: 64, offset: 1280)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !83, file: !84, line: 304, baseType: !122, size: 64, align: 64, offset: 1344)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !83, file: !84, line: 305, baseType: !122, size: 64, align: 64, offset: 1408)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !83, file: !84, line: 306, baseType: !127, size: 64, align: 64, offset: 1472)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !71, line: 62, baseType: !128)
!128 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !83, file: !84, line: 308, baseType: !30, size: 32, align: 32, offset: 1536)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !83, file: !84, line: 310, baseType: !131, size: 160, align: 8, offset: 1568)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 160, align: 8, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 20)
!134 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !135, line: 143)
!135 = !DISubprogram(name: "fgetws", scope: !55, file: !55, line: 776, type: !136, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!136 = !DISubroutineType(types: !137)
!137 = !{!138, !140, !30, !141}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIBasicType(name: "wchar_t", size: 32, align: 32, encoding: DW_ATE_signed)
!140 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !138)
!141 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !80)
!142 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !143, line: 144)
!143 = !DISubprogram(name: "fputwc", scope: !55, file: !55, line: 761, type: !144, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!144 = !DISubroutineType(types: !145)
!145 = !{!70, !139, !80}
!146 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !147, line: 145)
!147 = !DISubprogram(name: "fputws", scope: !55, file: !55, line: 783, type: !148, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!148 = !DISubroutineType(types: !149)
!149 = !{!30, !150, !141}
!150 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!153 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !154, line: 146)
!154 = !DISubprogram(name: "fwide", scope: !55, file: !55, line: 589, type: !155, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!155 = !DISubroutineType(types: !156)
!156 = !{!30, !80, !30}
!157 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !158, line: 147)
!158 = !DISubprogram(name: "fwprintf", scope: !55, file: !55, line: 596, type: !159, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!159 = !DISubroutineType(types: !160)
!160 = !{!30, !141, !150, null}
!161 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !162, line: 148)
!162 = !DISubprogram(name: "fwscanf", scope: !55, file: !55, line: 637, type: !159, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!163 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !164, line: 149)
!164 = !DISubprogram(name: "getwc", scope: !55, file: !55, line: 748, type: !78, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!165 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !166, line: 150)
!166 = !DISubprogram(name: "getwchar", scope: !55, file: !55, line: 754, type: !167, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!167 = !DISubroutineType(types: !168)
!168 = !{!70}
!169 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !170, line: 151)
!170 = !DISubprogram(name: "mbrlen", scope: !55, file: !55, line: 401, type: !171, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!171 = !DISubroutineType(types: !172)
!172 = !{!127, !173, !127, !176}
!173 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !174)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!176 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!178 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !179, line: 152)
!179 = !DISubprogram(name: "mbrtowc", scope: !55, file: !55, line: 367, type: !180, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!180 = !DISubroutineType(types: !181)
!181 = !{!127, !140, !173, !127, !176}
!182 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !183, line: 153)
!183 = !DISubprogram(name: "mbsinit", scope: !55, file: !55, line: 363, type: !184, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!184 = !DISubroutineType(types: !185)
!185 = !{!30, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!188 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !189, line: 154)
!189 = !DISubprogram(name: "mbsrtowcs", scope: !55, file: !55, line: 410, type: !190, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!190 = !DISubroutineType(types: !191)
!191 = !{!127, !140, !192, !127, !176}
!192 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!194 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !195, line: 155)
!195 = !DISubprogram(name: "putwc", scope: !55, file: !55, line: 762, type: !144, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!196 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !197, line: 156)
!197 = !DISubprogram(name: "putwchar", scope: !55, file: !55, line: 768, type: !198, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!198 = !DISubroutineType(types: !199)
!199 = !{!70, !139}
!200 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !201, line: 158)
!201 = !DISubprogram(name: "swprintf", scope: !55, file: !55, line: 606, type: !202, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!202 = !DISubroutineType(types: !203)
!203 = !{!30, !140, !127, !150, null}
!204 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !205, line: 160)
!205 = !DISubprogram(name: "swscanf", scope: !55, file: !55, line: 647, type: !206, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!206 = !DISubroutineType(types: !207)
!207 = !{!30, !150, !150, null}
!208 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !209, line: 161)
!209 = !DISubprogram(name: "ungetwc", scope: !55, file: !55, line: 791, type: !210, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!210 = !DISubroutineType(types: !211)
!211 = !{!70, !70, !80}
!212 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !213, line: 162)
!213 = !DISubprogram(name: "vfwprintf", scope: !55, file: !55, line: 614, type: !214, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!214 = !DISubroutineType(types: !215)
!215 = !{!30, !141, !150, !216}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !218, identifier: "_ZTS13__va_list_tag")
!218 = !{!219, !220, !221, !222}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !217, file: !1, baseType: !64, size: 32, align: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !217, file: !1, baseType: !64, size: 32, align: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !217, file: !1, baseType: !122, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !217, file: !1, baseType: !122, size: 64, align: 64, offset: 128)
!223 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !224, line: 164)
!224 = !DISubprogram(name: "vfwscanf", scope: !55, file: !55, line: 691, type: !214, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!225 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !226, line: 167)
!226 = !DISubprogram(name: "vswprintf", scope: !55, file: !55, line: 627, type: !227, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!227 = !DISubroutineType(types: !228)
!228 = !{!30, !140, !127, !150, !216}
!229 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !230, line: 170)
!230 = !DISubprogram(name: "vswscanf", scope: !55, file: !55, line: 703, type: !231, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!231 = !DISubroutineType(types: !232)
!232 = !{!30, !150, !150, !216}
!233 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !234, line: 172)
!234 = !DISubprogram(name: "vwprintf", scope: !55, file: !55, line: 622, type: !235, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!235 = !DISubroutineType(types: !236)
!236 = !{!30, !150, !216}
!237 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !238, line: 174)
!238 = !DISubprogram(name: "vwscanf", scope: !55, file: !55, line: 699, type: !235, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!239 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !240, line: 176)
!240 = !DISubprogram(name: "wcrtomb", scope: !55, file: !55, line: 372, type: !241, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!241 = !DISubroutineType(types: !242)
!242 = !{!127, !243, !139, !176}
!243 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !28)
!244 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !245, line: 177)
!245 = !DISubprogram(name: "wcscat", scope: !55, file: !55, line: 157, type: !246, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!246 = !DISubroutineType(types: !247)
!247 = !{!138, !140, !150}
!248 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !249, line: 178)
!249 = !DISubprogram(name: "wcscmp", scope: !55, file: !55, line: 165, type: !250, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!250 = !DISubroutineType(types: !251)
!251 = !{!30, !151, !151}
!252 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !253, line: 179)
!253 = !DISubprogram(name: "wcscoll", scope: !55, file: !55, line: 194, type: !250, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!254 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !255, line: 180)
!255 = !DISubprogram(name: "wcscpy", scope: !55, file: !55, line: 147, type: !246, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!256 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !257, line: 181)
!257 = !DISubprogram(name: "wcscspn", scope: !55, file: !55, line: 254, type: !258, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!258 = !DISubroutineType(types: !259)
!259 = !{!127, !151, !151}
!260 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !261, line: 182)
!261 = !DISubprogram(name: "wcsftime", scope: !55, file: !55, line: 857, type: !262, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!262 = !DISubroutineType(types: !263)
!263 = !{!127, !140, !127, !150, !264}
!264 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !55, line: 137, flags: DIFlagFwdDecl, identifier: "_ZTS2tm")
!268 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !269, line: 183)
!269 = !DISubprogram(name: "wcslen", scope: !55, file: !55, line: 289, type: !270, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!270 = !DISubroutineType(types: !271)
!271 = !{!127, !151}
!272 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !273, line: 184)
!273 = !DISubprogram(name: "wcsncat", scope: !55, file: !55, line: 160, type: !274, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!274 = !DISubroutineType(types: !275)
!275 = !{!138, !140, !150, !127}
!276 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !277, line: 185)
!277 = !DISubprogram(name: "wcsncmp", scope: !55, file: !55, line: 168, type: !278, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!278 = !DISubroutineType(types: !279)
!279 = !{!30, !151, !151, !127}
!280 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !281, line: 186)
!281 = !DISubprogram(name: "wcsncpy", scope: !55, file: !55, line: 152, type: !274, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!282 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !283, line: 187)
!283 = !DISubprogram(name: "wcsrtombs", scope: !55, file: !55, line: 416, type: !284, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!284 = !DISubroutineType(types: !285)
!285 = !{!127, !243, !286, !127, !176}
!286 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!288 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !289, line: 188)
!289 = !DISubprogram(name: "wcsspn", scope: !55, file: !55, line: 258, type: !258, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!290 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !291, line: 189)
!291 = !DISubprogram(name: "wcstod", scope: !55, file: !55, line: 452, type: !292, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!292 = !DISubroutineType(types: !293)
!293 = !{!294, !150, !295}
!294 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!295 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!297 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !298, line: 191)
!298 = !DISubprogram(name: "wcstof", scope: !55, file: !55, line: 459, type: !299, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!299 = !DISubroutineType(types: !300)
!300 = !{!27, !150, !295}
!301 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !302, line: 193)
!302 = !DISubprogram(name: "wcstok", scope: !55, file: !55, line: 284, type: !303, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!303 = !DISubroutineType(types: !304)
!304 = !{!138, !140, !150, !295}
!305 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !306, line: 194)
!306 = !DISubprogram(name: "wcstol", scope: !55, file: !55, line: 470, type: !307, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!307 = !DISubroutineType(types: !308)
!308 = !{!34, !150, !295, !30}
!309 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !310, line: 195)
!310 = !DISubprogram(name: "wcstoul", scope: !55, file: !55, line: 475, type: !311, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!311 = !DISubroutineType(types: !312)
!312 = !{!128, !150, !295, !30}
!313 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !314, line: 196)
!314 = !DISubprogram(name: "wcsxfrm", scope: !55, file: !55, line: 198, type: !315, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!315 = !DISubroutineType(types: !316)
!316 = !{!127, !140, !150, !127}
!317 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !318, line: 197)
!318 = !DISubprogram(name: "wctob", scope: !55, file: !55, line: 396, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!319 = !DISubroutineType(types: !320)
!320 = !{!30, !70}
!321 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !322, line: 198)
!322 = !DISubprogram(name: "wmemcmp", scope: !55, file: !55, line: 327, type: !278, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!323 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !324, line: 199)
!324 = !DISubprogram(name: "wmemcpy", scope: !55, file: !55, line: 331, type: !274, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!325 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !326, line: 200)
!326 = !DISubprogram(name: "wmemmove", scope: !55, file: !55, line: 336, type: !327, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!327 = !DISubroutineType(types: !328)
!328 = !{!138, !138, !151, !127}
!329 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !330, line: 201)
!330 = !DISubprogram(name: "wmemset", scope: !55, file: !55, line: 340, type: !331, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!331 = !DISubroutineType(types: !332)
!332 = !{!138, !138, !139, !127}
!333 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !334, line: 202)
!334 = !DISubprogram(name: "wprintf", scope: !55, file: !55, line: 603, type: !335, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!335 = !DISubroutineType(types: !336)
!336 = !{!30, !150, null}
!337 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !338, line: 203)
!338 = !DISubprogram(name: "wscanf", scope: !55, file: !55, line: 644, type: !335, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!339 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !340, line: 204)
!340 = !DISubprogram(name: "wcschr", scope: !55, file: !55, line: 229, type: !341, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!341 = !DISubroutineType(types: !342)
!342 = !{!138, !151, !139}
!343 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !344, line: 205)
!344 = !DISubprogram(name: "wcspbrk", scope: !55, file: !55, line: 268, type: !345, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!345 = !DISubroutineType(types: !346)
!346 = !{!138, !151, !151}
!347 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !348, line: 206)
!348 = !DISubprogram(name: "wcsrchr", scope: !55, file: !55, line: 239, type: !341, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!349 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !350, line: 207)
!350 = !DISubprogram(name: "wcsstr", scope: !55, file: !55, line: 279, type: !345, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !352, line: 208)
!352 = !DISubprogram(name: "wmemchr", scope: !55, file: !55, line: 322, type: !353, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!353 = !DISubroutineType(types: !354)
!354 = !{!138, !151, !139, !127}
!355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !356, entity: !357, line: 248)
!356 = !DINamespace(name: "__gnu_cxx", scope: null, file: !6, line: 1993)
!357 = !DISubprogram(name: "wcstold", scope: !55, file: !55, line: 461, type: !358, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!358 = !DISubroutineType(types: !359)
!359 = !{!360, !150, !295}
!360 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!361 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !356, entity: !362, line: 257)
!362 = !DISubprogram(name: "wcstoll", scope: !55, file: !55, line: 485, type: !363, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!363 = !DISubroutineType(types: !364)
!364 = !{!365, !150, !295, !30}
!365 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!366 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !356, entity: !367, line: 258)
!367 = !DISubprogram(name: "wcstoull", scope: !55, file: !55, line: 492, type: !368, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!368 = !DISubroutineType(types: !369)
!369 = !{!370, !150, !295, !30}
!370 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !357, line: 264)
!372 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !362, line: 265)
!373 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !367, line: 266)
!374 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !375, entity: !377, line: 56)
!375 = !DINamespace(name: "__gnu_debug", scope: null, file: !376, line: 54)
!376 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/debug/debug.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!377 = !DINamespace(name: "__debug", scope: !5, file: !376, line: 48)
!378 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !379, line: 53)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !380, line: 53, size: 768, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTS5lconv")
!380 = !DIFile(filename: "/usr/include/locale.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!381 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !382, line: 54)
!382 = !DISubprogram(name: "setlocale", scope: !380, file: !380, line: 124, type: !383, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!383 = !DISubroutineType(types: !384)
!384 = !{!28, !30, !174}
!385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !386, line: 55)
!386 = !DISubprogram(name: "localeconv", scope: !380, file: !380, line: 127, type: !387, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!387 = !DISubroutineType(types: !388)
!388 = !{!389}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!390 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !391, line: 64)
!391 = !DISubprogram(name: "isalnum", scope: !392, file: !392, line: 110, type: !393, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!392 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!393 = !DISubroutineType(types: !394)
!394 = !{!30, !30}
!395 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !396, line: 65)
!396 = !DISubprogram(name: "isalpha", scope: !392, file: !392, line: 111, type: !393, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !398, line: 66)
!398 = !DISubprogram(name: "iscntrl", scope: !392, file: !392, line: 112, type: !393, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!399 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !400, line: 67)
!400 = !DISubprogram(name: "isdigit", scope: !392, file: !392, line: 113, type: !393, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!401 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !402, line: 68)
!402 = !DISubprogram(name: "isgraph", scope: !392, file: !392, line: 115, type: !393, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!403 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !404, line: 69)
!404 = !DISubprogram(name: "islower", scope: !392, file: !392, line: 114, type: !393, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !406, line: 70)
!406 = !DISubprogram(name: "isprint", scope: !392, file: !392, line: 116, type: !393, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!407 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !408, line: 71)
!408 = !DISubprogram(name: "ispunct", scope: !392, file: !392, line: 117, type: !393, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !410, line: 72)
!410 = !DISubprogram(name: "isspace", scope: !392, file: !392, line: 118, type: !393, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !412, line: 73)
!412 = !DISubprogram(name: "isupper", scope: !392, file: !392, line: 119, type: !393, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !414, line: 74)
!414 = !DISubprogram(name: "isxdigit", scope: !392, file: !392, line: 120, type: !393, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!415 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !416, line: 75)
!416 = !DISubprogram(name: "tolower", scope: !392, file: !392, line: 124, type: !393, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !418, line: 76)
!418 = !DISubprogram(name: "toupper", scope: !392, file: !392, line: 127, type: !393, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !356, entity: !420, line: 44)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", scope: !5, file: !6, line: 1969, baseType: !128)
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !356, entity: !33, line: 45)
!422 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !423, line: 82)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctrans_t", file: !424, line: 186, baseType: !425)
!424 = !DIFile(filename: "/usr/include/wctype.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !107, line: 40, baseType: !30)
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !429, line: 83)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctype_t", file: !424, line: 52, baseType: !128)
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !70, line: 84)
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !432, line: 86)
!432 = !DISubprogram(name: "iswalnum", scope: !424, file: !424, line: 111, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !434, line: 87)
!434 = !DISubprogram(name: "iswalpha", scope: !424, file: !424, line: 117, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !436, line: 89)
!436 = !DISubprogram(name: "iswblank", scope: !424, file: !424, line: 162, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !438, line: 91)
!438 = !DISubprogram(name: "iswcntrl", scope: !424, file: !424, line: 120, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !440, line: 92)
!440 = !DISubprogram(name: "iswctype", scope: !424, file: !424, line: 175, type: !441, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!441 = !DISubroutineType(types: !442)
!442 = !{!30, !70, !429}
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !444, line: 93)
!444 = !DISubprogram(name: "iswdigit", scope: !424, file: !424, line: 124, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !446, line: 94)
!446 = !DISubprogram(name: "iswgraph", scope: !424, file: !424, line: 128, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !448, line: 95)
!448 = !DISubprogram(name: "iswlower", scope: !424, file: !424, line: 133, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !450, line: 96)
!450 = !DISubprogram(name: "iswprint", scope: !424, file: !424, line: 136, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !452, line: 97)
!452 = !DISubprogram(name: "iswpunct", scope: !424, file: !424, line: 141, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!453 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !454, line: 98)
!454 = !DISubprogram(name: "iswspace", scope: !424, file: !424, line: 146, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !456, line: 99)
!456 = !DISubprogram(name: "iswupper", scope: !424, file: !424, line: 151, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !458, line: 100)
!458 = !DISubprogram(name: "iswxdigit", scope: !424, file: !424, line: 156, type: !319, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !460, line: 101)
!460 = !DISubprogram(name: "towctrans", scope: !424, file: !424, line: 221, type: !461, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!461 = !DISubroutineType(types: !462)
!462 = !{!70, !70, !423}
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !464, line: 102)
!464 = !DISubprogram(name: "towlower", scope: !424, file: !424, line: 194, type: !465, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!465 = !DISubroutineType(types: !466)
!466 = !{!70, !70}
!467 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !468, line: 103)
!468 = !DISubprogram(name: "towupper", scope: !424, file: !424, line: 197, type: !465, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !470, line: 104)
!470 = !DISubprogram(name: "wctrans", scope: !424, file: !424, line: 218, type: !471, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!471 = !DISubroutineType(types: !472)
!472 = !{!423, !174}
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !474, line: 105)
!474 = !DISubprogram(name: "wctype", scope: !424, file: !424, line: 171, type: !475, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!475 = !DISubroutineType(types: !476)
!476 = !{!429, !174}
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !478, line: 98)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !82, line: 48, baseType: !83)
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !480, line: 99)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !82, line: 110, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "_G_fpos_t", file: !482, line: 25, baseType: !483)
!482 = !DIFile(filename: "/usr/include/_G_config.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!483 = !DICompositeType(tag: DW_TAG_structure_type, file: !482, line: 21, size: 128, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTS9_G_fpos_t")
!484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !485, line: 101)
!485 = !DISubprogram(name: "clearerr", scope: !82, file: !82, line: 826, type: !486, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !488}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64, align: 64)
!489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !490, line: 102)
!490 = !DISubprogram(name: "fclose", scope: !82, file: !82, line: 237, type: !491, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!491 = !DISubroutineType(types: !492)
!492 = !{!30, !488}
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !494, line: 103)
!494 = !DISubprogram(name: "feof", scope: !82, file: !82, line: 828, type: !491, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !496, line: 104)
!496 = !DISubprogram(name: "ferror", scope: !82, file: !82, line: 830, type: !491, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !498, line: 105)
!498 = !DISubprogram(name: "fflush", scope: !82, file: !82, line: 242, type: !491, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!499 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !500, line: 106)
!500 = !DISubprogram(name: "fgetc", scope: !82, file: !82, line: 531, type: !491, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!501 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !502, line: 107)
!502 = !DISubprogram(name: "fgetpos", scope: !82, file: !82, line: 798, type: !503, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!503 = !DISubroutineType(types: !504)
!504 = !{!30, !505, !506}
!505 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !488)
!506 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !509, line: 108)
!509 = !DISubprogram(name: "fgets", scope: !82, file: !82, line: 622, type: !510, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!510 = !DISubroutineType(types: !511)
!511 = !{!28, !243, !30, !505}
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !513, line: 109)
!513 = !DISubprogram(name: "fopen", scope: !82, file: !82, line: 272, type: !514, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!514 = !DISubroutineType(types: !515)
!515 = !{!488, !173, !173}
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !517, line: 110)
!517 = !DISubprogram(name: "fprintf", scope: !82, file: !82, line: 356, type: !518, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!518 = !DISubroutineType(types: !519)
!519 = !{!30, !505, !173, null}
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !521, line: 111)
!521 = !DISubprogram(name: "fputc", scope: !82, file: !82, line: 573, type: !522, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!522 = !DISubroutineType(types: !523)
!523 = !{!30, !30, !488}
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !525, line: 112)
!525 = !DISubprogram(name: "fputs", scope: !82, file: !82, line: 689, type: !526, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!526 = !DISubroutineType(types: !527)
!527 = !{!30, !173, !505}
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !529, line: 113)
!529 = !DISubprogram(name: "fread", scope: !82, file: !82, line: 709, type: !530, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!530 = !DISubroutineType(types: !531)
!531 = !{!127, !532, !127, !127, !505}
!532 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !122)
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !534, line: 114)
!534 = !DISubprogram(name: "freopen", scope: !82, file: !82, line: 278, type: !535, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!535 = !DISubroutineType(types: !536)
!536 = !{!488, !173, !173, !505}
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !538, line: 115)
!538 = !DISubprogram(name: "fscanf", scope: !82, file: !82, line: 425, type: !518, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !540, line: 116)
!540 = !DISubprogram(name: "fseek", scope: !82, file: !82, line: 749, type: !541, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!541 = !DISubroutineType(types: !542)
!542 = !{!30, !488, !34, !30}
!543 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !544, line: 117)
!544 = !DISubprogram(name: "fsetpos", scope: !82, file: !82, line: 803, type: !545, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!545 = !DISubroutineType(types: !546)
!546 = !{!30, !488, !547}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !550, line: 118)
!550 = !DISubprogram(name: "ftell", scope: !82, file: !82, line: 754, type: !551, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!551 = !DISubroutineType(types: !552)
!552 = !{!34, !488}
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !554, line: 119)
!554 = !DISubprogram(name: "fwrite", scope: !82, file: !82, line: 715, type: !555, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!555 = !DISubroutineType(types: !556)
!556 = !{!127, !557, !127, !127, !505}
!557 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64, align: 64)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !561, line: 120)
!561 = !DISubprogram(name: "getc", scope: !82, file: !82, line: 532, type: !491, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !563, line: 121)
!563 = !DISubprogram(name: "getchar", scope: !564, file: !564, line: 44, type: !565, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!564 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!565 = !DISubroutineType(types: !566)
!566 = !{!30}
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !568, line: 124)
!568 = !DISubprogram(name: "gets", scope: !82, file: !82, line: 638, type: !569, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!569 = !DISubroutineType(types: !570)
!570 = !{!28, !28}
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !572, line: 126)
!572 = !DISubprogram(name: "perror", scope: !82, file: !82, line: 846, type: !573, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!573 = !DISubroutineType(types: !574)
!574 = !{null, !174}
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !576, line: 127)
!576 = !DISubprogram(name: "printf", scope: !82, file: !82, line: 362, type: !577, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!577 = !DISubroutineType(types: !578)
!578 = !{!30, !173, null}
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !580, line: 128)
!580 = !DISubprogram(name: "putc", scope: !82, file: !82, line: 574, type: !522, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !582, line: 129)
!582 = !DISubprogram(name: "putchar", scope: !564, file: !564, line: 79, type: !393, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!583 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !584, line: 130)
!584 = !DISubprogram(name: "puts", scope: !82, file: !82, line: 695, type: !585, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!585 = !DISubroutineType(types: !586)
!586 = !{!30, !174}
!587 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !588, line: 131)
!588 = !DISubprogram(name: "remove", scope: !82, file: !82, line: 178, type: !585, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!589 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !590, line: 132)
!590 = !DISubprogram(name: "rename", scope: !82, file: !82, line: 180, type: !591, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!591 = !DISubroutineType(types: !592)
!592 = !{!30, !174, !174}
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !594, line: 133)
!594 = !DISubprogram(name: "rewind", scope: !82, file: !82, line: 759, type: !486, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!595 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !596, line: 134)
!596 = !DISubprogram(name: "scanf", scope: !82, file: !82, line: 431, type: !577, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !598, line: 135)
!598 = !DISubprogram(name: "setbuf", scope: !82, file: !82, line: 332, type: !599, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!599 = !DISubroutineType(types: !600)
!600 = !{null, !505, !243}
!601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !602, line: 136)
!602 = !DISubprogram(name: "setvbuf", scope: !82, file: !82, line: 336, type: !603, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!603 = !DISubroutineType(types: !604)
!604 = !{!30, !505, !243, !30, !127}
!605 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !606, line: 137)
!606 = !DISubprogram(name: "sprintf", scope: !82, file: !82, line: 364, type: !607, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!607 = !DISubroutineType(types: !608)
!608 = !{!30, !243, !173, null}
!609 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !610, line: 138)
!610 = !DISubprogram(name: "sscanf", scope: !82, file: !82, line: 433, type: !611, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!611 = !DISubroutineType(types: !612)
!612 = !{!30, !173, !173, null}
!613 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !614, line: 139)
!614 = !DISubprogram(name: "tmpfile", scope: !82, file: !82, line: 195, type: !615, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!615 = !DISubroutineType(types: !616)
!616 = !{!488}
!617 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !618, line: 141)
!618 = !DISubprogram(name: "tmpnam", scope: !82, file: !82, line: 209, type: !569, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!619 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !620, line: 143)
!620 = !DISubprogram(name: "ungetc", scope: !82, file: !82, line: 702, type: !522, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!621 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !622, line: 144)
!622 = !DISubprogram(name: "vfprintf", scope: !82, file: !82, line: 371, type: !623, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!623 = !DISubroutineType(types: !624)
!624 = !{!30, !505, !173, !216}
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !626, line: 145)
!626 = !DISubprogram(name: "vprintf", scope: !564, file: !564, line: 36, type: !627, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!627 = !DISubroutineType(types: !628)
!628 = !{!30, !173, !216}
!629 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !630, line: 146)
!630 = !DISubprogram(name: "vsprintf", scope: !82, file: !82, line: 379, type: !631, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!631 = !DISubroutineType(types: !632)
!632 = !{!30, !243, !173, !216}
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !356, entity: !634, line: 175)
!634 = !DISubprogram(name: "snprintf", scope: !82, file: !82, line: 386, type: !635, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!635 = !DISubroutineType(types: !636)
!636 = !{!30, !243, !127, !173, null}
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !356, entity: !638, line: 176)
!638 = !DISubprogram(name: "vfscanf", scope: !82, file: !82, line: 471, type: !623, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !356, entity: !640, line: 177)
!640 = !DISubprogram(name: "vscanf", scope: !82, file: !82, line: 479, type: !627, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !356, entity: !642, line: 178)
!642 = !DISubprogram(name: "vsnprintf", scope: !82, file: !82, line: 390, type: !643, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!643 = !DISubroutineType(types: !644)
!644 = !{!30, !243, !127, !173, !216}
!645 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !356, entity: !646, line: 179)
!646 = !DISubprogram(name: "vsscanf", scope: !82, file: !82, line: 483, type: !647, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!647 = !DISubroutineType(types: !648)
!648 = !{!30, !173, !173, !216}
!649 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !634, line: 185)
!650 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !638, line: 186)
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !640, line: 187)
!652 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !642, line: 188)
!653 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !646, line: 189)
!654 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !0, entity: !5, line: 36)
!655 = !{i32 2, !"Dwarf Version", i32 4}
!656 = !{i32 2, !"Debug Info Version", i32 3}
!657 = !{!"clang version 4.0.0 (http://gitlab.lsc.ic.unicamp.br/luis.mattos/DoAcrossClause-clang.git fe12e4b4ece0fc9f1e1d9cc24a1406f09e8c7a8a) (http://gitlab.lsc.ic.unicamp.br/luis.mattos/DoAcrossClause.git 6ee0695152160be155346b4d0d8daeaf01555185)"}
!658 = distinct !DISubprogram(name: "createImageFromFile", linkageName: "_ZN5Image19createImageFromFileEPKc", scope: !659, file: !1, line: 33, type: !683, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: true, unit: !0, declaration: !682, variables: !723)
!659 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Image", file: !660, line: 63, size: 256, align: 64, elements: !661, identifier: "_ZTS5Image")
!660 = !DIFile(filename: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/image.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!661 = !{!662, !672, !673, !674, !675, !676, !677, !678, !682, !685, !688, !691, !694, !703, !706, !707, !708, !709, !712, !720}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !659, file: !660, line: 77, baseType: !663, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pixel", file: !660, line: 45, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !660, line: 43, size: 24, align: 8, elements: !666, identifier: "_ZTS5Pixel")
!666 = !{!667, !670, !671}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !665, file: !660, line: 44, baseType: !668, size: 8, align: 8)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !669, line: 48, baseType: !35)
!669 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!670 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !665, file: !660, line: 44, baseType: !668, size: 8, align: 8, offset: 8)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !665, file: !660, line: 44, baseType: !668, size: 8, align: 8, offset: 16)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !659, file: !660, line: 78, baseType: !64, size: 32, align: 32, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !659, file: !660, line: 78, baseType: !64, size: 32, align: 32, offset: 96)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !659, file: !660, line: 79, baseType: !64, size: 32, align: 32, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "maxcolor", scope: !659, file: !660, line: 79, baseType: !64, size: 32, align: 32, offset: 160)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "x_off", scope: !659, file: !660, line: 80, baseType: !27, size: 32, align: 32, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "y_off", scope: !659, file: !660, line: 80, baseType: !27, size: 32, align: 32, offset: 224)
!678 = !DISubprogram(name: "createImageFromBuffer", linkageName: "_ZN5Image21createImageFromBufferEiiiP5Pixel", scope: !659, file: !660, line: 65, type: !679, isLocal: false, isDefinition: false, scopeLine: 65, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !681, !30, !30, !30, !663}
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!682 = !DISubprogram(name: "createImageFromFile", linkageName: "_ZN5Image19createImageFromFileEPKc", scope: !659, file: !660, line: 66, type: !683, isLocal: false, isDefinition: false, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!683 = !DISubroutineType(types: !684)
!684 = !{!46, !681, !174}
!685 = !DISubprogram(name: "createImageFromTemplate", linkageName: "_ZN5Image23createImageFromTemplateEiii", scope: !659, file: !660, line: 67, type: !686, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!686 = !DISubroutineType(types: !687)
!687 = !{null, !681, !30, !30, !30}
!688 = !DISubprogram(name: "getPixelAt", linkageName: "_ZN5Image10getPixelAtEii", scope: !659, file: !660, line: 68, type: !689, isLocal: false, isDefinition: false, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!689 = !DISubroutineType(types: !690)
!690 = !{!664, !681, !30, !30}
!691 = !DISubprogram(name: "setPixelAt", linkageName: "_ZN5Image10setPixelAtEiiP5Pixel", scope: !659, file: !660, line: 69, type: !692, isLocal: false, isDefinition: false, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !681, !30, !30, !663}
!694 = !DISubprogram(name: "containsPixel", linkageName: "_ZN5Image13containsPixelEP5Coord", scope: !659, file: !660, line: 70, type: !695, isLocal: false, isDefinition: false, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!695 = !DISubroutineType(types: !696)
!696 = !{!46, !681, !697}
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64, align: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "Coord", file: !660, line: 55, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !660, line: 52, size: 64, align: 32, elements: !700, identifier: "_ZTS5Coord")
!700 = !{!701, !702}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !699, file: !660, line: 53, baseType: !27, size: 32, align: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !699, file: !660, line: 54, baseType: !27, size: 32, align: 32, offset: 32)
!703 = !DISubprogram(name: "getWidth", linkageName: "_ZN5Image8getWidthEv", scope: !659, file: !660, line: 71, type: !704, isLocal: false, isDefinition: false, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!704 = !DISubroutineType(types: !705)
!705 = !{!64, !681}
!706 = !DISubprogram(name: "getHeight", linkageName: "_ZN5Image9getHeightEv", scope: !659, file: !660, line: 72, type: !704, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!707 = !DISubprogram(name: "getDepth", linkageName: "_ZN5Image8getDepthEv", scope: !659, file: !660, line: 73, type: !704, isLocal: false, isDefinition: false, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!708 = !DISubprogram(name: "getMaxcolor", linkageName: "_ZN5Image11getMaxcolorEv", scope: !659, file: !660, line: 74, type: !704, isLocal: false, isDefinition: false, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!709 = !DISubprogram(name: "clean", linkageName: "_ZN5Image5cleanEv", scope: !659, file: !660, line: 75, type: !710, isLocal: false, isDefinition: false, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!710 = !DISubroutineType(types: !711)
!711 = !{null, !681}
!712 = !DISubprogram(name: "ppmGetInt", linkageName: "_ZN5Image9ppmGetIntERSt13basic_fstreamIcSt11char_traitsIcEE", scope: !659, file: !660, line: 81, type: !713, isLocal: false, isDefinition: false, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: true)
!713 = !DISubroutineType(types: !714)
!714 = !{!30, !681, !715}
!715 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !716, size: 64, align: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "fstream", scope: !5, file: !717, line: 168, baseType: !718)
!717 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/iosfwd", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!718 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_fstream<char, std::char_traits<char> >", scope: !5, file: !719, line: 1056, size: 4224, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTSSt13basic_fstreamIcSt11char_traitsIcEE")
!719 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/bits/fstream.tcc", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!720 = !DISubprogram(name: "ppmGetChar", linkageName: "_ZN5Image10ppmGetCharERSt13basic_fstreamIcSt11char_traitsIcEE", scope: !659, file: !660, line: 82, type: !721, isLocal: false, isDefinition: false, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true)
!721 = !DISubroutineType(types: !722)
!722 = !{!29, !681, !715}
!723 = !{!724, !726, !727, !728, !732}
!724 = !DILocalVariable(name: "this", arg: 1, scope: !658, type: !725, flags: DIFlagArtificial | DIFlagObjectPointer)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64, align: 64)
!726 = !DILocalVariable(name: "fname", arg: 2, scope: !658, file: !1, line: 33, type: !174)
!727 = !DILocalVariable(name: "in", scope: !658, file: !1, line: 34, type: !716)
!728 = !DILocalVariable(name: "buf", scope: !658, file: !1, line: 35, type: !729)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 16, align: 8, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 2)
!732 = !DILocalVariable(name: "i", scope: !733, file: !1, line: 64, type: !30)
!733 = distinct !DILexicalBlock(scope: !658, file: !1, line: 64, column: 3)
!734 = !DIExpression()
!735 = !DILocation(line: 0, scope: !658)
!736 = !DILocation(line: 33, column: 45, scope: !658)
!737 = !DILocation(line: 34, column: 3, scope: !658)
!738 = !DIExpression(DW_OP_deref)
!739 = !DILocation(line: 34, column: 11, scope: !658)
!740 = !DILocation(line: 34, column: 11, scope: !741)
