; ModuleID = 'CMakeFiles/serial.dir/program-inst.cpp'
source_filename = "CMakeFiles/serial.dir/program-inst.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.std::basic_ostream" = type { i32 (...)**, %"class.std::basic_ios" }
%"class.std::basic_ios" = type { %"class.std::ios_base", %"class.std::basic_ostream"*, i8, i8, %"class.std::basic_streambuf"*, %"class.std::ctype"*, %"class.std::num_put"*, %"class.std::num_get"* }
%"class.std::ios_base" = type { i32 (...)**, i64, i64, i32, i32, i32, %"struct.std::ios_base::_Callback_list"*, %"struct.std::ios_base::_Words", [8 x %"struct.std::ios_base::_Words"], i32, %"struct.std::ios_base::_Words"*, %"class.std::locale" }
%"struct.std::ios_base::_Callback_list" = type { %"struct.std::ios_base::_Callback_list"*, void (i32, %"class.std::ios_base"*, i32)*, i32, i32 }
%"struct.std::ios_base::_Words" = type { i8*, i64 }
%"class.std::locale" = type { %"class.std::locale::_Impl"* }
%"class.std::locale::_Impl" = type { i32, %"class.std::locale::facet"**, i64, %"class.std::locale::facet"**, i8** }
%"class.std::locale::facet" = type <{ i32 (...)**, i32, [4 x i8] }>
%"class.std::basic_streambuf" = type { i32 (...)**, i8*, i8*, i8*, i8*, i8*, i8*, %"class.std::locale" }
%"class.std::ctype" = type <{ %"class.std::locale::facet.base", [4 x i8], %struct.__locale_struct*, i8, [7 x i8], i32*, i32*, i16*, i8, [256 x i8], [256 x i8], i8, [6 x i8] }>

!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Atomic_word", file: !135, line: 32, baseType: !81)
!135 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/x86_64-redhat-linux/bits/atomic_word.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_S_synced_with_stdio", scope: !131, file: !13, line: 610, baseType: !76, flags: DIFlagStaticMember)
!137 = !DISubprogram(name: "Init", scope: !131, file: !13, line: 605, type: !138, isLocal: false, isDefinition: false, scopeLine: 605, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!138 = !DISubroutineType(types: !139)
!139 = !{null, !140}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!141 = !DISubprogram(name: "~Init", scope: !131, file: !13, line: 606, type: !138, isLocal: false, isDefinition: false, scopeLine: 606, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!142 = distinct !DIGlobalVariable(name: "srcfiles", linkageName: "_Z8srcfilesB5cxx11", scope: !0, file: !1, line: 39, type: !143, isLocal: false, isDefinition: true, variable: [100 x %"class.std::__cxx11::basic_string"]* @_Z8srcfilesB5cxx11)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 25600, align: 64, elements: !146)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "string", scope: !7, file: !145, line: 74, baseType: !5)
!145 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/bits/stringfwd.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!146 = !{!147}
!147 = !DISubrange(count: 100)
!148 = distinct !DIGlobalVariable(name: "destfiles", linkageName: "_Z9destfilesB5cxx11", scope: !0, file: !1, line: 39, type: !143, isLocal: false, isDefinition: true, variable: [100 x %"class.std::__cxx11::basic_string"]* @_Z9destfilesB5cxx11)
!149 = distinct !DIGlobalVariable(name: "ifiles", linkageName: "_Z6ifilesB5cxx11", scope: !0, file: !1, line: 40, type: !144, isLocal: false, isDefinition: true, variable: %"class.std::__cxx11::basic_string"* @_Z6ifilesB5cxx11)
!150 = distinct !DIGlobalVariable(name: "ofiles", linkageName: "_Z6ofilesB5cxx11", scope: !0, file: !1, line: 40, type: !144, isLocal: false, isDefinition: true, variable: %"class.std::__cxx11::basic_string"* @_Z6ofilesB5cxx11)
!151 = distinct !DIGlobalVariable(name: "angle", scope: !0, file: !1, line: 41, type: !81, isLocal: false, isDefinition: true, variable: i32* @angle)
!152 = distinct !DIGlobalVariable(name: "xres", scope: !0, file: !1, line: 42, type: !153, isLocal: false, isDefinition: true, variable: i32* @xres)
!153 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!154 = distinct !DIGlobalVariable(name: "yres", scope: !0, file: !1, line: 43, type: !153, isLocal: false, isDefinition: true, variable: i32* @yres)
!155 = distinct !DIGlobalVariable(name: "rpp", scope: !0, file: !1, line: 44, type: !153, isLocal: false, isDefinition: true, variable: i32* @rpp)
!156 = distinct !DIGlobalVariable(name: "qtdFiles", scope: !0, file: !1, line: 45, type: !81, isLocal: false, isDefinition: true, variable: i32* @qtdFiles)
!157 = distinct !DIGlobalVariable(name: "usage", linkageName: "_Z5usageB5cxx11", scope: !0, file: !1, line: 56, type: !144, isLocal: false, isDefinition: true, variable: %"class.std::__cxx11::basic_string"* @_Z5usageB5cxx11)
!158 = distinct !DIGlobalVariable(name: "p_name", linkageName: "_Z6p_nameB5cxx11", scope: !0, file: !1, line: 65, type: !144, isLocal: false, isDefinition: true, variable: %"class.std::__cxx11::basic_string"* @_Z6p_nameB5cxx11)
!159 = !{!160, !164, !179, !182, !186, !243, !251, !255, !262, !266, !270, !272, !274, !278, !285, !289, !295, !301, !303, !307, !311, !315, !319, !330, !332, !336, !340, !344, !346, !351, !355, !359, !361, !363, !367, !375, !379, !383, !387, !389, !395, !397, !404, !409, !413, !417, !421, !425, !429, !431, !433, !437, !441, !445, !447, !451, !455, !457, !459, !463, !468, !473, !478, !479, !480, !481, !482, !483, !486, !490, !495, !500, !502, !504, !506, !508, !510, !512, !514, !516, !518, !520, !522, !524, !530, !532, !533, !535, !537, !539, !541, !545, !547, !549, !551, !553, !555, !557, !559, !561, !565, !569, !571, !575, !579, !581, !586, !591, !595, !597, !599, !601, !603, !610, !614, !618, !622, !626, !630, !635, !639, !641, !645, !651, !655, !662, !664, !669, !673, !677, !681, !683, !685, !689, !691, !695, !697, !699, !703, !707, !711, !715, !719, !721, !723, !727, !731, !735, !739, !741, !743, !747, !751, !752, !753, !754, !755, !756, !757, !762, !764, !766, !770, !772, !774, !776, !778, !780, !782, !784, !789, !793, !795, !797, !802, !804, !806, !808, !810, !812, !814, !815}
!160 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !161, entity: !163, line: 56)
!161 = !DINamespace(name: "__gnu_debug", scope: null, file: !162, line: 54)
!162 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/debug/debug.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!163 = !DINamespace(name: "__debug", scope: !9, file: !162, line: 48)
!164 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !165, line: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !166, line: 106, baseType: !167)
!166 = !DIFile(filename: "/usr/include/wchar.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !166, line: 94, baseType: !168)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !166, line: 82, size: 64, align: 32, elements: !169, identifier: "_ZTS11__mbstate_t")
!169 = !{!170, !171}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !168, file: !166, line: 84, baseType: !81, size: 32, align: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !168, file: !166, line: 93, baseType: !172, size: 32, align: 32, offset: 32)
!172 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !168, file: !166, line: 85, size: 32, align: 32, elements: !173, identifier: "_ZTSN11__mbstate_tUt_E")
!173 = !{!174, !175}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !172, file: !166, line: 88, baseType: !153, size: 32, align: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !172, file: !166, line: 92, baseType: !176, size: 32, align: 8)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 32, align: 8, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 4)
!179 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !180, line: 139)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !181, line: 132, baseType: !153)
!181 = !DIFile(filename: "/opt/aclang/install/bin/../lib/clang/4.0.0/include/stddef.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!182 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !183, line: 141)
!183 = !DISubprogram(name: "btowc", scope: !166, file: !166, line: 390, type: !184, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!184 = !DISubroutineType(types: !185)
!185 = !{!180, !81}
!186 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !187, line: 142)
!187 = !DISubprogram(name: "fgetwc", scope: !166, file: !166, line: 747, type: !188, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!188 = !DISubroutineType(types: !189)
!189 = !{!180, !190}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !192, line: 64, baseType: !193)
!192 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !194, line: 245, size: 1728, align: 64, elements: !195, identifier: "_ZTS8_IO_FILE")
!194 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !211, !213, !214, !215, !218, !220, !222, !226, !229, !231, !233, !234, !235, !236, !238, !239}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !193, file: !194, line: 246, baseType: !81, size: 32, align: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !193, file: !194, line: 251, baseType: !59, size: 64, align: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !193, file: !194, line: 252, baseType: !59, size: 64, align: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !193, file: !194, line: 253, baseType: !59, size: 64, align: 64, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !193, file: !194, line: 254, baseType: !59, size: 64, align: 64, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !193, file: !194, line: 255, baseType: !59, size: 64, align: 64, offset: 320)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !193, file: !194, line: 256, baseType: !59, size: 64, align: 64, offset: 384)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !193, file: !194, line: 257, baseType: !59, size: 64, align: 64, offset: 448)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !193, file: !194, line: 258, baseType: !59, size: 64, align: 64, offset: 512)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !193, file: !194, line: 260, baseType: !59, size: 64, align: 64, offset: 576)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !193, file: !194, line: 261, baseType: !59, size: 64, align: 64, offset: 640)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !193, file: !194, line: 262, baseType: !59, size: 64, align: 64, offset: 704)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !193, file: !194, line: 264, baseType: !209, size: 64, align: 64, offset: 768)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !194, line: 160, size: 192, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTS10_IO_marker")
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !193, file: !194, line: 266, baseType: !212, size: 64, align: 64, offset: 832)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64, align: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !193, file: !194, line: 268, baseType: !81, size: 32, align: 32, offset: 896)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !193, file: !194, line: 272, baseType: !81, size: 32, align: 32, offset: 928)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !193, file: !194, line: 274, baseType: !216, size: 64, align: 64, offset: 960)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !217, line: 131, baseType: !125)
!217 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !193, file: !194, line: 278, baseType: !219, size: 16, align: 16, offset: 1024)
!219 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !193, file: !194, line: 279, baseType: !221, size: 8, align: 8, offset: 1040)
!221 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !193, file: !194, line: 280, baseType: !223, size: 8, align: 8, offset: 1048)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 8, align: 8, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 1)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !193, file: !194, line: 284, baseType: !227, size: 64, align: 64, offset: 1088)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !194, line: 154, baseType: null)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !193, file: !194, line: 293, baseType: !230, size: 64, align: 64, offset: 1152)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !217, line: 132, baseType: !125)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !193, file: !194, line: 302, baseType: !232, size: 64, align: 64, offset: 1216)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !193, file: !194, line: 303, baseType: !232, size: 64, align: 64, offset: 1280)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !193, file: !194, line: 304, baseType: !232, size: 64, align: 64, offset: 1344)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !193, file: !194, line: 305, baseType: !232, size: 64, align: 64, offset: 1408)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !193, file: !194, line: 306, baseType: !237, size: 64, align: 64, offset: 1472)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !181, line: 62, baseType: !23)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !193, file: !194, line: 308, baseType: !81, size: 32, align: 32, offset: 1536)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !193, file: !194, line: 310, baseType: !240, size: 160, align: 8, offset: 1568)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 160, align: 8, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 20)
!243 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !244, line: 143)
!244 = !DISubprogram(name: "fgetws", scope: !166, file: !166, line: 776, type: !245, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!245 = !DISubroutineType(types: !246)
!246 = !{!247, !249, !81, !250}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = !DIBasicType(name: "wchar_t", size: 32, align: 32, encoding: DW_ATE_signed)
!249 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !247)
!250 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !190)
!251 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !252, line: 144)
!252 = !DISubprogram(name: "fputwc", scope: !166, file: !166, line: 761, type: !253, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!253 = !DISubroutineType(types: !254)
!254 = !{!180, !248, !190}
!255 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !256, line: 145)
!256 = !DISubprogram(name: "fputws", scope: !166, file: !166, line: 783, type: !257, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!257 = !DISubroutineType(types: !258)
!258 = !{!81, !259, !250}
!259 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !260)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!262 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !263, line: 146)
!263 = !DISubprogram(name: "fwide", scope: !166, file: !166, line: 589, type: !264, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!264 = !DISubroutineType(types: !265)
!265 = !{!81, !190, !81}
!266 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !267, line: 147)
!267 = !DISubprogram(name: "fwprintf", scope: !166, file: !166, line: 596, type: !268, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!268 = !DISubroutineType(types: !269)
!269 = !{!81, !250, !259, null}
!270 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !271, line: 148)
!271 = !DISubprogram(name: "fwscanf", scope: !166, file: !166, line: 637, type: !268, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!272 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !273, line: 149)
!273 = !DISubprogram(name: "getwc", scope: !166, file: !166, line: 748, type: !188, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!274 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !275, line: 150)
!275 = !DISubprogram(name: "getwchar", scope: !166, file: !166, line: 754, type: !276, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!276 = !DISubroutineType(types: !277)
!277 = !{!180}
!278 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !279, line: 151)
!279 = !DISubprogram(name: "mbrlen", scope: !166, file: !166, line: 401, type: !280, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!280 = !DISubroutineType(types: !281)
!281 = !{!237, !282, !237, !283}
!282 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !119)
!283 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!285 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !286, line: 152)
!286 = !DISubprogram(name: "mbrtowc", scope: !166, file: !166, line: 367, type: !287, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!287 = !DISubroutineType(types: !288)
!288 = !{!237, !249, !282, !237, !283}
!289 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !290, line: 153)
!290 = !DISubprogram(name: "mbsinit", scope: !166, file: !166, line: 363, type: !291, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!291 = !DISubroutineType(types: !292)
!292 = !{!81, !293}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!295 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !296, line: 154)
!296 = !DISubprogram(name: "mbsrtowcs", scope: !166, file: !166, line: 410, type: !297, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!297 = !DISubroutineType(types: !298)
!298 = !{!237, !249, !299, !237, !283}
!299 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!301 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !302, line: 155)
!302 = !DISubprogram(name: "putwc", scope: !166, file: !166, line: 762, type: !253, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!303 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !304, line: 156)
!304 = !DISubprogram(name: "putwchar", scope: !166, file: !166, line: 768, type: !305, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!305 = !DISubroutineType(types: !306)
!306 = !{!180, !248}
!307 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !308, line: 158)
!308 = !DISubprogram(name: "swprintf", scope: !166, file: !166, line: 606, type: !309, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!309 = !DISubroutineType(types: !310)
!310 = !{!81, !249, !237, !259, null}
!311 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !312, line: 160)
!312 = !DISubprogram(name: "swscanf", scope: !166, file: !166, line: 647, type: !313, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!313 = !DISubroutineType(types: !314)
!314 = !{!81, !259, !259, null}
!315 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !316, line: 161)
!316 = !DISubprogram(name: "ungetwc", scope: !166, file: !166, line: 791, type: !317, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!317 = !DISubroutineType(types: !318)
!318 = !{!180, !180, !190}
!319 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !320, line: 162)
!320 = !DISubprogram(name: "vfwprintf", scope: !166, file: !166, line: 614, type: !321, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!321 = !DISubroutineType(types: !322)
!322 = !{!81, !250, !259, !323}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !325, identifier: "_ZTS13__va_list_tag")
!325 = !{!326, !327, !328, !329}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !324, file: !1, baseType: !153, size: 32, align: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !324, file: !1, baseType: !153, size: 32, align: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !324, file: !1, baseType: !232, size: 64, align: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !324, file: !1, baseType: !232, size: 64, align: 64, offset: 128)
!330 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !331, line: 164)
!331 = !DISubprogram(name: "vfwscanf", scope: !166, file: !166, line: 691, type: !321, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!332 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !333, line: 167)
!333 = !DISubprogram(name: "vswprintf", scope: !166, file: !166, line: 627, type: !334, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!334 = !DISubroutineType(types: !335)
!335 = !{!81, !249, !237, !259, !323}
!336 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !337, line: 170)
!337 = !DISubprogram(name: "vswscanf", scope: !166, file: !166, line: 703, type: !338, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!338 = !DISubroutineType(types: !339)
!339 = !{!81, !259, !259, !323}
!340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !341, line: 172)
!341 = !DISubprogram(name: "vwprintf", scope: !166, file: !166, line: 622, type: !342, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!342 = !DISubroutineType(types: !343)
!343 = !{!81, !259, !323}
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !345, line: 174)
!345 = !DISubprogram(name: "vwscanf", scope: !166, file: !166, line: 699, type: !342, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!346 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !347, line: 176)
!347 = !DISubprogram(name: "wcrtomb", scope: !166, file: !166, line: 372, type: !348, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!348 = !DISubroutineType(types: !349)
!349 = !{!237, !350, !248, !283}
!350 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !59)
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !352, line: 177)
!352 = !DISubprogram(name: "wcscat", scope: !166, file: !166, line: 157, type: !353, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!353 = !DISubroutineType(types: !354)
!354 = !{!247, !249, !259}
!355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !356, line: 178)
!356 = !DISubprogram(name: "wcscmp", scope: !166, file: !166, line: 165, type: !357, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!357 = !DISubroutineType(types: !358)
!358 = !{!81, !260, !260}
!359 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !360, line: 179)
!360 = !DISubprogram(name: "wcscoll", scope: !166, file: !166, line: 194, type: !357, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!361 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !362, line: 180)
!362 = !DISubprogram(name: "wcscpy", scope: !166, file: !166, line: 147, type: !353, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!363 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !364, line: 181)
!364 = !DISubprogram(name: "wcscspn", scope: !166, file: !166, line: 254, type: !365, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!365 = !DISubroutineType(types: !366)
!366 = !{!237, !260, !260}
!367 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !368, line: 182)
!368 = !DISubprogram(name: "wcsftime", scope: !166, file: !166, line: 857, type: !369, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!369 = !DISubroutineType(types: !370)
!370 = !{!237, !249, !237, !259, !371}
!371 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !374)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !166, line: 137, flags: DIFlagFwdDecl, identifier: "_ZTS2tm")
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !376, line: 183)
!376 = !DISubprogram(name: "wcslen", scope: !166, file: !166, line: 289, type: !377, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!377 = !DISubroutineType(types: !378)
!378 = !{!237, !260}
!379 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !380, line: 184)
!380 = !DISubprogram(name: "wcsncat", scope: !166, file: !166, line: 160, type: !381, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!381 = !DISubroutineType(types: !382)
!382 = !{!247, !249, !259, !237}
!383 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !384, line: 185)
!384 = !DISubprogram(name: "wcsncmp", scope: !166, file: !166, line: 168, type: !385, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!385 = !DISubroutineType(types: !386)
!386 = !{!81, !260, !260, !237}
!387 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !388, line: 186)
!388 = !DISubprogram(name: "wcsncpy", scope: !166, file: !166, line: 152, type: !381, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!389 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !390, line: 187)
!390 = !DISubprogram(name: "wcsrtombs", scope: !166, file: !166, line: 416, type: !391, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!391 = !DISubroutineType(types: !392)
!392 = !{!237, !350, !393, !237, !283}
!393 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!395 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !396, line: 188)
!396 = !DISubprogram(name: "wcsspn", scope: !166, file: !166, line: 258, type: !365, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !398, line: 189)
!398 = !DISubprogram(name: "wcstod", scope: !166, file: !166, line: 452, type: !399, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!399 = !DISubroutineType(types: !400)
!400 = !{!401, !259, !402}
!401 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!402 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!404 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !405, line: 191)
!405 = !DISubprogram(name: "wcstof", scope: !166, file: !166, line: 459, type: !406, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!406 = !DISubroutineType(types: !407)
!407 = !{!408, !259, !402}
!408 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !410, line: 193)
!410 = !DISubprogram(name: "wcstok", scope: !166, file: !166, line: 284, type: !411, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!411 = !DISubroutineType(types: !412)
!412 = !{!247, !249, !259, !402}
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !414, line: 194)
!414 = !DISubprogram(name: "wcstol", scope: !166, file: !166, line: 470, type: !415, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!415 = !DISubroutineType(types: !416)
!416 = !{!125, !259, !402, !81}
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !418, line: 195)
!418 = !DISubprogram(name: "wcstoul", scope: !166, file: !166, line: 475, type: !419, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!419 = !DISubroutineType(types: !420)
!420 = !{!23, !259, !402, !81}
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !422, line: 196)
!422 = !DISubprogram(name: "wcsxfrm", scope: !166, file: !166, line: 198, type: !423, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!423 = !DISubroutineType(types: !424)
!424 = !{!237, !249, !259, !237}
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !426, line: 197)
!426 = !DISubprogram(name: "wctob", scope: !166, file: !166, line: 396, type: !427, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!427 = !DISubroutineType(types: !428)
!428 = !{!81, !180}
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !430, line: 198)
!430 = !DISubprogram(name: "wmemcmp", scope: !166, file: !166, line: 327, type: !385, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !432, line: 199)
!432 = !DISubprogram(name: "wmemcpy", scope: !166, file: !166, line: 331, type: !381, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!433 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !434, line: 200)
!434 = !DISubprogram(name: "wmemmove", scope: !166, file: !166, line: 336, type: !435, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!435 = !DISubroutineType(types: !436)
!436 = !{!247, !247, !260, !237}
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !438, line: 201)
!438 = !DISubprogram(name: "wmemset", scope: !166, file: !166, line: 340, type: !439, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!439 = !DISubroutineType(types: !440)
!440 = !{!247, !247, !248, !237}
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !442, line: 202)
!442 = !DISubprogram(name: "wprintf", scope: !166, file: !166, line: 603, type: !443, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!443 = !DISubroutineType(types: !444)
!444 = !{!81, !259, null}
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !446, line: 203)
!446 = !DISubprogram(name: "wscanf", scope: !166, file: !166, line: 644, type: !443, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !448, line: 204)
!448 = !DISubprogram(name: "wcschr", scope: !166, file: !166, line: 229, type: !449, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!449 = !DISubroutineType(types: !450)
!450 = !{!247, !260, !248}
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !452, line: 205)
!452 = !DISubprogram(name: "wcspbrk", scope: !166, file: !166, line: 268, type: !453, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!453 = !DISubroutineType(types: !454)
!454 = !{!247, !260, !260}
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !456, line: 206)
!456 = !DISubprogram(name: "wcsrchr", scope: !166, file: !166, line: 239, type: !449, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !458, line: 207)
!458 = !DISubprogram(name: "wcsstr", scope: !166, file: !166, line: 279, type: !453, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !460, line: 208)
!460 = !DISubprogram(name: "wmemchr", scope: !166, file: !166, line: 322, type: !461, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!461 = !DISubroutineType(types: !462)
!462 = !{!247, !260, !248, !237}
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !464, line: 248)
!464 = !DISubprogram(name: "wcstold", scope: !166, file: !166, line: 461, type: !465, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!465 = !DISubroutineType(types: !466)
!466 = !{!467, !259, !402}
!467 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !469, line: 257)
!469 = !DISubprogram(name: "wcstoll", scope: !166, file: !166, line: 485, type: !470, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!470 = !DISubroutineType(types: !471)
!471 = !{!472, !259, !402, !81}
!472 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !474, line: 258)
!474 = !DISubprogram(name: "wcstoull", scope: !166, file: !166, line: 492, type: !475, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!475 = !DISubroutineType(types: !476)
!476 = !{!477, !259, !402, !81}
!477 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !464, line: 264)
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !469, line: 265)
!480 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !474, line: 266)
!481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !38, line: 44)
!482 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !124, line: 45)
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !484, line: 53)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !485, line: 53, size: 768, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTS5lconv")
!485 = !DIFile(filename: "/usr/include/locale.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !487, line: 54)
!487 = !DISubprogram(name: "setlocale", scope: !485, file: !485, line: 124, type: !488, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!488 = !DISubroutineType(types: !489)
!489 = !{!59, !81, !119}
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !491, line: 55)
!491 = !DISubprogram(name: "localeconv", scope: !485, file: !485, line: 127, type: !492, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!492 = !DISubroutineType(types: !493)
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64, align: 64)
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !496, line: 64)
!496 = !DISubprogram(name: "isalnum", scope: !497, file: !497, line: 110, type: !498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!497 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!498 = !DISubroutineType(types: !499)
!499 = !{!81, !81}
!500 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !501, line: 65)
!501 = !DISubprogram(name: "isalpha", scope: !497, file: !497, line: 111, type: !498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !503, line: 66)
!503 = !DISubprogram(name: "iscntrl", scope: !497, file: !497, line: 112, type: !498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!504 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !505, line: 67)
!505 = !DISubprogram(name: "isdigit", scope: !497, file: !497, line: 113, type: !498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!506 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !507, line: 68)
!507 = !DISubprogram(name: "isgraph", scope: !497, file: !497, line: 115, type: !498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !509, line: 69)
!509 = !DISubprogram(name: "islower", scope: !497, file: !497, line: 114, type: !498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !511, line: 70)
!511 = !DISubprogram(name: "isprint", scope: !497, file: !497, line: 116, type: !498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !513, line: 71)
!513 = !DISubprogram(name: "ispunct", scope: !497, file: !497, line: 117, type: !498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !515, line: 72)
!515 = !DISubprogram(name: "isspace", scope: !497, file: !497, line: 118, type: !498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !517, line: 73)
!517 = !DISubprogram(name: "isupper", scope: !497, file: !497, line: 119, type: !498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !519, line: 74)
!519 = !DISubprogram(name: "isxdigit", scope: !497, file: !497, line: 120, type: !498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !521, line: 75)
!521 = !DISubprogram(name: "tolower", scope: !497, file: !497, line: 124, type: !498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !523, line: 76)
!523 = !DISubprogram(name: "toupper", scope: !497, file: !497, line: 127, type: !498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !525, line: 82)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctrans_t", file: !526, line: 186, baseType: !527)
!526 = !DIFile(filename: "/usr/include/wctype.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !217, line: 40, baseType: !81)
!530 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !531, line: 83)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctype_t", file: !526, line: 52, baseType: !23)
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !180, line: 84)
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !534, line: 86)
!534 = !DISubprogram(name: "iswalnum", scope: !526, file: !526, line: 111, type: !427, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !536, line: 87)
!536 = !DISubprogram(name: "iswalpha", scope: !526, file: !526, line: 117, type: !427, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !538, line: 89)
!538 = !DISubprogram(name: "iswblank", scope: !526, file: !526, line: 162, type: !427, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !540, line: 91)
!540 = !DISubprogram(name: "iswcntrl", scope: !526, file: !526, line: 120, type: !427, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !542, line: 92)
!542 = !DISubprogram(name: "iswctype", scope: !526, file: !526, line: 175, type: !543, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!543 = !DISubroutineType(types: !544)
!544 = !{!81, !180, !531}
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !546, line: 93)
!546 = !DISubprogram(name: "iswdigit", scope: !526, file: !526, line: 124, type: !427, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !548, line: 94)
!548 = !DISubprogram(name: "iswgraph", scope: !526, file: !526, line: 128, type: !427, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !550, line: 95)
!550 = !DISubprogram(name: "iswlower", scope: !526, file: !526, line: 133, type: !427, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!551 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !552, line: 96)
!552 = !DISubprogram(name: "iswprint", scope: !526, file: !526, line: 136, type: !427, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !554, line: 97)
!554 = !DISubprogram(name: "iswpunct", scope: !526, file: !526, line: 141, type: !427, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !556, line: 98)
!556 = !DISubprogram(name: "iswspace", scope: !526, file: !526, line: 146, type: !427, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !558, line: 99)
!558 = !DISubprogram(name: "iswupper", scope: !526, file: !526, line: 151, type: !427, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !560, line: 100)
!560 = !DISubprogram(name: "iswxdigit", scope: !526, file: !526, line: 156, type: !427, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !562, line: 101)
!562 = !DISubprogram(name: "towctrans", scope: !526, file: !526, line: 221, type: !563, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!563 = !DISubroutineType(types: !564)
!564 = !{!180, !180, !525}
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !566, line: 102)
!566 = !DISubprogram(name: "towlower", scope: !526, file: !526, line: 194, type: !567, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!567 = !DISubroutineType(types: !568)
!568 = !{!180, !180}
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !570, line: 103)
!570 = !DISubprogram(name: "towupper", scope: !526, file: !526, line: 197, type: !567, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !572, line: 104)
!572 = !DISubprogram(name: "wctrans", scope: !526, file: !526, line: 218, type: !573, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!573 = !DISubroutineType(types: !574)
!574 = !{!525, !119}
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !576, line: 105)
!576 = !DISubprogram(name: "wctype", scope: !526, file: !526, line: 171, type: !577, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!577 = !DISubroutineType(types: !578)
!578 = !{!531, !119}
!579 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !580, line: 98)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !192, line: 48, baseType: !193)
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !582, line: 99)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !192, line: 110, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "_G_fpos_t", file: !584, line: 25, baseType: !585)
!584 = !DIFile(filename: "/usr/include/_G_config.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!585 = !DICompositeType(tag: DW_TAG_structure_type, file: !584, line: 21, size: 128, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTS9_G_fpos_t")
!586 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !587, line: 101)
!587 = !DISubprogram(name: "clearerr", scope: !192, file: !192, line: 826, type: !588, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!588 = !DISubroutineType(types: !589)
!589 = !{null, !590}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64, align: 64)
!591 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !592, line: 102)
!592 = !DISubprogram(name: "fclose", scope: !192, file: !192, line: 237, type: !593, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!593 = !DISubroutineType(types: !594)
!594 = !{!81, !590}
!595 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !596, line: 103)
!596 = !DISubprogram(name: "feof", scope: !192, file: !192, line: 828, type: !593, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !598, line: 104)
!598 = !DISubprogram(name: "ferror", scope: !192, file: !192, line: 830, type: !593, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!599 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !600, line: 105)
!600 = !DISubprogram(name: "fflush", scope: !192, file: !192, line: 242, type: !593, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !602, line: 106)
!602 = !DISubprogram(name: "fgetc", scope: !192, file: !192, line: 531, type: !593, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!603 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !604, line: 107)
!604 = !DISubprogram(name: "fgetpos", scope: !192, file: !192, line: 798, type: !605, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!605 = !DISubroutineType(types: !606)
!606 = !{!81, !607, !608}
!607 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !590)
!608 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64, align: 64)
!610 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !611, line: 108)
!611 = !DISubprogram(name: "fgets", scope: !192, file: !192, line: 622, type: !612, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!612 = !DISubroutineType(types: !613)
!613 = !{!59, !350, !81, !607}
!614 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !615, line: 109)
!615 = !DISubprogram(name: "fopen", scope: !192, file: !192, line: 272, type: !616, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!616 = !DISubroutineType(types: !617)
!617 = !{!590, !282, !282}
!618 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !619, line: 110)
!619 = !DISubprogram(name: "fprintf", scope: !192, file: !192, line: 356, type: !620, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!620 = !DISubroutineType(types: !621)
!621 = !{!81, !607, !282, null}
!622 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !623, line: 111)
!623 = !DISubprogram(name: "fputc", scope: !192, file: !192, line: 573, type: !624, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!624 = !DISubroutineType(types: !625)
!625 = !{!81, !81, !590}
!626 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !627, line: 112)
!627 = !DISubprogram(name: "fputs", scope: !192, file: !192, line: 689, type: !628, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!628 = !DISubroutineType(types: !629)
!629 = !{!81, !282, !607}
!630 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !631, line: 113)
!631 = !DISubprogram(name: "fread", scope: !192, file: !192, line: 709, type: !632, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!632 = !DISubroutineType(types: !633)
!633 = !{!237, !634, !237, !237, !607}
!634 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !232)
!635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !636, line: 114)
!636 = !DISubprogram(name: "freopen", scope: !192, file: !192, line: 278, type: !637, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!637 = !DISubroutineType(types: !638)
!638 = !{!590, !282, !282, !607}
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !640, line: 115)
!640 = !DISubprogram(name: "fscanf", scope: !192, file: !192, line: 425, type: !620, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !642, line: 116)
!642 = !DISubprogram(name: "fseek", scope: !192, file: !192, line: 749, type: !643, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!643 = !DISubroutineType(types: !644)
!644 = !{!81, !590, !125, !81}
!645 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !646, line: 117)
!646 = !DISubprogram(name: "fsetpos", scope: !192, file: !192, line: 803, type: !647, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!647 = !DISubroutineType(types: !648)
!648 = !{!81, !590, !649}
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64, align: 64)
!650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !582)
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !652, line: 118)
!652 = !DISubprogram(name: "ftell", scope: !192, file: !192, line: 754, type: !653, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!653 = !DISubroutineType(types: !654)
!654 = !{!125, !590}
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !656, line: 119)
!656 = !DISubprogram(name: "fwrite", scope: !192, file: !192, line: 715, type: !657, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!657 = !DISubroutineType(types: !658)
!658 = !{!237, !659, !237, !237, !607}
!659 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!662 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !663, line: 120)
!663 = !DISubprogram(name: "getc", scope: !192, file: !192, line: 532, type: !593, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!664 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !665, line: 121)
!665 = !DISubprogram(name: "getchar", scope: !666, file: !666, line: 44, type: !667, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!666 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!667 = !DISubroutineType(types: !668)
!668 = !{!81}
!669 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !670, line: 124)
!670 = !DISubprogram(name: "gets", scope: !192, file: !192, line: 638, type: !671, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!671 = !DISubroutineType(types: !672)
!672 = !{!59, !59}
!673 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !674, line: 126)
!674 = !DISubprogram(name: "perror", scope: !192, file: !192, line: 846, type: !675, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!675 = !DISubroutineType(types: !676)
!676 = !{null, !119}
!677 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !678, line: 127)
!678 = !DISubprogram(name: "printf", scope: !192, file: !192, line: 362, type: !679, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!679 = !DISubroutineType(types: !680)
!680 = !{!81, !282, null}
!681 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !682, line: 128)
!682 = !DISubprogram(name: "putc", scope: !192, file: !192, line: 574, type: !624, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!683 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !684, line: 129)
!684 = !DISubprogram(name: "putchar", scope: !666, file: !666, line: 79, type: !498, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!685 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !686, line: 130)
!686 = !DISubprogram(name: "puts", scope: !192, file: !192, line: 695, type: !687, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!687 = !DISubroutineType(types: !688)
!688 = !{!81, !119}
!689 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !690, line: 131)
!690 = !DISubprogram(name: "remove", scope: !192, file: !192, line: 178, type: !687, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!691 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !692, line: 132)
!692 = !DISubprogram(name: "rename", scope: !192, file: !192, line: 180, type: !693, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!693 = !DISubroutineType(types: !694)
!694 = !{!81, !119, !119}
!695 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !696, line: 133)
!696 = !DISubprogram(name: "rewind", scope: !192, file: !192, line: 759, type: !588, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!697 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !698, line: 134)
!698 = !DISubprogram(name: "scanf", scope: !192, file: !192, line: 431, type: !679, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!699 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !700, line: 135)
!700 = !DISubprogram(name: "setbuf", scope: !192, file: !192, line: 332, type: !701, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!701 = !DISubroutineType(types: !702)
!702 = !{null, !607, !350}
!703 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !704, line: 136)
!704 = !DISubprogram(name: "setvbuf", scope: !192, file: !192, line: 336, type: !705, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!705 = !DISubroutineType(types: !706)
!706 = !{!81, !607, !350, !81, !237}
!707 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !708, line: 137)
!708 = !DISubprogram(name: "sprintf", scope: !192, file: !192, line: 364, type: !709, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!709 = !DISubroutineType(types: !710)
!710 = !{!81, !350, !282, null}
!711 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !712, line: 138)
!712 = !DISubprogram(name: "sscanf", scope: !192, file: !192, line: 433, type: !713, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!713 = !DISubroutineType(types: !714)
!714 = !{!81, !282, !282, null}
!715 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !716, line: 139)
!716 = !DISubprogram(name: "tmpfile", scope: !192, file: !192, line: 195, type: !717, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!717 = !DISubroutineType(types: !718)
!718 = !{!590}
!719 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !720, line: 141)
!720 = !DISubprogram(name: "tmpnam", scope: !192, file: !192, line: 209, type: !671, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!721 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !722, line: 143)
!722 = !DISubprogram(name: "ungetc", scope: !192, file: !192, line: 702, type: !624, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!723 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !724, line: 144)
!724 = !DISubprogram(name: "vfprintf", scope: !192, file: !192, line: 371, type: !725, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!725 = !DISubroutineType(types: !726)
!726 = !{!81, !607, !282, !323}
!727 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !728, line: 145)
!728 = !DISubprogram(name: "vprintf", scope: !666, file: !666, line: 36, type: !729, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!729 = !DISubroutineType(types: !730)
!730 = !{!81, !282, !323}
!731 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !732, line: 146)
!732 = !DISubprogram(name: "vsprintf", scope: !192, file: !192, line: 379, type: !733, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!733 = !DISubroutineType(types: !734)
!734 = !{!81, !350, !282, !323}
!735 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !736, line: 175)
!736 = !DISubprogram(name: "snprintf", scope: !192, file: !192, line: 386, type: !737, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!737 = !DISubroutineType(types: !738)
!738 = !{!81, !350, !237, !282, null}
!739 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !740, line: 176)
!740 = !DISubprogram(name: "vfscanf", scope: !192, file: !192, line: 471, type: !725, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!741 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !742, line: 177)
!742 = !DISubprogram(name: "vscanf", scope: !192, file: !192, line: 479, type: !729, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!743 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !744, line: 178)
!744 = !DISubprogram(name: "vsnprintf", scope: !192, file: !192, line: 390, type: !745, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!745 = !DISubroutineType(types: !746)
!746 = !{!81, !350, !237, !282, !323}
!747 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !28, entity: !748, line: 179)
!748 = !DISubprogram(name: "vsscanf", scope: !192, file: !192, line: 483, type: !749, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!749 = !DISubroutineType(types: !750)
!750 = !{!81, !282, !282, !323}
!751 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !736, line: 185)
!752 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !740, line: 186)
!753 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !742, line: 187)
!754 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !744, line: 188)
!755 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !748, line: 189)
!756 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !0, entity: !9, line: 36)
!757 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !758, line: 102)
!758 = !DISubprogram(name: "acos", scope: !759, file: !759, line: 54, type: !760, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!759 = !DIFile(filename: "/usr/include/bits/mathcalls.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!760 = !DISubroutineType(types: !761)
!761 = !{!401, !401}
!762 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !763, line: 121)
!763 = !DISubprogram(name: "asin", scope: !759, file: !759, line: 56, type: !760, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!764 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !765, line: 140)
!765 = !DISubprogram(name: "atan", scope: !759, file: !759, line: 58, type: !760, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!766 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !767, line: 159)
!767 = !DISubprogram(name: "atan2", scope: !759, file: !759, line: 60, type: !768, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!768 = !DISubroutineType(types: !769)
!769 = !{!401, !401, !401}
!770 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !771, line: 180)
!771 = !DISubprogram(name: "ceil", scope: !759, file: !759, line: 178, type: !760, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!772 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !773, line: 199)
!773 = !DISubprogram(name: "cos", scope: !759, file: !759, line: 63, type: !760, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!774 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !775, line: 218)
!775 = !DISubprogram(name: "cosh", scope: !759, file: !759, line: 72, type: !760, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!776 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !777, line: 237)
!777 = !DISubprogram(name: "exp", scope: !759, file: !759, line: 100, type: !760, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!778 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !779, line: 256)
!779 = !DISubprogram(name: "fabs", scope: !759, file: !759, line: 181, type: !760, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!780 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !781, line: 275)
!781 = !DISubprogram(name: "floor", scope: !759, file: !759, line: 184, type: !760, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!782 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !783, line: 294)
!783 = !DISubprogram(name: "fmod", scope: !759, file: !759, line: 187, type: !768, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!784 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !785, line: 315)
!785 = !DISubprogram(name: "frexp", scope: !759, file: !759, line: 103, type: !786, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!786 = !DISubroutineType(types: !787)
!787 = !{!401, !401, !788}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!789 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !790, line: 334)
!790 = !DISubprogram(name: "ldexp", scope: !759, file: !759, line: 106, type: !791, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!791 = !DISubroutineType(types: !792)
!792 = !{!401, !401, !81}
!793 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !794, line: 353)
!794 = !DISubprogram(name: "log", scope: !759, file: !759, line: 109, type: !760, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!795 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !796, line: 372)
!796 = !DISubprogram(name: "log10", scope: !759, file: !759, line: 112, type: !760, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!797 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !798, line: 391)
!798 = !DISubprogram(name: "modf", scope: !759, file: !759, line: 115, type: !799, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!799 = !DISubroutineType(types: !800)
!800 = !{!401, !401, !801}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!802 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !803, line: 403)
!803 = !DISubprogram(name: "pow", scope: !759, file: !759, line: 153, type: !768, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!804 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !805, line: 440)
!805 = !DISubprogram(name: "sin", scope: !759, file: !759, line: 65, type: !760, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!806 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !807, line: 459)
!807 = !DISubprogram(name: "sinh", scope: !759, file: !759, line: 74, type: !760, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!808 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !809, line: 478)
!809 = !DISubprogram(name: "sqrt", scope: !759, file: !759, line: 156, type: !760, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!810 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !811, line: 497)
!811 = !DISubprogram(name: "tan", scope: !759, file: !759, line: 67, type: !760, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!812 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !9, entity: !813, line: 516)
!813 = !DISubprogram(name: "tanh", scope: !759, file: !759, line: 76, type: !760, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!814 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !0, entity: !9, line: 33)
!815 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !0, entity: !9, line: 37)
!816 = !{i32 2, !"Dwarf Version", i32 4}
!817 = !{i32 2, !"Debug Info Version", i32 3}
!818 = !{!"clang version 4.0.0 (http://gitlab.lsc.ic.unicamp.br/luis.mattos/DoAcrossClause-clang.git fe12e4b4ece0fc9f1e1d9cc24a1406f09e8c7a8a) (http://gitlab.lsc.ic.unicamp.br/luis.mattos/DoAcrossClause.git 6ee0695152160be155346b4d0d8daeaf01555185)"}
!819 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 72, type: !820, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !822)
!820 = !DISubroutineType(types: !821)
!821 = !{!81, !81, !121}
!822 = !{!823, !824, !825, !827, !828, !829, !833, !834, !835, !836, !845, !846}
!823 = !DILocalVariable(name: "argc", arg: 1, scope: !819, file: !1, line: 72, type: !81)
!824 = !DILocalVariable(name: "argv", arg: 2, scope: !819, file: !1, line: 72, type: !121)
!825 = !DILocalVariable(name: "args", scope: !819, file: !1, line: 80, type: !826)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!827 = !DILocalVariable(name: "ifp", scope: !819, file: !1, line: 87, type: !590)
!828 = !DILocalVariable(name: "ofp", scope: !819, file: !1, line: 88, type: !590)
!829 = !DILocalVariable(name: "iname", scope: !819, file: !1, line: 89, type: !830)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2048, align: 8, elements: !831)
!831 = !{!832}
!832 = !DISubrange(count: 256)
!833 = !DILocalVariable(name: "oname", scope: !819, file: !1, line: 89, type: !830)
!834 = !DILocalVariable(name: "exec", scope: !819, file: !1, line: 103, type: !81)
!835 = !DILocalVariable(name: "i", scope: !819, file: !1, line: 104, type: !81)
!836 = !DILocalVariable(name: "loop_time_start", scope: !819, file: !1, line: 105, type: !837)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "timer", file: !1, line: 36, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !839, line: 30, size: 128, align: 64, elements: !840, identifier: "_ZTS7timeval")
!839 = !DIFile(filename: "/usr/include/bits/time.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!840 = !{!841, !843}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !838, file: !839, line: 32, baseType: !842, size: 64, align: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !217, line: 139, baseType: !125)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !838, file: !839, line: 33, baseType: !844, size: 64, align: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !217, line: 141, baseType: !125)
!845 = !DILocalVariable(name: "loop_time_end", scope: !819, file: !1, line: 105, type: !837)
!846 = !DILocalVariable(name: "t", scope: !819, file: !1, line: 153, type: !401)
!847 = !DIExpression()
!848 = !DILocation(line: 72, column: 14, scope: !819)
!849 = !DILocation(line: 72, column: 26, scope: !819)
!850 = !DILocation(line: 73, column: 8, scope: !819)
!851 = !DILocation(line: 75, column: 12, scope: !852)
!852 = distinct !DILexicalBlock(scope: !819, file: !1, line: 75, column: 7)
!853 = !DILocation(line: 75, column: 7, scope: !819)
!854 = !DILocation(line: 76, column: 10, scope: !855)
!855 = distinct !DILexicalBlock(scope: !852, file: !1, line: 75, column: 18)
!856 = !DILocation(line: 77, column: 5, scope: !855)
!857 = !DILocation(line: 80, column: 18, scope: !858)
!858 = !DILexicalBlockFile(scope: !819, file: !1, discriminator: 1)
!859 = !DILocation(line: 80, column: 11, scope: !819)
!860 = !DILocation(line: 81, column: 8, scope: !861)
!861 = distinct !DILexicalBlock(scope: !819, file: !1, line: 81, column: 7)
!862 = !DILocation(line: 85, column: 3, scope: !858)
!863 = !DILocation(line: 85, column: 3, scope: !864)
!864 = !DILexicalBlockFile(scope: !819, file: !1, discriminator: 2)
!865 = !DILocation(line: 85, column: 3, scope: !866)
!866 = !DILexicalBlockFile(scope: !819, file: !1, discriminator: 3)
!867 = !DILocation(line: 85, column: 3, scope: !868)
!868 = !DILexicalBlockFile(scope: !819, file: !1, discriminator: 4)
!869 = !DILocation(line: 87, column: 28, scope: !858)
!870 = !DILocation(line: 87, column: 15, scope: !864)
!871 = !DILocation(line: 87, column: 9, scope: !819)
!872 = !DILocation(line: 88, column: 28, scope: !858)
!873 = !DILocation(line: 88, column: 15, scope: !864)
!874 = !DILocation(line: 88, column: 9, scope: !819)
!875 = !DILocation(line: 89, column: 3, scope: !819)
!876 = !DILocation(line: 89, column: 8, scope: !819)
!877 = !DILocation(line: 89, column: 3, scope: !858)
!878 = !DILocation(line: 89, column: 20, scope: !819)
!879 = !DILocation(line: 91, column: 10, scope: !858)
!880 = !DILocation(line: 91, column: 36, scope: !858)
!881 = !DILocation(line: 91, column: 3, scope: !858)
!882 = !DILocation(line: 92, column: 5, scope: !883)
!883 = distinct !DILexicalBlock(scope: !819, file: !1, line: 91, column: 44)
!884 = !DILocation(line: 94, column: 14, scope: !883)
!885 = !{!886, !886, i64 0}
!886 = !{!"int", !887, i64 0}
!887 = !{!"omnipotent char", !888, i64 0}
!888 = !{!"Simple C++ TBAA"}
!889 = !DILocation(line: 94, column: 5, scope: !883)
!890 = !DILocation(line: 94, column: 24, scope: !883)
!891 = !DILocation(line: 95, column: 15, scope: !883)
!892 = !DILocation(line: 95, column: 5, scope: !883)
!893 = !DILocation(line: 95, column: 25, scope: !883)
!894 = !DILocation(line: 96, column: 13, scope: !883)
!895 = !DILocation(line: 97, column: 5, scope: !883)
!896 = distinct !{!896, !897}
!897 = !DILocation(line: 91, column: 3, scope: !819)
!898 = !DILocation(line: 100, column: 3, scope: !819)
!899 = !DILocation(line: 101, column: 3, scope: !819)
!900 = !DILocation(line: 103, column: 3, scope: !819)
!901 = !DILocation(line: 103, column: 7, scope: !819)
!902 = !DILocation(line: 104, column: 3, scope: !819)
!903 = !DILocation(line: 105, column: 3, scope: !819)
!904 = !DILocation(line: 105, column: 3, scope: !858)
!905 = !DIExpression(DW_OP_deref)
!906 = !DILocation(line: 105, column: 9, scope: !819)
!907 = !DILocation(line: 107, column: 3, scope: !819)
!908 = !DILocation(line: 108, column: 9, scope: !819)
!909 = !DILocation(line: 104, column: 7, scope: !819)
!910 = !DILocation(line: 108, column: 9, scope: !858)
!911 = !DILocation(line: 105, column: 26, scope: !819)
!912 = !DILocation(line: 151, column: 3, scope: !819)
!913 = !{!914, !915, i64 0}
!914 = !{!"_ZTS7timeval", !915, i64 0, !915, i64 8}
!915 = !{!"long", !887, i64 0}
!916 = !{!914, !915, i64 8}
!917 = !DILocation(line: 153, column: 14, scope: !858)
!918 = !DILocation(line: 153, column: 10, scope: !819)
!919 = !DILocation(line: 154, column: 11, scope: !819)
!920 = !{!921, !921, i64 0}
!921 = !{!"any pointer", !887, i64 0}
!922 = !DILocation(line: 154, column: 56, scope: !819)
!923 = !DILocation(line: 154, column: 3, scope: !819)
!924 = !DILocation(line: 157, column: 1, scope: !925)
!925 = !DILexicalBlockFile(scope: !864, file: !1, discriminator: 6)
!926 = !DILocation(line: 157, column: 1, scope: !927)
!927 = !DILexicalBlockFile(scope: !864, file: !1, discriminator: 7)
!928 = !DILocation(line: 157, column: 1, scope: !929)
!929 = !DILexicalBlockFile(scope: !864, file: !1, discriminator: 8)
!930 = !DILocation(line: 157, column: 1, scope: !931)
!931 = !DILexicalBlockFile(scope: !864, file: !1, discriminator: 9)
!932 = !DILocation(line: 157, column: 1, scope: !933)
!933 = !DILexicalBlockFile(scope: !864, file: !1, discriminator: 10)
!934 = !DILocation(line: 157, column: 1, scope: !935)
!935 = !DILexicalBlockFile(scope: !864, file: !1, discriminator: 11)
!936 = !DILocation(line: 157, column: 1, scope: !868)
!937 = distinct !DISubprogram(name: "convertToString", linkageName: "_Z15convertToStringB5cxx11PPcm", scope: !1, file: !1, line: 165, type: !938, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !940)
!938 = !DISubroutineType(types: !939)
!939 = !{!826, !121, !237}
!940 = !{!941, !942, !943, !944}
!941 = !DILocalVariable(name: "in", arg: 1, scope: !937, file: !1, line: 165, type: !121)
!942 = !DILocalVariable(name: "size", arg: 2, scope: !937, file: !1, line: 165, type: !237)
!943 = !DILocalVariable(name: "args", scope: !937, file: !1, line: 166, type: !826)
!944 = !DILocalVariable(name: "i", scope: !945, file: !1, line: 167, type: !237)
!945 = distinct !DILexicalBlock(scope: !937, file: !1, line: 167, column: 3)
!946 = !DILocation(line: 165, column: 32, scope: !937)
!947 = !DILocation(line: 165, column: 43, scope: !937)
!948 = !DILocation(line: 166, column: 18, scope: !949)
!949 = !DILexicalBlockFile(scope: !937, file: !1, discriminator: 11)
!950 = !DILocation(line: 166, column: 18, scope: !937)
!951 = !DILocation(line: 166, column: 18, scope: !952)
!952 = !DILexicalBlockFile(scope: !937, file: !1, discriminator: 12)
!953 = !DILocation(line: 166, column: 18, scope: !954)
!954 = !DILexicalBlockFile(scope: !937, file: !1, discriminator: 13)
!955 = !DILocation(line: 166, column: 18, scope: !956)
!956 = !DILexicalBlockFile(scope: !937, file: !1, discriminator: 1)
!957 = !DILocation(line: 166, column: 18, scope: !958)
!958 = !DILexicalBlockFile(scope: !937, file: !1, discriminator: 2)
!959 = !DILocation(line: 166, column: 18, scope: !960)
!960 = !DILexicalBlockFile(scope: !937, file: !1, discriminator: 3)
!961 = !DILocation(line: 167, column: 3, scope: !962)
!962 = !DILexicalBlockFile(scope: !963, file: !1, discriminator: 1)
!963 = distinct !DILexicalBlock(scope: !945, file: !1, line: 167, column: 3)
!964 = !DILocation(line: 168, column: 5, scope: !965)
!965 = distinct !DILexicalBlock(scope: !963, file: !1, line: 167, column: 37)
!966 = !DILocation(line: 170, column: 3, scope: !937)
!967 = !DILocation(line: 168, column: 15, scope: !965)
!968 = !DILocation(line: 168, column: 13, scope: !965)
!969 = !DILocation(line: 167, column: 33, scope: !970)
!970 = !DILexicalBlockFile(scope: !963, file: !1, discriminator: 3)
!971 = !DILocation(line: 167, column: 15, scope: !945)
!972 = distinct !{!972, !973}
!973 = !DILocation(line: 167, column: 3, scope: !937)
!974 = distinct !DISubprogram(name: "parseArgs", linkageName: "_Z9parseArgsPNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEERiRjS7_S7_RS4_S8_", scope: !1, file: !1, line: 179, type: !975, isLocal: false, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !980)
!975 = !DISubroutineType(types: !976)
!976 = !{!76, !826, !977, !978, !978, !978, !979, !979}
!977 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !81, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !153, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !144, size: 64, align: 64)
!980 = !{!981, !982, !983, !984, !985, !986, !987, !988}
!981 = !DILocalVariable(name: "args", arg: 1, scope: !974, file: !1, line: 179, type: !826)
!982 = !DILocalVariable(name: "angle", arg: 2, scope: !974, file: !1, line: 179, type: !977)
!983 = !DILocalVariable(name: "xres", arg: 3, scope: !974, file: !1, line: 179, type: !978)
!984 = !DILocalVariable(name: "yres", arg: 4, scope: !974, file: !1, line: 179, type: !978)
!985 = !DILocalVariable(name: "rpp", arg: 5, scope: !974, file: !1, line: 180, type: !978)
!986 = !DILocalVariable(name: "inname", arg: 6, scope: !974, file: !1, line: 180, type: !979)
!987 = !DILocalVariable(name: "outname", arg: 7, scope: !974, file: !1, line: 180, type: !979)
!988 = !DILocalVariable(name: "tmp", scope: !974, file: !1, line: 181, type: !119)
!989 = !DILocation(line: 179, column: 24, scope: !974)
!990 = !DILocation(line: 179, column: 35, scope: !974)
!991 = !DILocation(line: 179, column: 56, scope: !974)
!992 = !DILocation(line: 179, column: 76, scope: !974)
!993 = !DILocation(line: 180, column: 30, scope: !974)
!994 = !DILocation(line: 180, column: 43, scope: !974)
!995 = !DILocation(line: 180, column: 59, scope: !974)
!996 = !DILocation(line: 181, column: 21, scope: !974)
!997 = !DILocation(line: 181, column: 29, scope: !998)
!998 = !DILexicalBlockFile(scope: !974, file: !1, discriminator: 1)
!999 = !DILocation(line: 181, column: 15, scope: !974)
!1000 = !DILocation(line: 182, column: 11, scope: !974)
!1001 = !DILocation(line: 182, column: 21, scope: !974)
!1002 = !DILocation(line: 182, column: 9, scope: !974)
!1003 = !DILocation(line: 183, column: 15, scope: !974)
!1004 = !DILocation(line: 183, column: 23, scope: !974)
!1005 = !DILocation(line: 183, column: 10, scope: !998)
!1006 = !DILocation(line: 183, column: 8, scope: !974)
!1007 = !DILocation(line: 184, column: 15, scope: !974)
!1008 = !DILocation(line: 184, column: 23, scope: !974)
!1009 = !DILocation(line: 184, column: 10, scope: !998)
!1010 = !DILocation(line: 184, column: 8, scope: !974)
!1011 = !DILocation(line: 185, column: 14, scope: !974)
!1012 = !DILocation(line: 185, column: 22, scope: !974)
!1013 = !DILocation(line: 185, column: 9, scope: !998)
!1014 = !DILocation(line: 185, column: 7, scope: !974)
!1015 = !DILocation(line: 187, column: 7, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !974, file: !1, line: 187, column: 7)
!1017 = !DILocation(line: 187, column: 13, scope: !1016)
!1018 = !DILocation(line: 187, column: 20, scope: !1019)
!1019 = !DILexicalBlockFile(scope: !1016, file: !1, discriminator: 1)
!1020 = !DILocation(line: 187, column: 25, scope: !1019)
!1021 = !DILocation(line: 187, column: 17, scope: !1016)
!1022 = !DILocation(line: 187, column: 33, scope: !1023)
!1023 = !DILexicalBlockFile(scope: !1016, file: !1, discriminator: 2)
!1024 = !DILocation(line: 187, column: 38, scope: !1023)
!1025 = !DILocation(line: 187, column: 50, scope: !1026)
!1026 = !DILexicalBlockFile(scope: !1016, file: !1, discriminator: 3)
!1027 = !DILocation(line: 188, column: 10, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1016, file: !1, line: 187, column: 55)
!1029 = !DILocation(line: 188, column: 38, scope: !1030)
!1030 = !DILexicalBlockFile(scope: !1028, file: !1, discriminator: 1)
!1031 = !DILocation(line: 189, column: 5, scope: !1028)
!1032 = !DILocation(line: 192, column: 12, scope: !974)
!1033 = !DILocation(line: 192, column: 10, scope: !974)
!1034 = !DILocation(line: 193, column: 13, scope: !974)
!1035 = !DILocation(line: 193, column: 11, scope: !974)
!1036 = !DILocation(line: 194, column: 3, scope: !974)
!1037 = distinct !DISubprogram(name: ".omp_outlined.", scope: !1, file: !1, line: 108, type: !1038, isLocal: true, isDefinition: true, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !1043)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{null, !1040, !1040, !977, !977, !1042, !23, !23, !23, !23, !1042}
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1041)
!1041 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !788)
!1042 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !143, size: 64, align: 64)
!1043 = !{!1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1058, !1059, !1061, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1180}
!1044 = !DILocalVariable(name: ".global_tid.", arg: 1, scope: !1037, type: !1040, flags: DIFlagArtificial | DIFlagObjectPointer)
!1045 = !DILocalVariable(name: ".bound_tid.", arg: 2, scope: !1037, type: !1040, flags: DIFlagArtificial)
!1046 = !DILocalVariable(name: "i", arg: 3, scope: !1037, type: !977, flags: DIFlagArtificial)
!1047 = !DILocalVariable(name: "exec", arg: 4, scope: !1037, type: !977, flags: DIFlagArtificial)
!1048 = !DILocalVariable(name: "srcfiles", arg: 5, scope: !1037, type: !1042, flags: DIFlagArtificial)
!1049 = !DILocalVariable(name: "xres", arg: 6, scope: !1037, type: !23, flags: DIFlagArtificial)
!1050 = !DILocalVariable(name: "yres", arg: 7, scope: !1037, type: !23, flags: DIFlagArtificial)
!1051 = !DILocalVariable(name: "rpp", arg: 8, scope: !1037, type: !23, flags: DIFlagArtificial)
!1052 = !DILocalVariable(name: "angle", arg: 9, scope: !1037, type: !23, flags: DIFlagArtificial)
!1053 = !DILocalVariable(name: "destfiles", arg: 10, scope: !1037, type: !1042, flags: DIFlagArtificial)
!1054 = !DILocalVariable(name: "srcfiles", scope: !1037, type: !143, flags: DIFlagArtificial)
!1055 = !DILocalVariable(name: "destfiles", scope: !1037, type: !143, flags: DIFlagArtificial)
!1056 = !DILocalVariable(name: "__threadID__", scope: !1057, file: !1, line: 110, type: !81)
!1057 = distinct !DILexicalBlock(scope: !1037, file: !1, line: 109, column: 3)
!1058 = !DILocalVariable(name: "__numThreads__", scope: !1057, file: !1, line: 111, type: !81)
!1059 = !DILocalVariable(name: ".omp.iv", scope: !1060, type: !81, flags: DIFlagArtificial)
!1060 = distinct !DILexicalBlock(scope: !1057, file: !1, line: 113, column: 11)
!1061 = !DILocalVariable(name: ".capture_expr.", scope: !1060, type: !81, flags: DIFlagArtificial)
!1062 = !DILocalVariable(name: "i", scope: !1060, type: !81, flags: DIFlagArtificial)
!1063 = !DILocalVariable(name: ".omp.lb", scope: !1060, type: !81, flags: DIFlagArtificial)
!1064 = !DILocalVariable(name: ".omp.ub", scope: !1060, type: !81, flags: DIFlagArtificial)
!1065 = !DILocalVariable(name: ".omp.stride", scope: !1060, type: !81, flags: DIFlagArtificial)
!1066 = !DILocalVariable(name: ".omp.is_last", scope: !1060, type: !81, flags: DIFlagArtificial)
!1067 = !DILocalVariable(name: "re", scope: !1068, file: !1, line: 118, type: !1069)
!1068 = distinct !DILexicalBlock(scope: !1060, file: !1, line: 114, column: 34)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "RotateEngine", file: !1071, line: 43, size: 960, align: 64, elements: !1072, identifier: "_ZTS12RotateEngine")
!1071 = !DIFile(filename: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/rotation_engine.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!1072 = !{!1073, !1074, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1150, !1151, !1152, !1155, !1156, !1159, !1163, !1166, !1169, !1170, !1173, !1174, !1177}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "destname", scope: !1070, file: !1071, line: 52, baseType: !144, size: 256, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !1070, file: !1071, line: 53, baseType: !1075, size: 64, align: 64, offset: 256)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Image", file: !1077, line: 63, size: 256, align: 64, elements: !1078, identifier: "_ZTS5Image")
!1077 = !DIFile(filename: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/image.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!1078 = !{!1079, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1093, !1096, !1099, !1102, !1105, !1114, !1117, !1118, !1119, !1120, !1123, !1131}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !1076, file: !1077, line: 77, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pixel", file: !1077, line: 45, baseType: !1082)
!1082 = !DICompositeType(tag: DW_TAG_structure_type, file: !1077, line: 43, size: 24, align: 8, flags: DIFlagFwdDecl, identifier: "_ZTS5Pixel")
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1076, file: !1077, line: 78, baseType: !153, size: 32, align: 32, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1076, file: !1077, line: 78, baseType: !153, size: 32, align: 32, offset: 96)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1076, file: !1077, line: 79, baseType: !153, size: 32, align: 32, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "maxcolor", scope: !1076, file: !1077, line: 79, baseType: !153, size: 32, align: 32, offset: 160)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "x_off", scope: !1076, file: !1077, line: 80, baseType: !408, size: 32, align: 32, offset: 192)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "y_off", scope: !1076, file: !1077, line: 80, baseType: !408, size: 32, align: 32, offset: 224)
!1089 = !DISubprogram(name: "createImageFromBuffer", linkageName: "_ZN5Image21createImageFromBufferEiiiP5Pixel", scope: !1076, file: !1077, line: 65, type: !1090, isLocal: false, isDefinition: false, scopeLine: 65, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{null, !1092, !81, !81, !81, !1080}
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1093 = !DISubprogram(name: "createImageFromFile", linkageName: "_ZN5Image19createImageFromFileEPKc", scope: !1076, file: !1077, line: 66, type: !1094, isLocal: false, isDefinition: false, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!76, !1092, !119}
!1096 = !DISubprogram(name: "createImageFromTemplate", linkageName: "_ZN5Image23createImageFromTemplateEiii", scope: !1076, file: !1077, line: 67, type: !1097, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{null, !1092, !81, !81, !81}
!1099 = !DISubprogram(name: "getPixelAt", linkageName: "_ZN5Image10getPixelAtEii", scope: !1076, file: !1077, line: 68, type: !1100, isLocal: false, isDefinition: false, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!1081, !1092, !81, !81}
!1102 = !DISubprogram(name: "setPixelAt", linkageName: "_ZN5Image10setPixelAtEiiP5Pixel", scope: !1076, file: !1077, line: 69, type: !1103, isLocal: false, isDefinition: false, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{null, !1092, !81, !81, !1080}
!1105 = !DISubprogram(name: "containsPixel", linkageName: "_ZN5Image13containsPixelEP5Coord", scope: !1076, file: !1077, line: 70, type: !1106, isLocal: false, isDefinition: false, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!76, !1092, !1108}
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "Coord", file: !1077, line: 55, baseType: !1110)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1077, line: 52, size: 64, align: 32, elements: !1111, identifier: "_ZTS5Coord")
!1111 = !{!1112, !1113}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1110, file: !1077, line: 53, baseType: !408, size: 32, align: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1110, file: !1077, line: 54, baseType: !408, size: 32, align: 32, offset: 32)
!1114 = !DISubprogram(name: "getWidth", linkageName: "_ZN5Image8getWidthEv", scope: !1076, file: !1077, line: 71, type: !1115, isLocal: false, isDefinition: false, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!153, !1092}
!1117 = !DISubprogram(name: "getHeight", linkageName: "_ZN5Image9getHeightEv", scope: !1076, file: !1077, line: 72, type: !1115, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1118 = !DISubprogram(name: "getDepth", linkageName: "_ZN5Image8getDepthEv", scope: !1076, file: !1077, line: 73, type: !1115, isLocal: false, isDefinition: false, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1119 = !DISubprogram(name: "getMaxcolor", linkageName: "_ZN5Image11getMaxcolorEv", scope: !1076, file: !1077, line: 74, type: !1115, isLocal: false, isDefinition: false, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1120 = !DISubprogram(name: "clean", linkageName: "_ZN5Image5cleanEv", scope: !1076, file: !1077, line: 75, type: !1121, isLocal: false, isDefinition: false, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{null, !1092}
!1123 = !DISubprogram(name: "ppmGetInt", linkageName: "_ZN5Image9ppmGetIntERSt13basic_fstreamIcSt11char_traitsIcEE", scope: !1076, file: !1077, line: 81, type: !1124, isLocal: false, isDefinition: false, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: true)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!81, !1092, !1126}
!1126 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "fstream", scope: !9, file: !1128, line: 168, baseType: !1129)
!1128 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/iosfwd", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!1129 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_fstream<char, std::char_traits<char> >", scope: !9, file: !1130, line: 1056, size: 4224, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTSSt13basic_fstreamIcSt11char_traitsIcEE")
!1130 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/bits/fstream.tcc", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!1131 = !DISubprogram(name: "ppmGetChar", linkageName: "_ZN5Image10ppmGetCharERSt13basic_fstreamIcSt11char_traitsIcEE", scope: !1076, file: !1077, line: 82, type: !1132, isLocal: false, isDefinition: false, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!60, !1092, !1126}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !1070, file: !1071, line: 53, baseType: !1075, size: 64, align: 64, offset: 320)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !1070, file: !1071, line: 54, baseType: !153, size: 32, align: 32, offset: 384)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1070, file: !1071, line: 55, baseType: !76, size: 8, align: 8, offset: 416)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1070, file: !1071, line: 55, baseType: !76, size: 8, align: 8, offset: 424)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "ul", scope: !1070, file: !1071, line: 56, baseType: !1109, size: 64, align: 32, offset: 448)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ur", scope: !1070, file: !1071, line: 56, baseType: !1109, size: 64, align: 32, offset: 512)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "ll", scope: !1070, file: !1071, line: 56, baseType: !1109, size: 64, align: 32, offset: 576)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "lr", scope: !1070, file: !1071, line: 56, baseType: !1109, size: 64, align: 32, offset: 640)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "c1", scope: !1070, file: !1071, line: 56, baseType: !1109, size: 64, align: 32, offset: 704)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "c2", scope: !1070, file: !1071, line: 56, baseType: !1109, size: 64, align: 32, offset: 768)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "c3", scope: !1070, file: !1071, line: 56, baseType: !1109, size: 64, align: 32, offset: 832)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "c4", scope: !1070, file: !1071, line: 56, baseType: !1109, size: 64, align: 32, offset: 896)
!1146 = !DISubprogram(name: "RotateEngine", scope: !1070, file: !1071, line: 45, type: !1147, isLocal: false, isDefinition: false, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{null, !1149}
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!1150 = !DISubprogram(name: "run", linkageName: "_ZN12RotateEngine3runEv", scope: !1070, file: !1071, line: 46, type: !1147, isLocal: false, isDefinition: false, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1151 = !DISubprogram(name: "finish", linkageName: "_ZN12RotateEngine6finishEv", scope: !1070, file: !1071, line: 47, type: !1147, isLocal: false, isDefinition: false, scopeLine: 47, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1152 = !DISubprogram(name: "init", linkageName: "_ZN12RotateEngine4initEP5ImagejNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE", scope: !1070, file: !1071, line: 48, type: !1153, isLocal: false, isDefinition: false, scopeLine: 48, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!76, !1149, !1075, !153, !144}
!1155 = !DISubprogram(name: "printRotationState", linkageName: "_ZN12RotateEngine18printRotationStateEv", scope: !1070, file: !1071, line: 49, type: !1147, isLocal: false, isDefinition: false, scopeLine: 49, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!1156 = !DISubprogram(name: "writeOutImage", linkageName: "_ZN12RotateEngine13writeOutImageEv", scope: !1070, file: !1071, line: 58, type: !1157, isLocal: false, isDefinition: false, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: true)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!76, !1149}
