; ModuleID = 'CMakeFiles/serial.dir/ray_engine-inst.cpp'
source_filename = "CMakeFiles/serial.dir/ray_engine-inst.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.std::basic_ostream" = type { i32 (...)**, %"class.std::basic_ios" }
%"class.std::basic_ios" = type { %"class.std::ios_base", %"class.std::basic_ostream"*, i8, i8, %"class.std::basic_streambuf"*, %"class.std::ctype"*, %"class.std::num_put"*, %"class.std::num_get"* }
%"class.std::ios_base" = type { i32 (...)**, i64, i64, i32, i32, i32, %"struct.std::ios_base::_Callback_list"*, %"struct.std::ios_base::_Words", [8 x %"struct.std::ios_base::_Words"], i32, %"struct.std::ios_base::_Words"*, %"class.std::locale" }
%"struct.std::ios_base::_Callback_list" = type { %"struct.std::ios_base::_Callback_list"*, void (i32, %"class.std::ios_base"*, i32)*, i32, i32 }
%"struct.std::ios_base::_Words" = type { i8*, i64 }
%"class.std::locale" = type { %"class.std::locale::_Impl"* }
%"class.std::locale::_Impl" = type { i32, %"class.std::locale::facet"**, i64, %"class.std::locale::facet"**, i8** }
%"class.std::locale::facet" = type <{ i32 (...)**, i32, [4 x i8] }>
%"class.std::basic_streambuf" = type { i32 (...)**, i8*, i8*, i8*, i8*, i8*, i8*, %"class.std::locale" }
%"class.std::ctype" = type <{ %"class.std::locale::facet.base", [4 x i8], %struct.__locale_struct*, i8, [7 x i8], i32*, i32*, i16*, i8, [256 x i8], [256 x i8], i8, [6 x i8] }>

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 4.0.0 (http://gitlab.lsc.ic.unicamp.br/luis.mattos/DoAcrossClause-clang.git fe12e4b4ece0fc9f1e1d9cc24a1406f09e8c7a8a) (http://gitlab.lsc.ic.unicamp.br/luis.mattos/DoAcrossClause.git 6ee0695152160be155346b4d0d8daeaf01555185)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !15, globals: !28, imports: !276)
!1 = !DIFile(filename: "CMakeFiles/serial.dir/ray_engine-inst.cpp", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Ios_Iostate", scope: !5, file: !4, line: 153, size: 32, align: 32, elements: !7, identifier: "_ZTSSt12_Ios_Iostate")
!4 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/bits/ios_base.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!5 = !DINamespace(name: "std", scope: null, file: !6, line: 1967)
!6 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/x86_64-redhat-linux/bits/c++config.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!7 = !{!8, !9, !10, !11, !12, !13, !14}
!8 = !DIEnumerator(name: "_S_goodbit", value: 0)
!9 = !DIEnumerator(name: "_S_badbit", value: 1)
!10 = !DIEnumerator(name: "_S_eofbit", value: 2)
!11 = !DIEnumerator(name: "_S_failbit", value: 4)
!12 = !DIEnumerator(name: "_S_ios_iostate_end", value: 65536)
!13 = !DIEnumerator(name: "_S_ios_iostate_max", value: 2147483647)
!14 = !DIEnumerator(name: "_S_ios_iostate_min", value: -2147483648)
!15 = !{!16, !17, !18, !19, !22, !3, !26, !27}
!16 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamsize", scope: !5, file: !23, line: 98, baseType: !24)
!23 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/bits/postypes.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", scope: !5, file: !6, line: 1970, baseType: !25)
!25 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!26 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!27 = !DICompositeType(tag: DW_TAG_class_type, name: "ios_base", scope: !5, file: !4, line: 228, size: 1728, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTSSt8ios_base")
!28 = !{!29, !263}
!29 = distinct !DIGlobalVariable(name: "sf", scope: !30, file: !1, line: 352, type: !16, isLocal: true, isDefinition: true, variable: double* @_ZZN9RayEngine14get_sample_posEiiiE2sf)
!30 = distinct !DISubprogram(name: "get_sample_pos", linkageName: "_ZN9RayEngine14get_sample_posEiii", scope: !31, file: !1, line: 347, type: !245, isLocal: false, isDefinition: true, scopeLine: 347, flags: DIFlagPrototyped, isOptimized: true, unit: !0, declaration: !244, variables: !253)
!31 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "RayEngine", file: !32, line: 87, size: 233472, align: 64, elements: !33, identifier: "_ZTS9RayEngine")
!32 = !DIFile(filename: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/ray_engine.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!33 = !{!34, !35, !36, !37, !38, !56, !60, !61, !67, !71, !73, !140, !149, !152, !153, !157, !158, !162, !220, !227, !237, !240, !241, !244, !247, !248}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "xres", scope: !31, file: !32, line: 95, baseType: !17, size: 32, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "yres", scope: !31, file: !32, line: 96, baseType: !17, size: 32, align: 32, offset: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "rays_per_pixel", scope: !31, file: !32, line: 97, baseType: !17, size: 32, align: 32, offset: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "aspect", scope: !31, file: !32, line: 98, baseType: !16, size: 64, align: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "obj_list", scope: !31, file: !32, line: 99, baseType: !39, size: 64, align: 64, offset: 192)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sphere", file: !32, line: 70, size: 640, align: 64, elements: !41, identifier: "_ZTS6sphere")
!41 = !{!42, !48, !49, !55}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !40, file: !32, line: 71, baseType: !43, size: 192, align: 64)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vec3", file: !32, line: 56, size: 192, align: 64, elements: !44, identifier: "_ZTS4vec3")
!44 = !{!45, !46, !47}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !43, file: !32, line: 57, baseType: !16, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !43, file: !32, line: 57, baseType: !16, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !43, file: !32, line: 57, baseType: !16, size: 64, align: 64, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "rad", scope: !40, file: !32, line: 72, baseType: !16, size: 64, align: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "mat", scope: !40, file: !32, line: 73, baseType: !50, size: 320, align: 64, offset: 256)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "material", file: !32, line: 64, size: 320, align: 64, elements: !51, identifier: "_ZTS8material")
!51 = !{!52, !53, !54}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !50, file: !32, line: 65, baseType: !43, size: 192, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "spow", scope: !50, file: !32, line: 66, baseType: !16, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "refl", scope: !50, file: !32, line: 67, baseType: !16, size: 64, align: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !40, file: !32, line: 74, baseType: !39, size: 64, align: 64, offset: 576)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "lights", scope: !31, file: !32, line: 100, baseType: !57, size: 3072, align: 64, offset: 256)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 3072, align: 64, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 16)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "lnum", scope: !31, file: !32, line: 101, baseType: !17, size: 32, align: 32, offset: 3328)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "cam", scope: !31, file: !32, line: 102, baseType: !62, size: 448, align: 64, offset: 3392)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "camera", file: !32, line: 82, size: 448, align: 64, elements: !63, identifier: "_ZTS6camera")
!63 = !{!64, !65, !66}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !62, file: !32, line: 83, baseType: !43, size: 192, align: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "targ", scope: !62, file: !32, line: 83, baseType: !43, size: 192, align: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "fov", scope: !62, file: !32, line: 84, baseType: !16, size: 64, align: 64, offset: 384)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "urand", scope: !31, file: !32, line: 103, baseType: !68, size: 196608, align: 64, offset: 3840)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 196608, align: 64, elements: !69)
!69 = !{!70}
!70 = !DISubrange(count: 1024)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "irand", scope: !31, file: !32, line: 104, baseType: !72, size: 32768, align: 32, offset: 200448)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 32768, align: 32, elements: !69)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !31, file: !32, line: 105, baseType: !74, size: 256, align: 64, offset: 233216)
!74 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Image", file: !75, line: 63, size: 256, align: 64, elements: !76, identifier: "_ZTS5Image")
!75 = !DIFile(filename: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/image.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!76 = !{!77, !87, !89, !90, !91, !92, !94, !95, !99, !105, !108, !111, !114, !120, !123, !124, !125, !126, !129, !137}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !74, file: !75, line: 77, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pixel", file: !75, line: 45, baseType: !80)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 43, size: 24, align: 8, elements: !81, identifier: "_ZTS5Pixel")
!81 = !{!82, !85, !86}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !80, file: !75, line: 44, baseType: !83, size: 8, align: 8)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !84, line: 48, baseType: !26)
!84 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!85 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !80, file: !75, line: 44, baseType: !83, size: 8, align: 8, offset: 8)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !80, file: !75, line: 44, baseType: !83, size: 8, align: 8, offset: 16)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !74, file: !75, line: 78, baseType: !88, size: 32, align: 32, offset: 64)
!88 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !74, file: !75, line: 78, baseType: !88, size: 32, align: 32, offset: 96)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !74, file: !75, line: 79, baseType: !88, size: 32, align: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "maxcolor", scope: !74, file: !75, line: 79, baseType: !88, size: 32, align: 32, offset: 160)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "x_off", scope: !74, file: !75, line: 80, baseType: !93, size: 32, align: 32, offset: 192)
!93 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "y_off", scope: !74, file: !75, line: 80, baseType: !93, size: 32, align: 32, offset: 224)
!95 = !DISubprogram(name: "createImageFromBuffer", linkageName: "_ZN5Image21createImageFromBufferEiiiP5Pixel", scope: !74, file: !75, line: 65, type: !96, isLocal: false, isDefinition: false, scopeLine: 65, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!96 = !DISubroutineType(types: !97)
!97 = !{null, !98, !17, !17, !17, !78}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!99 = !DISubprogram(name: "createImageFromFile", linkageName: "_ZN5Image19createImageFromFileEPKc", scope: !74, file: !75, line: 66, type: !100, isLocal: false, isDefinition: false, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !98, !103}
!102 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!105 = !DISubprogram(name: "createImageFromTemplate", linkageName: "_ZN5Image23createImageFromTemplateEiii", scope: !74, file: !75, line: 67, type: !106, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !98, !17, !17, !17}
!108 = !DISubprogram(name: "getPixelAt", linkageName: "_ZN5Image10getPixelAtEii", scope: !74, file: !75, line: 68, type: !109, isLocal: false, isDefinition: false, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!109 = !DISubroutineType(types: !110)
!110 = !{!79, !98, !17, !17}
!111 = !DISubprogram(name: "setPixelAt", linkageName: "_ZN5Image10setPixelAtEiiP5Pixel", scope: !74, file: !75, line: 69, type: !112, isLocal: false, isDefinition: false, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !98, !17, !17, !78}
!114 = !DISubprogram(name: "containsPixel", linkageName: "_ZN5Image13containsPixelEP5Coord", scope: !74, file: !75, line: 70, type: !115, isLocal: false, isDefinition: false, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!115 = !DISubroutineType(types: !116)
!116 = !{!102, !98, !117}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "Coord", file: !75, line: 55, baseType: !119)
!119 = !DICompositeType(tag: DW_TAG_structure_type, file: !75, line: 52, size: 64, align: 32, flags: DIFlagFwdDecl, identifier: "_ZTS5Coord")
!120 = !DISubprogram(name: "getWidth", linkageName: "_ZN5Image8getWidthEv", scope: !74, file: !75, line: 71, type: !121, isLocal: false, isDefinition: false, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!121 = !DISubroutineType(types: !122)
!122 = !{!88, !98}
!123 = !DISubprogram(name: "getHeight", linkageName: "_ZN5Image9getHeightEv", scope: !74, file: !75, line: 72, type: !121, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!124 = !DISubprogram(name: "getDepth", linkageName: "_ZN5Image8getDepthEv", scope: !74, file: !75, line: 73, type: !121, isLocal: false, isDefinition: false, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!125 = !DISubprogram(name: "getMaxcolor", linkageName: "_ZN5Image11getMaxcolorEv", scope: !74, file: !75, line: 74, type: !121, isLocal: false, isDefinition: false, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!126 = !DISubprogram(name: "clean", linkageName: "_ZN5Image5cleanEv", scope: !74, file: !75, line: 75, type: !127, isLocal: false, isDefinition: false, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !98}
!129 = !DISubprogram(name: "ppmGetInt", linkageName: "_ZN5Image9ppmGetIntERSt13basic_fstreamIcSt11char_traitsIcEE", scope: !74, file: !75, line: 81, type: !130, isLocal: false, isDefinition: false, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: true)
!130 = !DISubroutineType(types: !131)
!131 = !{!17, !98, !132}
!132 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "fstream", scope: !5, file: !134, line: 168, baseType: !135)
!134 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/iosfwd", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!135 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_fstream<char, std::char_traits<char> >", scope: !5, file: !136, line: 1056, size: 4224, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTSSt13basic_fstreamIcSt11char_traitsIcEE")
!136 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/bits/fstream.tcc", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!137 = !DISubprogram(name: "ppmGetChar", linkageName: "_ZN5Image10ppmGetCharERSt13basic_fstreamIcSt11char_traitsIcEE", scope: !74, file: !75, line: 82, type: !138, isLocal: false, isDefinition: false, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true)
!138 = !DISubroutineType(types: !139)
!139 = !{!21, !98, !132}
!140 = !DISubprogram(name: "init", linkageName: "_ZN9RayEngine4initENSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEEiii", scope: !31, file: !32, line: 89, type: !141, isLocal: false, isDefinition: false, scopeLine: 89, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!141 = !DISubroutineType(types: !142)
!142 = !{!102, !143, !144, !17, !17, !17}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "string", scope: !146, file: !145, line: 74, baseType: !147)
!145 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/bits/stringfwd.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!146 = !DINamespace(name: "__cxx11", scope: !5, file: !6, line: 1991)
!147 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_string<char, std::char_traits<char>, std::allocator<char> >", scope: !146, file: !148, line: 1577, size: 256, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTSNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE")
!148 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/bits/basic_string.tcc", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!149 = !DISubprogram(name: "run", linkageName: "_ZN9RayEngine3runEv", scope: !31, file: !32, line: 90, type: !150, isLocal: false, isDefinition: false, scopeLine: 90, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !143}
!152 = !DISubprogram(name: "finish", linkageName: "_ZN9RayEngine6finishEv", scope: !31, file: !32, line: 91, type: !150, isLocal: false, isDefinition: false, scopeLine: 91, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!153 = !DISubprogram(name: "getOutputImage", linkageName: "_ZN9RayEngine14getOutputImageEv", scope: !31, file: !32, line: 92, type: !154, isLocal: false, isDefinition: false, scopeLine: 92, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!154 = !DISubroutineType(types: !155)
!155 = !{!156, !143}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!157 = !DISubprogram(name: "printRaytracingState", linkageName: "_ZN9RayEngine20printRaytracingStateEv", scope: !31, file: !32, line: 93, type: !150, isLocal: false, isDefinition: false, scopeLine: 93, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!158 = !DISubprogram(name: "render_scanline", linkageName: "_ZN9RayEngine15render_scanlineEiiiR5Imagei", scope: !31, file: !32, line: 107, type: !159, isLocal: false, isDefinition: false, scopeLine: 107, flags: DIFlagPrototyped, isOptimized: true)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !143, !17, !17, !17, !161, !17}
!161 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !74, size: 64, align: 64)
!162 = !DISubprogram(name: "load_scene", linkageName: "_ZN9RayEngine10load_sceneEP8_IO_FILE", scope: !31, file: !32, line: 108, type: !163, isLocal: false, isDefinition: false, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: true)
!163 = !DISubroutineType(types: !164)
!164 = !{null, !143, !165}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !167, line: 48, baseType: !168)
!167 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !169, line: 245, size: 1728, align: 64, elements: !170, identifier: "_ZTS8_IO_FILE")
!169 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!170 = !{!171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !186, !188, !189, !190, !193, !195, !197, !201, !204, !206, !208, !209, !210, !211, !215, !216}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !168, file: !169, line: 246, baseType: !17, size: 32, align: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !168, file: !169, line: 251, baseType: !20, size: 64, align: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !168, file: !169, line: 252, baseType: !20, size: 64, align: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !168, file: !169, line: 253, baseType: !20, size: 64, align: 64, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !168, file: !169, line: 254, baseType: !20, size: 64, align: 64, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !168, file: !169, line: 255, baseType: !20, size: 64, align: 64, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !168, file: !169, line: 256, baseType: !20, size: 64, align: 64, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !168, file: !169, line: 257, baseType: !20, size: 64, align: 64, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !168, file: !169, line: 258, baseType: !20, size: 64, align: 64, offset: 512)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !168, file: !169, line: 260, baseType: !20, size: 64, align: 64, offset: 576)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !168, file: !169, line: 261, baseType: !20, size: 64, align: 64, offset: 640)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !168, file: !169, line: 262, baseType: !20, size: 64, align: 64, offset: 704)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !168, file: !169, line: 264, baseType: !184, size: 64, align: 64, offset: 768)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !169, line: 160, size: 192, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTS10_IO_marker")
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !168, file: !169, line: 266, baseType: !187, size: 64, align: 64, offset: 832)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !168, file: !169, line: 268, baseType: !17, size: 32, align: 32, offset: 896)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !168, file: !169, line: 272, baseType: !17, size: 32, align: 32, offset: 928)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !168, file: !169, line: 274, baseType: !191, size: 64, align: 64, offset: 960)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !192, line: 131, baseType: !25)
!192 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !168, file: !169, line: 278, baseType: !194, size: 16, align: 16, offset: 1024)
!194 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !168, file: !169, line: 279, baseType: !196, size: 8, align: 8, offset: 1040)
!196 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !168, file: !169, line: 280, baseType: !198, size: 8, align: 8, offset: 1048)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 8, align: 8, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 1)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !168, file: !169, line: 284, baseType: !202, size: 64, align: 64, offset: 1088)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !169, line: 154, baseType: null)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !168, file: !169, line: 293, baseType: !205, size: 64, align: 64, offset: 1152)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !192, line: 132, baseType: !25)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !168, file: !169, line: 302, baseType: !207, size: 64, align: 64, offset: 1216)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !168, file: !169, line: 303, baseType: !207, size: 64, align: 64, offset: 1280)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !168, file: !169, line: 304, baseType: !207, size: 64, align: 64, offset: 1344)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !168, file: !169, line: 305, baseType: !207, size: 64, align: 64, offset: 1408)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !168, file: !169, line: 306, baseType: !212, size: 64, align: 64, offset: 1472)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !213, line: 62, baseType: !214)
!213 = !DIFile(filename: "/opt/aclang/install/bin/../lib/clang/4.0.0/include/stddef.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!214 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !168, file: !169, line: 308, baseType: !17, size: 32, align: 32, offset: 1536)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !168, file: !169, line: 310, baseType: !217, size: 160, align: 8, offset: 1568)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 160, align: 8, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 20)
!220 = !DISubprogram(name: "trace", linkageName: "_ZN9RayEngine5traceE3rayi", scope: !31, file: !32, line: 109, type: !221, isLocal: false, isDefinition: false, scopeLine: 109, flags: DIFlagPrototyped, isOptimized: true)
!221 = !DISubroutineType(types: !222)
!222 = !{!43, !143, !223, !17}
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ray", file: !32, line: 60, size: 384, align: 64, elements: !224, identifier: "_ZTS3ray")
!224 = !{!225, !226}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "orig", scope: !223, file: !32, line: 61, baseType: !43, size: 192, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !223, file: !32, line: 61, baseType: !43, size: 192, align: 64, offset: 192)
!227 = !DISubprogram(name: "shade", linkageName: "_ZN9RayEngine5shadeEP6sphereP6spointi", scope: !31, file: !32, line: 110, type: !228, isLocal: false, isDefinition: false, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: true)
!228 = !DISubroutineType(types: !229)
!229 = !{!43, !143, !39, !230, !17}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spoint", file: !32, line: 77, size: 640, align: 64, elements: !232, identifier: "_ZTS6spoint")
!232 = !{!233, !234, !235, !236}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !231, file: !32, line: 78, baseType: !43, size: 192, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !231, file: !32, line: 78, baseType: !43, size: 192, align: 64, offset: 192)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "vref", scope: !231, file: !32, line: 78, baseType: !43, size: 192, align: 64, offset: 384)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "dist", scope: !231, file: !32, line: 79, baseType: !16, size: 64, align: 64, offset: 576)
!237 = !DISubprogram(name: "reflect", linkageName: "_ZN9RayEngine7reflectE4vec3S0_", scope: !31, file: !32, line: 111, type: !238, isLocal: false, isDefinition: false, scopeLine: 111, flags: DIFlagPrototyped, isOptimized: true)
!238 = !DISubroutineType(types: !239)
!239 = !{!43, !143, !43, !43}
!240 = !DISubprogram(name: "cross_product", linkageName: "_ZN9RayEngine13cross_productE4vec3S0_", scope: !31, file: !32, line: 112, type: !238, isLocal: false, isDefinition: false, scopeLine: 112, flags: DIFlagPrototyped, isOptimized: true)
!241 = !DISubprogram(name: "get_primary_ray", linkageName: "_ZN9RayEngine15get_primary_rayEiii", scope: !31, file: !32, line: 113, type: !242, isLocal: false, isDefinition: false, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: true)
!242 = !DISubroutineType(types: !243)
!243 = !{!223, !143, !17, !17, !17}
!244 = !DISubprogram(name: "get_sample_pos", linkageName: "_ZN9RayEngine14get_sample_posEiii", scope: !31, file: !32, line: 114, type: !245, isLocal: false, isDefinition: false, scopeLine: 114, flags: DIFlagPrototyped, isOptimized: true)
!245 = !DISubroutineType(types: !246)
!246 = !{!43, !143, !17, !17, !17}
!247 = !DISubprogram(name: "jitter", linkageName: "_ZN9RayEngine6jitterEiii", scope: !31, file: !32, line: 115, type: !245, isLocal: false, isDefinition: false, scopeLine: 115, flags: DIFlagPrototyped, isOptimized: true)
!248 = !DISubprogram(name: "ray_sphere", linkageName: "_ZN9RayEngine10ray_sphereEPK6sphere3rayP6spoint", scope: !31, file: !32, line: 116, type: !249, isLocal: false, isDefinition: false, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: true)
!249 = !DISubroutineType(types: !250)
!250 = !{!17, !143, !251, !223, !230}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!253 = !{!254, !256, !257, !258, !259, !260}
!254 = !DILocalVariable(name: "this", arg: 1, scope: !30, type: !255, flags: DIFlagArtificial | DIFlagObjectPointer)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!256 = !DILocalVariable(name: "x", arg: 2, scope: !30, file: !1, line: 347, type: !17)
!257 = !DILocalVariable(name: "y", arg: 3, scope: !30, file: !1, line: 347, type: !17)
!258 = !DILocalVariable(name: "sample", arg: 4, scope: !30, file: !1, line: 347, type: !17)
!259 = !DILocalVariable(name: "pt", scope: !30, file: !1, line: 351, type: !43)
!260 = !DILocalVariable(name: "jt", scope: !261, file: !1, line: 362, type: !43)
!261 = distinct !DILexicalBlock(scope: !262, file: !1, line: 361, column: 15)
!262 = distinct !DILexicalBlock(scope: !30, file: !1, line: 361, column: 7)
!263 = distinct !DIGlobalVariable(name: "__ioinit", linkageName: "_ZStL8__ioinit", scope: !5, file: !264, line: 74, type: !265, isLocal: true, isDefinition: true, variable: %"class.std::ios_base::Init"* @_ZStL8__ioinit)
!264 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/iostream", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!265 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Init", scope: !27, file: !4, line: 601, size: 8, align: 8, elements: !266, identifier: "_ZTSNSt8ios_base4InitE")
!266 = !{!267, !270, !271, !275}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_S_refcount", scope: !265, file: !4, line: 609, baseType: !268, flags: DIFlagStaticMember)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Atomic_word", file: !269, line: 32, baseType: !17)
!269 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/x86_64-redhat-linux/bits/atomic_word.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_S_synced_with_stdio", scope: !265, file: !4, line: 610, baseType: !102, flags: DIFlagStaticMember)
!271 = !DISubprogram(name: "Init", scope: !265, file: !4, line: 605, type: !272, isLocal: false, isDefinition: false, scopeLine: 605, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!272 = !DISubroutineType(types: !273)
!273 = !{null, !274}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!275 = !DISubprogram(name: "~Init", scope: !265, file: !4, line: 606, type: !272, isLocal: false, isDefinition: false, scopeLine: 606, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!276 = !{!277, !281, !296, !298, !302, !308, !316, !320, !327, !331, !335, !337, !339, !343, !350, !354, !360, !366, !368, !372, !376, !380, !384, !395, !397, !401, !405, !409, !411, !416, !420, !424, !426, !428, !432, !440, !444, !448, !452, !454, !460, !462, !468, !472, !476, !480, !484, !488, !492, !494, !496, !500, !504, !508, !510, !514, !518, !520, !522, !526, !532, !537, !542, !543, !544, !545, !547, !548, !551, !555, !560, !565, !567, !569, !571, !573, !575, !577, !579, !581, !583, !585, !587, !589, !595, !597, !598, !600, !602, !604, !606, !610, !612, !614, !616, !618, !620, !622, !624, !626, !630, !634, !636, !640, !644, !645, !650, !654, !658, !660, !662, !664, !666, !673, !677, !681, !685, !689, !693, !698, !702, !704, !708, !714, !718, !725, !727, !732, !736, !740, !744, !746, !748, !752, !754, !758, !760, !762, !766, !770, !774, !778, !782, !784, !786, !790, !794, !798, !802, !804, !806, !810, !814, !815, !816, !817, !818, !819}
!277 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !278, entity: !280, line: 56)
!278 = !DINamespace(name: "__gnu_debug", scope: null, file: !279, line: 54)
!279 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/debug/debug.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!280 = !DINamespace(name: "__debug", scope: !5, file: !279, line: 48)
!281 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !282, line: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !283, line: 106, baseType: !284)
!283 = !DIFile(filename: "/usr/include/wchar.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !283, line: 94, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !283, line: 82, size: 64, align: 32, elements: !286, identifier: "_ZTS11__mbstate_t")
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !285, file: !283, line: 84, baseType: !17, size: 32, align: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !285, file: !283, line: 93, baseType: !289, size: 32, align: 32, offset: 32)
!289 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !285, file: !283, line: 85, size: 32, align: 32, elements: !290, identifier: "_ZTSN11__mbstate_tUt_E")
!290 = !{!291, !292}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !289, file: !283, line: 88, baseType: !88, size: 32, align: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !289, file: !283, line: 92, baseType: !293, size: 32, align: 8)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 32, align: 8, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 4)
!296 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !297, line: 139)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !213, line: 132, baseType: !88)
!298 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !299, line: 141)
!299 = !DISubprogram(name: "btowc", scope: !283, file: !283, line: 390, type: !300, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!300 = !DISubroutineType(types: !301)
!301 = !{!297, !17}
!302 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !303, line: 142)
!303 = !DISubprogram(name: "fgetwc", scope: !283, file: !283, line: 747, type: !304, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!304 = !DISubroutineType(types: !305)
!305 = !{!297, !306}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !167, line: 64, baseType: !168)
!308 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !309, line: 143)
!309 = !DISubprogram(name: "fgetws", scope: !283, file: !283, line: 776, type: !310, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!310 = !DISubroutineType(types: !311)
!311 = !{!312, !314, !17, !315}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DIBasicType(name: "wchar_t", size: 32, align: 32, encoding: DW_ATE_signed)
!314 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !312)
!315 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !306)
!316 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !317, line: 144)
!317 = !DISubprogram(name: "fputwc", scope: !283, file: !283, line: 761, type: !318, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!318 = !DISubroutineType(types: !319)
!319 = !{!297, !313, !306}
!320 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !321, line: 145)
!321 = !DISubprogram(name: "fputws", scope: !283, file: !283, line: 783, type: !322, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!322 = !DISubroutineType(types: !323)
!323 = !{!17, !324, !315}
!324 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!327 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !328, line: 146)
!328 = !DISubprogram(name: "fwide", scope: !283, file: !283, line: 589, type: !329, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!329 = !DISubroutineType(types: !330)
!330 = !{!17, !306, !17}
!331 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !332, line: 147)
!332 = !DISubprogram(name: "fwprintf", scope: !283, file: !283, line: 596, type: !333, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!333 = !DISubroutineType(types: !334)
!334 = !{!17, !315, !324, null}
!335 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !336, line: 148)
!336 = !DISubprogram(name: "fwscanf", scope: !283, file: !283, line: 637, type: !333, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!337 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !338, line: 149)
!338 = !DISubprogram(name: "getwc", scope: !283, file: !283, line: 748, type: !304, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!339 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !340, line: 150)
!340 = !DISubprogram(name: "getwchar", scope: !283, file: !283, line: 754, type: !341, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!341 = !DISubroutineType(types: !342)
!342 = !{!297}
!343 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !344, line: 151)
!344 = !DISubprogram(name: "mbrlen", scope: !283, file: !283, line: 401, type: !345, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!345 = !DISubroutineType(types: !346)
!346 = !{!212, !347, !212, !348}
!347 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !103)
!348 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!350 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !351, line: 152)
!351 = !DISubprogram(name: "mbrtowc", scope: !283, file: !283, line: 367, type: !352, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!352 = !DISubroutineType(types: !353)
!353 = !{!212, !314, !347, !212, !348}
!354 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !355, line: 153)
!355 = !DISubprogram(name: "mbsinit", scope: !283, file: !283, line: 363, type: !356, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!356 = !DISubroutineType(types: !357)
!357 = !{!17, !358}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !282)
!360 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !361, line: 154)
!361 = !DISubprogram(name: "mbsrtowcs", scope: !283, file: !283, line: 410, type: !362, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!362 = !DISubroutineType(types: !363)
!363 = !{!212, !314, !364, !212, !348}
!364 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!366 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !367, line: 155)
!367 = !DISubprogram(name: "putwc", scope: !283, file: !283, line: 762, type: !318, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!368 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !369, line: 156)
!369 = !DISubprogram(name: "putwchar", scope: !283, file: !283, line: 768, type: !370, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!370 = !DISubroutineType(types: !371)
!371 = !{!297, !313}
!372 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !373, line: 158)
!373 = !DISubprogram(name: "swprintf", scope: !283, file: !283, line: 606, type: !374, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!374 = !DISubroutineType(types: !375)
!375 = !{!17, !314, !212, !324, null}
!376 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !377, line: 160)
!377 = !DISubprogram(name: "swscanf", scope: !283, file: !283, line: 647, type: !378, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!378 = !DISubroutineType(types: !379)
!379 = !{!17, !324, !324, null}
!380 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !381, line: 161)
!381 = !DISubprogram(name: "ungetwc", scope: !283, file: !283, line: 791, type: !382, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!382 = !DISubroutineType(types: !383)
!383 = !{!297, !297, !306}
!384 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !385, line: 162)
!385 = !DISubprogram(name: "vfwprintf", scope: !283, file: !283, line: 614, type: !386, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!386 = !DISubroutineType(types: !387)
!387 = !{!17, !315, !324, !388}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !390, identifier: "_ZTS13__va_list_tag")
!390 = !{!391, !392, !393, !394}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !389, file: !1, baseType: !88, size: 32, align: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !389, file: !1, baseType: !88, size: 32, align: 32, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !389, file: !1, baseType: !207, size: 64, align: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !389, file: !1, baseType: !207, size: 64, align: 64, offset: 128)
!395 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !396, line: 164)
!396 = !DISubprogram(name: "vfwscanf", scope: !283, file: !283, line: 691, type: !386, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !398, line: 167)
!398 = !DISubprogram(name: "vswprintf", scope: !283, file: !283, line: 627, type: !399, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!399 = !DISubroutineType(types: !400)
!400 = !{!17, !314, !212, !324, !388}
!401 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !402, line: 170)
!402 = !DISubprogram(name: "vswscanf", scope: !283, file: !283, line: 703, type: !403, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!403 = !DISubroutineType(types: !404)
!404 = !{!17, !324, !324, !388}
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !406, line: 172)
!406 = !DISubprogram(name: "vwprintf", scope: !283, file: !283, line: 622, type: !407, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!407 = !DISubroutineType(types: !408)
!408 = !{!17, !324, !388}
!409 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !410, line: 174)
!410 = !DISubprogram(name: "vwscanf", scope: !283, file: !283, line: 699, type: !407, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !412, line: 176)
!412 = !DISubprogram(name: "wcrtomb", scope: !283, file: !283, line: 372, type: !413, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!413 = !DISubroutineType(types: !414)
!414 = !{!212, !415, !313, !348}
!415 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !20)
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !417, line: 177)
!417 = !DISubprogram(name: "wcscat", scope: !283, file: !283, line: 157, type: !418, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!418 = !DISubroutineType(types: !419)
!419 = !{!312, !314, !324}
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !421, line: 178)
!421 = !DISubprogram(name: "wcscmp", scope: !283, file: !283, line: 165, type: !422, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!422 = !DISubroutineType(types: !423)
!423 = !{!17, !325, !325}
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !425, line: 179)
!425 = !DISubprogram(name: "wcscoll", scope: !283, file: !283, line: 194, type: !422, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !427, line: 180)
!427 = !DISubprogram(name: "wcscpy", scope: !283, file: !283, line: 147, type: !418, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !429, line: 181)
!429 = !DISubprogram(name: "wcscspn", scope: !283, file: !283, line: 254, type: !430, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!430 = !DISubroutineType(types: !431)
!431 = !{!212, !325, !325}
!432 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !433, line: 182)
!433 = !DISubprogram(name: "wcsftime", scope: !283, file: !283, line: 857, type: !434, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!434 = !DISubroutineType(types: !435)
!435 = !{!212, !314, !212, !324, !436}
!436 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !437)
