; ModuleID = 'CMakeFiles/serial.dir/rotation_engine-inst.cpp'
source_filename = "CMakeFiles/serial.dir/rotation_engine-inst.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%"class.std::ios_base::Init" = type { i8 }
%class.RotateEngine = type { %"class.std::__cxx11::basic_string", %class.Image*, %class.Image*, i32, i8, i8, %struct.Coord, %struct.Coord, %struct.Coord, %struct.Coord, %struct.Coord, %struct.Coord, %struct.Coord, %struct.Coord }
%"class.std::__cxx11::basic_string" = type { %"struct.std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Alloc_hider", i64, %union.anon }
%"struct.std::__cxx11::basic_string<char, std::char_traits<char>, std::allocator<char> >::_Alloc_hider" = type { i8* }
%union.anon = type { i64, [8 x i8] }
%class.Image = type { %struct.Pixel*, i32, i32, i32, i32, float, float }
%struct.Pixel = type { i8, i8, i8 }
%struct.Coord = type { float, float }
%"class.std::basic_fstream" = type { %"class.std::basic_iostream.base", %"class.std::basic_filebuf", %"class.std::basic_ios" }

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 4.0.0 (http://gitlab.lsc.ic.unicamp.br/luis.mattos/DoAcrossClause-clang.git fe12e4b4ece0fc9f1e1d9cc24a1406f09e8c7a8a) (http://gitlab.lsc.ic.unicamp.br/luis.mattos/DoAcrossClause.git 6ee0695152160be155346b4d0d8daeaf01555185)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !26, globals: !85, imports: !100)
!1 = !DIFile(filename: "CMakeFiles/serial.dir/rotation_engine-inst.cpp", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!2 = !{!3, !17}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Ios_Openmode", scope: !5, file: !4, line: 111, size: 32, align: 32, elements: !7, identifier: "_ZTSSt13_Ios_Openmode")
!4 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/bits/ios_base.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!5 = !DINamespace(name: "std", scope: null, file: !6, line: 1967)
!6 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/x86_64-redhat-linux/bits/c++config.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!7 = !{!8, !9, !10, !11, !12, !13, !14, !15, !16}
!8 = !DIEnumerator(name: "_S_app", value: 1)
!9 = !DIEnumerator(name: "_S_ate", value: 2)
!10 = !DIEnumerator(name: "_S_bin", value: 4)
!11 = !DIEnumerator(name: "_S_in", value: 8)
!12 = !DIEnumerator(name: "_S_out", value: 16)
!13 = !DIEnumerator(name: "_S_trunc", value: 32)
!14 = !DIEnumerator(name: "_S_ios_openmode_end", value: 65536)
!15 = !DIEnumerator(name: "_S_ios_openmode_max", value: 2147483647)
!16 = !DIEnumerator(name: "_S_ios_openmode_min", value: -2147483648)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_Ios_Iostate", scope: !5, file: !4, line: 153, size: 32, align: 32, elements: !18, identifier: "_ZTSSt12_Ios_Iostate")
!18 = !{!19, !20, !21, !22, !23, !24, !25}
!19 = !DIEnumerator(name: "_S_goodbit", value: 0)
!20 = !DIEnumerator(name: "_S_badbit", value: 1)
!21 = !DIEnumerator(name: "_S_eofbit", value: 2)
!22 = !DIEnumerator(name: "_S_failbit", value: 4)
!23 = !DIEnumerator(name: "_S_ios_iostate_end", value: 65536)
!24 = !DIEnumerator(name: "_S_ios_iostate_max", value: 2147483647)
!25 = !DIEnumerator(name: "_S_ios_iostate_min", value: -2147483648)
!26 = !{!27, !28, !29, !30, !31, !38, !80, !17, !57, !84}
!27 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!29 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!30 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "Coord", file: !33, line: 55, baseType: !34)
!33 = !DIFile(filename: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/image.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 52, size: 64, align: 32, elements: !35, identifier: "_ZTS5Coord")
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !33, line: 53, baseType: !27, size: 32, align: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !33, line: 54, baseType: !27, size: 32, align: 32, offset: 32)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !40, file: !39, line: 86, baseType: !43)
!39 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/bits/basic_string.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!40 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_string<char, std::char_traits<char>, std::allocator<char> >", scope: !42, file: !41, line: 1577, size: 256, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTSNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE")
!41 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/bits/basic_string.tcc", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!42 = !DINamespace(name: "__cxx11", scope: !5, file: !6, line: 1991)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !45, file: !44, line: 172, baseType: !77)
!44 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/ext/alloc_traits.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__alloc_traits<std::allocator<char> >", scope: !46, file: !44, line: 95, size: 8, align: 8, elements: !47, templateParams: !75, identifier: "_ZTSN9__gnu_cxx14__alloc_traitsISaIcEEE")
!46 = !DINamespace(name: "__gnu_cxx", scope: null, file: !6, line: 1993)
!47 = !{!48, !58, !61, !64, !69, !72}
!48 = !DISubprogram(name: "allocate", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEE8allocateERS1_m", scope: !45, file: !44, line: 181, type: !49, isLocal: false, isDefinition: false, scopeLine: 181, flags: DIFlagPrototyped, isOptimized: true)
!49 = !DISubroutineType(types: !50)
!50 = !{!43, !51, !54}
!51 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !52, size: 64, align: 64)
!52 = !DICompositeType(tag: DW_TAG_class_type, name: "allocator<char>", scope: !5, file: !53, line: 155, size: 8, align: 8, flags: DIFlagFwdDecl, identifier: "_ZTSSaIcE")
!53 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/bits/allocator.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !45, file: !44, line: 177, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !52, file: !53, line: 95, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", scope: !5, file: !6, line: 1969, baseType: !57)
!57 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!58 = !DISubprogram(name: "deallocate", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEE10deallocateERS1_Pcm", scope: !45, file: !44, line: 184, type: !59, isLocal: false, isDefinition: false, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: true)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !51, !43, !54}
!61 = !DISubprogram(name: "destroy", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEE7destroyERS1_Pc", scope: !45, file: !44, line: 191, type: !62, isLocal: false, isDefinition: false, scopeLine: 191, flags: DIFlagPrototyped, isOptimized: true)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !51, !43}
!64 = !DISubprogram(name: "max_size", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEE8max_sizeERKS1_", scope: !45, file: !44, line: 194, type: !65, isLocal: false, isDefinition: false, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: true)
!65 = !DISubroutineType(types: !66)
!66 = !{!54, !67}
!67 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!69 = !DISubprogram(name: "_S_select_on_copy", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEE17_S_select_on_copyERKS1_", scope: !45, file: !44, line: 197, type: !70, isLocal: false, isDefinition: false, scopeLine: 197, flags: DIFlagPrototyped, isOptimized: true)
!70 = !DISubroutineType(types: !71)
!71 = !{!67, !67}
!72 = !DISubprogram(name: "_S_on_swap", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEE10_S_on_swapERS1_S3_", scope: !45, file: !44, line: 199, type: !73, isLocal: false, isDefinition: false, scopeLine: 199, flags: DIFlagPrototyped, isOptimized: true)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !51, !51}
!75 = !{!76}
!76 = !DITemplateTypeParameter(name: "_Alloc", type: !52)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !52, file: !53, line: 97, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "streamsize", scope: !5, file: !81, line: 98, baseType: !82)
!81 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/bits/postypes.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", scope: !5, file: !6, line: 1970, baseType: !83)
!83 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!84 = !DICompositeType(tag: DW_TAG_class_type, name: "ios_base", scope: !5, file: !4, line: 228, size: 1728, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTSSt8ios_base")
!85 = !{!86}
!86 = distinct !DIGlobalVariable(name: "__ioinit", linkageName: "_ZStL8__ioinit", scope: !5, file: !87, line: 74, type: !88, isLocal: true, isDefinition: true, variable: %"class.std::ios_base::Init"* @_ZStL8__ioinit)
!87 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/iostream", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!88 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Init", scope: !84, file: !4, line: 601, size: 8, align: 8, elements: !89, identifier: "_ZTSNSt8ios_base4InitE")
!89 = !{!90, !93, !95, !99}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_S_refcount", scope: !88, file: !4, line: 609, baseType: !91, flags: DIFlagStaticMember)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Atomic_word", file: !92, line: 32, baseType: !29)
!92 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/x86_64-redhat-linux/bits/atomic_word.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_S_synced_with_stdio", scope: !88, file: !4, line: 610, baseType: !94, flags: DIFlagStaticMember)
!94 = !DIBasicType(name: "bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!95 = !DISubprogram(name: "Init", scope: !88, file: !4, line: 605, type: !96, isLocal: false, isDefinition: false, scopeLine: 605, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!96 = !DISubroutineType(types: !97)
!97 = !{null, !98}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!99 = !DISubprogram(name: "~Init", scope: !88, file: !4, line: 606, type: !96, isLocal: false, isDefinition: false, scopeLine: 606, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!100 = !{!101, !117, !120, !124, !181, !189, !193, !200, !204, !208, !210, !212, !216, !225, !229, !235, !241, !243, !247, !251, !255, !259, !270, !272, !276, !280, !284, !286, !291, !295, !299, !301, !303, !307, !315, !319, !323, !327, !329, !335, !337, !343, !347, !351, !355, !359, !363, !367, !369, !371, !375, !379, !383, !385, !389, !393, !395, !397, !401, !406, !411, !416, !417, !418, !419, !423, !426, !430, !435, !440, !442, !444, !446, !448, !450, !452, !454, !456, !458, !460, !462, !464, !465, !466, !472, !474, !475, !477, !479, !481, !483, !487, !489, !491, !493, !495, !497, !499, !501, !503, !507, !511, !513, !517, !521, !523, !528, !533, !537, !539, !541, !543, !545, !552, !556, !560, !564, !568, !572, !577, !581, !583, !587, !593, !597, !604, !606, !611, !615, !619, !623, !625, !627, !631, !633, !637, !639, !641, !645, !649, !653, !657, !661, !663, !665, !669, !673, !677, !681, !683, !685, !689, !693, !694, !695, !696, !697, !698, !703, !705, !707, !711, !713, !715, !717, !719, !721, !723, !725, !730, !734, !736, !738, !743, !745, !747, !749, !751, !753, !755, !756, !757, !761, !764, !765, !769, !773, !778, !783, !787, !793, !797, !799, !803}
!101 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !102, line: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !103, line: 106, baseType: !104)
!103 = !DIFile(filename: "/usr/include/wchar.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !103, line: 94, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !103, line: 82, size: 64, align: 32, elements: !106, identifier: "_ZTS11__mbstate_t")
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !105, file: !103, line: 84, baseType: !29, size: 32, align: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !105, file: !103, line: 93, baseType: !109, size: 32, align: 32, offset: 32)
!109 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !105, file: !103, line: 85, size: 32, align: 32, elements: !110, identifier: "_ZTSN11__mbstate_tUt_E")
!110 = !{!111, !113}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !109, file: !103, line: 88, baseType: !112, size: 32, align: 32)
!112 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !109, file: !103, line: 92, baseType: !114, size: 32, align: 8)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 32, align: 8, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 4)
!117 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !118, line: 139)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !119, line: 132, baseType: !112)
!119 = !DIFile(filename: "/opt/aclang/install/bin/../lib/clang/4.0.0/include/stddef.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!120 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !121, line: 141)
!121 = !DISubprogram(name: "btowc", scope: !103, file: !103, line: 390, type: !122, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!122 = !DISubroutineType(types: !123)
!123 = !{!118, !29}
!124 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !125, line: 142)
!125 = !DISubprogram(name: "fgetwc", scope: !103, file: !103, line: 747, type: !126, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!126 = !DISubroutineType(types: !127)
!127 = !{!118, !128}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64, align: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !130, line: 64, baseType: !131)
!130 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !132, line: 245, size: 1728, align: 64, elements: !133, identifier: "_ZTS8_IO_FILE")
!132 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!133 = !{!134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !149, !151, !152, !153, !156, !158, !160, !164, !167, !169, !171, !172, !173, !174, !176, !177}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !131, file: !132, line: 246, baseType: !29, size: 32, align: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !131, file: !132, line: 251, baseType: !78, size: 64, align: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !131, file: !132, line: 252, baseType: !78, size: 64, align: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !131, file: !132, line: 253, baseType: !78, size: 64, align: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !131, file: !132, line: 254, baseType: !78, size: 64, align: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !131, file: !132, line: 255, baseType: !78, size: 64, align: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !131, file: !132, line: 256, baseType: !78, size: 64, align: 64, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !131, file: !132, line: 257, baseType: !78, size: 64, align: 64, offset: 448)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !131, file: !132, line: 258, baseType: !78, size: 64, align: 64, offset: 512)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !131, file: !132, line: 260, baseType: !78, size: 64, align: 64, offset: 576)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !131, file: !132, line: 261, baseType: !78, size: 64, align: 64, offset: 640)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !131, file: !132, line: 262, baseType: !78, size: 64, align: 64, offset: 704)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !131, file: !132, line: 264, baseType: !147, size: 64, align: 64, offset: 768)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !132, line: 160, size: 192, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTS10_IO_marker")
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !131, file: !132, line: 266, baseType: !150, size: 64, align: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !131, file: !132, line: 268, baseType: !29, size: 32, align: 32, offset: 896)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !131, file: !132, line: 272, baseType: !29, size: 32, align: 32, offset: 928)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !131, file: !132, line: 274, baseType: !154, size: 64, align: 64, offset: 960)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !155, line: 131, baseType: !83)
!155 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !131, file: !132, line: 278, baseType: !157, size: 16, align: 16, offset: 1024)
!157 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !131, file: !132, line: 279, baseType: !159, size: 8, align: 8, offset: 1040)
!159 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !131, file: !132, line: 280, baseType: !161, size: 8, align: 8, offset: 1048)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 8, align: 8, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 1)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !131, file: !132, line: 284, baseType: !165, size: 64, align: 64, offset: 1088)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !132, line: 154, baseType: null)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !131, file: !132, line: 293, baseType: !168, size: 64, align: 64, offset: 1152)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !155, line: 132, baseType: !83)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !131, file: !132, line: 302, baseType: !170, size: 64, align: 64, offset: 1216)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !131, file: !132, line: 303, baseType: !170, size: 64, align: 64, offset: 1280)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !131, file: !132, line: 304, baseType: !170, size: 64, align: 64, offset: 1344)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !131, file: !132, line: 305, baseType: !170, size: 64, align: 64, offset: 1408)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !131, file: !132, line: 306, baseType: !175, size: 64, align: 64, offset: 1472)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !119, line: 62, baseType: !57)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !131, file: !132, line: 308, baseType: !29, size: 32, align: 32, offset: 1536)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !131, file: !132, line: 310, baseType: !178, size: 160, align: 8, offset: 1568)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 160, align: 8, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 20)
!181 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !182, line: 143)
!182 = !DISubprogram(name: "fgetws", scope: !103, file: !103, line: 776, type: !183, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!183 = !DISubroutineType(types: !184)
!184 = !{!185, !187, !29, !188}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIBasicType(name: "wchar_t", size: 32, align: 32, encoding: DW_ATE_signed)
!187 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !185)
!188 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !128)
!189 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !190, line: 144)
!190 = !DISubprogram(name: "fputwc", scope: !103, file: !103, line: 761, type: !191, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!191 = !DISubroutineType(types: !192)
!192 = !{!118, !186, !128}
!193 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !194, line: 145)
!194 = !DISubprogram(name: "fputws", scope: !103, file: !103, line: 783, type: !195, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!195 = !DISubroutineType(types: !196)
!196 = !{!29, !197, !188}
!197 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!200 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !201, line: 146)
!201 = !DISubprogram(name: "fwide", scope: !103, file: !103, line: 589, type: !202, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!202 = !DISubroutineType(types: !203)
!203 = !{!29, !128, !29}
!204 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !205, line: 147)
!205 = !DISubprogram(name: "fwprintf", scope: !103, file: !103, line: 596, type: !206, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!206 = !DISubroutineType(types: !207)
!207 = !{!29, !188, !197, null}
!208 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !209, line: 148)
!209 = !DISubprogram(name: "fwscanf", scope: !103, file: !103, line: 637, type: !206, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!210 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !211, line: 149)
!211 = !DISubprogram(name: "getwc", scope: !103, file: !103, line: 748, type: !126, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!212 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !213, line: 150)
!213 = !DISubprogram(name: "getwchar", scope: !103, file: !103, line: 754, type: !214, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!214 = !DISubroutineType(types: !215)
!215 = !{!118}
!216 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !217, line: 151)
!217 = !DISubprogram(name: "mbrlen", scope: !103, file: !103, line: 401, type: !218, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!218 = !DISubroutineType(types: !219)
!219 = !{!175, !220, !175, !223}
!220 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !79)
!223 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!225 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !226, line: 152)
!226 = !DISubprogram(name: "mbrtowc", scope: !103, file: !103, line: 367, type: !227, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!227 = !DISubroutineType(types: !228)
!228 = !{!175, !187, !220, !175, !223}
!229 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !230, line: 153)
!230 = !DISubprogram(name: "mbsinit", scope: !103, file: !103, line: 363, type: !231, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!231 = !DISubroutineType(types: !232)
!232 = !{!29, !233}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!235 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !236, line: 154)
!236 = !DISubprogram(name: "mbsrtowcs", scope: !103, file: !103, line: 410, type: !237, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!237 = !DISubroutineType(types: !238)
!238 = !{!175, !187, !239, !175, !223}
!239 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64, align: 64)
!241 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !242, line: 155)
!242 = !DISubprogram(name: "putwc", scope: !103, file: !103, line: 762, type: !191, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!243 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !244, line: 156)
!244 = !DISubprogram(name: "putwchar", scope: !103, file: !103, line: 768, type: !245, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!245 = !DISubroutineType(types: !246)
!246 = !{!118, !186}
!247 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !248, line: 158)
!248 = !DISubprogram(name: "swprintf", scope: !103, file: !103, line: 606, type: !249, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!249 = !DISubroutineType(types: !250)
!250 = !{!29, !187, !175, !197, null}
!251 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !252, line: 160)
!252 = !DISubprogram(name: "swscanf", scope: !103, file: !103, line: 647, type: !253, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!253 = !DISubroutineType(types: !254)
!254 = !{!29, !197, !197, null}
!255 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !256, line: 161)
!256 = !DISubprogram(name: "ungetwc", scope: !103, file: !103, line: 791, type: !257, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!257 = !DISubroutineType(types: !258)
!258 = !{!118, !118, !128}
!259 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !260, line: 162)
!260 = !DISubprogram(name: "vfwprintf", scope: !103, file: !103, line: 614, type: !261, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!261 = !DISubroutineType(types: !262)
!262 = !{!29, !188, !197, !263}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, align: 64, elements: !265, identifier: "_ZTS13__va_list_tag")
!265 = !{!266, !267, !268, !269}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !264, file: !1, baseType: !112, size: 32, align: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !264, file: !1, baseType: !112, size: 32, align: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !264, file: !1, baseType: !170, size: 64, align: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !264, file: !1, baseType: !170, size: 64, align: 64, offset: 128)
!270 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !271, line: 164)
!271 = !DISubprogram(name: "vfwscanf", scope: !103, file: !103, line: 691, type: !261, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!272 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !273, line: 167)
!273 = !DISubprogram(name: "vswprintf", scope: !103, file: !103, line: 627, type: !274, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!274 = !DISubroutineType(types: !275)
!275 = !{!29, !187, !175, !197, !263}
!276 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !277, line: 170)
!277 = !DISubprogram(name: "vswscanf", scope: !103, file: !103, line: 703, type: !278, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!278 = !DISubroutineType(types: !279)
!279 = !{!29, !197, !197, !263}
!280 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !281, line: 172)
!281 = !DISubprogram(name: "vwprintf", scope: !103, file: !103, line: 622, type: !282, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!282 = !DISubroutineType(types: !283)
!283 = !{!29, !197, !263}
!284 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !285, line: 174)
!285 = !DISubprogram(name: "vwscanf", scope: !103, file: !103, line: 699, type: !282, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!286 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !287, line: 176)
!287 = !DISubprogram(name: "wcrtomb", scope: !103, file: !103, line: 372, type: !288, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!288 = !DISubroutineType(types: !289)
!289 = !{!175, !290, !186, !223}
!290 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !78)
!291 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !292, line: 177)
!292 = !DISubprogram(name: "wcscat", scope: !103, file: !103, line: 157, type: !293, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!293 = !DISubroutineType(types: !294)
!294 = !{!185, !187, !197}
!295 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !296, line: 178)
!296 = !DISubprogram(name: "wcscmp", scope: !103, file: !103, line: 165, type: !297, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!297 = !DISubroutineType(types: !298)
!298 = !{!29, !198, !198}
!299 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !300, line: 179)
!300 = !DISubprogram(name: "wcscoll", scope: !103, file: !103, line: 194, type: !297, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!301 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !302, line: 180)
!302 = !DISubprogram(name: "wcscpy", scope: !103, file: !103, line: 147, type: !293, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!303 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !304, line: 181)
!304 = !DISubprogram(name: "wcscspn", scope: !103, file: !103, line: 254, type: !305, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!305 = !DISubroutineType(types: !306)
!306 = !{!175, !198, !198}
!307 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !308, line: 182)
!308 = !DISubprogram(name: "wcsftime", scope: !103, file: !103, line: 857, type: !309, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!309 = !DISubroutineType(types: !310)
!310 = !{!175, !187, !175, !197, !311}
!311 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !103, line: 137, flags: DIFlagFwdDecl, identifier: "_ZTS2tm")
!315 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !316, line: 183)
!316 = !DISubprogram(name: "wcslen", scope: !103, file: !103, line: 289, type: !317, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!317 = !DISubroutineType(types: !318)
!318 = !{!175, !198}
!319 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !320, line: 184)
!320 = !DISubprogram(name: "wcsncat", scope: !103, file: !103, line: 160, type: !321, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!321 = !DISubroutineType(types: !322)
!322 = !{!185, !187, !197, !175}
!323 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !324, line: 185)
!324 = !DISubprogram(name: "wcsncmp", scope: !103, file: !103, line: 168, type: !325, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!325 = !DISubroutineType(types: !326)
!326 = !{!29, !198, !198, !175}
!327 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !328, line: 186)
!328 = !DISubprogram(name: "wcsncpy", scope: !103, file: !103, line: 152, type: !321, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!329 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !330, line: 187)
!330 = !DISubprogram(name: "wcsrtombs", scope: !103, file: !103, line: 416, type: !331, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!331 = !DISubroutineType(types: !332)
!332 = !{!175, !290, !333, !175, !223}
!333 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!335 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !336, line: 188)
!336 = !DISubprogram(name: "wcsspn", scope: !103, file: !103, line: 258, type: !305, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!337 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !338, line: 189)
!338 = !DISubprogram(name: "wcstod", scope: !103, file: !103, line: 452, type: !339, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!339 = !DISubroutineType(types: !340)
!340 = !{!30, !197, !341}
!341 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!343 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !344, line: 191)
!344 = !DISubprogram(name: "wcstof", scope: !103, file: !103, line: 459, type: !345, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!345 = !DISubroutineType(types: !346)
!346 = !{!27, !197, !341}
!347 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !348, line: 193)
!348 = !DISubprogram(name: "wcstok", scope: !103, file: !103, line: 284, type: !349, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!349 = !DISubroutineType(types: !350)
!350 = !{!185, !187, !197, !341}
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !352, line: 194)
!352 = !DISubprogram(name: "wcstol", scope: !103, file: !103, line: 470, type: !353, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!353 = !DISubroutineType(types: !354)
!354 = !{!83, !197, !341, !29}
!355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !356, line: 195)
!356 = !DISubprogram(name: "wcstoul", scope: !103, file: !103, line: 475, type: !357, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!357 = !DISubroutineType(types: !358)
!358 = !{!57, !197, !341, !29}
!359 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !360, line: 196)
!360 = !DISubprogram(name: "wcsxfrm", scope: !103, file: !103, line: 198, type: !361, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!361 = !DISubroutineType(types: !362)
!362 = !{!175, !187, !197, !175}
!363 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !364, line: 197)
!364 = !DISubprogram(name: "wctob", scope: !103, file: !103, line: 396, type: !365, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!365 = !DISubroutineType(types: !366)
!366 = !{!29, !118}
!367 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !368, line: 198)
!368 = !DISubprogram(name: "wmemcmp", scope: !103, file: !103, line: 327, type: !325, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!369 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !370, line: 199)
!370 = !DISubprogram(name: "wmemcpy", scope: !103, file: !103, line: 331, type: !321, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !372, line: 200)
!372 = !DISubprogram(name: "wmemmove", scope: !103, file: !103, line: 336, type: !373, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!373 = !DISubroutineType(types: !374)
!374 = !{!185, !185, !198, !175}
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !376, line: 201)
!376 = !DISubprogram(name: "wmemset", scope: !103, file: !103, line: 340, type: !377, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!377 = !DISubroutineType(types: !378)
!378 = !{!185, !185, !186, !175}
!379 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !380, line: 202)
!380 = !DISubprogram(name: "wprintf", scope: !103, file: !103, line: 603, type: !381, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!381 = !DISubroutineType(types: !382)
!382 = !{!29, !197, null}
!383 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !384, line: 203)
!384 = !DISubprogram(name: "wscanf", scope: !103, file: !103, line: 644, type: !381, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !386, line: 204)
!386 = !DISubprogram(name: "wcschr", scope: !103, file: !103, line: 229, type: !387, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!387 = !DISubroutineType(types: !388)
!388 = !{!185, !198, !186}
!389 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !390, line: 205)
!390 = !DISubprogram(name: "wcspbrk", scope: !103, file: !103, line: 268, type: !391, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!391 = !DISubroutineType(types: !392)
!392 = !{!185, !198, !198}
!393 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !394, line: 206)
!394 = !DISubprogram(name: "wcsrchr", scope: !103, file: !103, line: 239, type: !387, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!395 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !396, line: 207)
!396 = !DISubprogram(name: "wcsstr", scope: !103, file: !103, line: 279, type: !391, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !398, line: 208)
!398 = !DISubprogram(name: "wmemchr", scope: !103, file: !103, line: 322, type: !399, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!399 = !DISubroutineType(types: !400)
!400 = !{!185, !198, !186, !175}
!401 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !46, entity: !402, line: 248)
!402 = !DISubprogram(name: "wcstold", scope: !103, file: !103, line: 461, type: !403, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!403 = !DISubroutineType(types: !404)
!404 = !{!405, !197, !341}
!405 = !DIBasicType(name: "long double", size: 128, align: 128, encoding: DW_ATE_float)
!406 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !46, entity: !407, line: 257)
!407 = !DISubprogram(name: "wcstoll", scope: !103, file: !103, line: 485, type: !408, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!408 = !DISubroutineType(types: !409)
!409 = !{!410, !197, !341, !29}
!410 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !46, entity: !412, line: 258)
!412 = !DISubprogram(name: "wcstoull", scope: !103, file: !103, line: 492, type: !413, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!413 = !DISubroutineType(types: !414)
!414 = !{!415, !197, !341, !29}
!415 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !402, line: 264)
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !407, line: 265)
!418 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !412, line: 266)
!419 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !420, entity: !422, line: 56)
!420 = !DINamespace(name: "__gnu_debug", scope: null, file: !421, line: 54)
!421 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/debug/debug.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!422 = !DINamespace(name: "__debug", scope: !5, file: !421, line: 48)
!423 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !424, line: 53)
!424 = !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !425, line: 53, size: 768, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTS5lconv")
!425 = !DIFile(filename: "/usr/include/locale.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !427, line: 54)
!427 = !DISubprogram(name: "setlocale", scope: !425, file: !425, line: 124, type: !428, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!428 = !DISubroutineType(types: !429)
!429 = !{!78, !29, !221}
!430 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !431, line: 55)
!431 = !DISubprogram(name: "localeconv", scope: !425, file: !425, line: 127, type: !432, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!432 = !DISubroutineType(types: !433)
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64, align: 64)
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !436, line: 64)
!436 = !DISubprogram(name: "isalnum", scope: !437, file: !437, line: 110, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!437 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!438 = !DISubroutineType(types: !439)
!439 = !{!29, !29}
!440 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !441, line: 65)
!441 = !DISubprogram(name: "isalpha", scope: !437, file: !437, line: 111, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !443, line: 66)
!443 = !DISubprogram(name: "iscntrl", scope: !437, file: !437, line: 112, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!444 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !445, line: 67)
!445 = !DISubprogram(name: "isdigit", scope: !437, file: !437, line: 113, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!446 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !447, line: 68)
!447 = !DISubprogram(name: "isgraph", scope: !437, file: !437, line: 115, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!448 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !449, line: 69)
!449 = !DISubprogram(name: "islower", scope: !437, file: !437, line: 114, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!450 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !451, line: 70)
!451 = !DISubprogram(name: "isprint", scope: !437, file: !437, line: 116, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!452 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !453, line: 71)
!453 = !DISubprogram(name: "ispunct", scope: !437, file: !437, line: 117, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!454 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !455, line: 72)
!455 = !DISubprogram(name: "isspace", scope: !437, file: !437, line: 118, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !457, line: 73)
!457 = !DISubprogram(name: "isupper", scope: !437, file: !437, line: 119, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!458 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !459, line: 74)
!459 = !DISubprogram(name: "isxdigit", scope: !437, file: !437, line: 120, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!460 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !461, line: 75)
!461 = !DISubprogram(name: "tolower", scope: !437, file: !437, line: 124, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!462 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !463, line: 76)
!463 = !DISubprogram(name: "toupper", scope: !437, file: !437, line: 127, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !46, entity: !56, line: 44)
!465 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !46, entity: !82, line: 45)
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !467, line: 82)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctrans_t", file: !468, line: 186, baseType: !469)
!468 = !DIFile(filename: "/usr/include/wctype.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !155, line: 40, baseType: !29)
!472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !473, line: 83)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctype_t", file: !468, line: 52, baseType: !57)
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !118, line: 84)
!475 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !476, line: 86)
!476 = !DISubprogram(name: "iswalnum", scope: !468, file: !468, line: 111, type: !365, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !478, line: 87)
!478 = !DISubprogram(name: "iswalpha", scope: !468, file: !468, line: 117, type: !365, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !480, line: 89)
!480 = !DISubprogram(name: "iswblank", scope: !468, file: !468, line: 162, type: !365, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !482, line: 91)
!482 = !DISubprogram(name: "iswcntrl", scope: !468, file: !468, line: 120, type: !365, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!483 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !484, line: 92)
!484 = !DISubprogram(name: "iswctype", scope: !468, file: !468, line: 175, type: !485, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!485 = !DISubroutineType(types: !486)
!486 = !{!29, !118, !473}
!487 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !488, line: 93)
!488 = !DISubprogram(name: "iswdigit", scope: !468, file: !468, line: 124, type: !365, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !490, line: 94)
!490 = !DISubprogram(name: "iswgraph", scope: !468, file: !468, line: 128, type: !365, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !492, line: 95)
!492 = !DISubprogram(name: "iswlower", scope: !468, file: !468, line: 133, type: !365, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!493 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !494, line: 96)
!494 = !DISubprogram(name: "iswprint", scope: !468, file: !468, line: 136, type: !365, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !496, line: 97)
!496 = !DISubprogram(name: "iswpunct", scope: !468, file: !468, line: 141, type: !365, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!497 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !498, line: 98)
!498 = !DISubprogram(name: "iswspace", scope: !468, file: !468, line: 146, type: !365, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!499 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !500, line: 99)
!500 = !DISubprogram(name: "iswupper", scope: !468, file: !468, line: 151, type: !365, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!501 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !502, line: 100)
!502 = !DISubprogram(name: "iswxdigit", scope: !468, file: !468, line: 156, type: !365, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !504, line: 101)
!504 = !DISubprogram(name: "towctrans", scope: !468, file: !468, line: 221, type: !505, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!505 = !DISubroutineType(types: !506)
!506 = !{!118, !118, !467}
!507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !508, line: 102)
!508 = !DISubprogram(name: "towlower", scope: !468, file: !468, line: 194, type: !509, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!509 = !DISubroutineType(types: !510)
!510 = !{!118, !118}
!511 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !512, line: 103)
!512 = !DISubprogram(name: "towupper", scope: !468, file: !468, line: 197, type: !509, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!513 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !514, line: 104)
!514 = !DISubprogram(name: "wctrans", scope: !468, file: !468, line: 218, type: !515, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!515 = !DISubroutineType(types: !516)
!516 = !{!467, !221}
!517 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !518, line: 105)
!518 = !DISubprogram(name: "wctype", scope: !468, file: !468, line: 171, type: !519, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!519 = !DISubroutineType(types: !520)
!520 = !{!473, !221}
!521 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !522, line: 98)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !130, line: 48, baseType: !131)
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !524, line: 99)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !130, line: 110, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "_G_fpos_t", file: !526, line: 25, baseType: !527)
!526 = !DIFile(filename: "/usr/include/_G_config.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!527 = !DICompositeType(tag: DW_TAG_structure_type, file: !526, line: 21, size: 128, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTS9_G_fpos_t")
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !529, line: 101)
!529 = !DISubprogram(name: "clearerr", scope: !130, file: !130, line: 826, type: !530, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !532}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !534, line: 102)
!534 = !DISubprogram(name: "fclose", scope: !130, file: !130, line: 237, type: !535, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!535 = !DISubroutineType(types: !536)
!536 = !{!29, !532}
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !538, line: 103)
!538 = !DISubprogram(name: "feof", scope: !130, file: !130, line: 828, type: !535, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !540, line: 104)
!540 = !DISubprogram(name: "ferror", scope: !130, file: !130, line: 830, type: !535, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !542, line: 105)
!542 = !DISubprogram(name: "fflush", scope: !130, file: !130, line: 242, type: !535, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!543 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !544, line: 106)
!544 = !DISubprogram(name: "fgetc", scope: !130, file: !130, line: 531, type: !535, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !546, line: 107)
!546 = !DISubprogram(name: "fgetpos", scope: !130, file: !130, line: 798, type: !547, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!547 = !DISubroutineType(types: !548)
!548 = !{!29, !549, !550}
!549 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !532)
!550 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !553, line: 108)
!553 = !DISubprogram(name: "fgets", scope: !130, file: !130, line: 622, type: !554, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!554 = !DISubroutineType(types: !555)
!555 = !{!78, !290, !29, !549}
!556 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !557, line: 109)
!557 = !DISubprogram(name: "fopen", scope: !130, file: !130, line: 272, type: !558, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!558 = !DISubroutineType(types: !559)
!559 = !{!532, !220, !220}
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !561, line: 110)
!561 = !DISubprogram(name: "fprintf", scope: !130, file: !130, line: 356, type: !562, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!562 = !DISubroutineType(types: !563)
!563 = !{!29, !549, !220, null}
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !565, line: 111)
!565 = !DISubprogram(name: "fputc", scope: !130, file: !130, line: 573, type: !566, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!566 = !DISubroutineType(types: !567)
!567 = !{!29, !29, !532}
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !569, line: 112)
!569 = !DISubprogram(name: "fputs", scope: !130, file: !130, line: 689, type: !570, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!570 = !DISubroutineType(types: !571)
!571 = !{!29, !220, !549}
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !573, line: 113)
!573 = !DISubprogram(name: "fread", scope: !130, file: !130, line: 709, type: !574, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!574 = !DISubroutineType(types: !575)
!575 = !{!175, !576, !175, !175, !549}
!576 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !170)
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !578, line: 114)
!578 = !DISubprogram(name: "freopen", scope: !130, file: !130, line: 278, type: !579, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!579 = !DISubroutineType(types: !580)
!580 = !{!532, !220, !220, !549}
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !582, line: 115)
!582 = !DISubprogram(name: "fscanf", scope: !130, file: !130, line: 425, type: !562, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!583 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !584, line: 116)
!584 = !DISubprogram(name: "fseek", scope: !130, file: !130, line: 749, type: !585, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!585 = !DISubroutineType(types: !586)
!586 = !{!29, !532, !83, !29}
!587 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !588, line: 117)
!588 = !DISubprogram(name: "fsetpos", scope: !130, file: !130, line: 803, type: !589, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!589 = !DISubroutineType(types: !590)
!590 = !{!29, !532, !591}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !524)
!593 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !594, line: 118)
!594 = !DISubprogram(name: "ftell", scope: !130, file: !130, line: 754, type: !595, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!595 = !DISubroutineType(types: !596)
!596 = !{!83, !532}
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !598, line: 119)
!598 = !DISubprogram(name: "fwrite", scope: !130, file: !130, line: 715, type: !599, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!599 = !DISubroutineType(types: !600)
!600 = !{!175, !601, !175, !175, !549}
!601 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!604 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !605, line: 120)
!605 = !DISubprogram(name: "getc", scope: !130, file: !130, line: 532, type: !535, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!606 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !607, line: 121)
!607 = !DISubprogram(name: "getchar", scope: !608, file: !608, line: 44, type: !609, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!608 = !DIFile(filename: "/usr/include/bits/stdio.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!609 = !DISubroutineType(types: !610)
!610 = !{!29}
!611 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !612, line: 124)
!612 = !DISubprogram(name: "gets", scope: !130, file: !130, line: 638, type: !613, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!613 = !DISubroutineType(types: !614)
!614 = !{!78, !78}
!615 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !616, line: 126)
!616 = !DISubprogram(name: "perror", scope: !130, file: !130, line: 846, type: !617, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!617 = !DISubroutineType(types: !618)
!618 = !{null, !221}
!619 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !620, line: 127)
!620 = !DISubprogram(name: "printf", scope: !130, file: !130, line: 362, type: !621, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!621 = !DISubroutineType(types: !622)
!622 = !{!29, !220, null}
!623 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !624, line: 128)
!624 = !DISubprogram(name: "putc", scope: !130, file: !130, line: 574, type: !566, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!625 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !626, line: 129)
!626 = !DISubprogram(name: "putchar", scope: !608, file: !608, line: 79, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !628, line: 130)
!628 = !DISubprogram(name: "puts", scope: !130, file: !130, line: 695, type: !629, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!629 = !DISubroutineType(types: !630)
!630 = !{!29, !221}
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !632, line: 131)
!632 = !DISubprogram(name: "remove", scope: !130, file: !130, line: 178, type: !629, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!633 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !634, line: 132)
!634 = !DISubprogram(name: "rename", scope: !130, file: !130, line: 180, type: !635, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!635 = !DISubroutineType(types: !636)
!636 = !{!29, !221, !221}
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !638, line: 133)
!638 = !DISubprogram(name: "rewind", scope: !130, file: !130, line: 759, type: !530, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!639 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !640, line: 134)
!640 = !DISubprogram(name: "scanf", scope: !130, file: !130, line: 431, type: !621, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !642, line: 135)
!642 = !DISubprogram(name: "setbuf", scope: !130, file: !130, line: 332, type: !643, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!643 = !DISubroutineType(types: !644)
!644 = !{null, !549, !290}
!645 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !646, line: 136)
!646 = !DISubprogram(name: "setvbuf", scope: !130, file: !130, line: 336, type: !647, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!647 = !DISubroutineType(types: !648)
!648 = !{!29, !549, !290, !29, !175}
!649 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !650, line: 137)
!650 = !DISubprogram(name: "sprintf", scope: !130, file: !130, line: 364, type: !651, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!651 = !DISubroutineType(types: !652)
!652 = !{!29, !290, !220, null}
!653 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !654, line: 138)
!654 = !DISubprogram(name: "sscanf", scope: !130, file: !130, line: 433, type: !655, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!655 = !DISubroutineType(types: !656)
!656 = !{!29, !220, !220, null}
!657 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !658, line: 139)
!658 = !DISubprogram(name: "tmpfile", scope: !130, file: !130, line: 195, type: !659, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!659 = !DISubroutineType(types: !660)
!660 = !{!532}
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !662, line: 141)
!662 = !DISubprogram(name: "tmpnam", scope: !130, file: !130, line: 209, type: !613, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!663 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !664, line: 143)
!664 = !DISubprogram(name: "ungetc", scope: !130, file: !130, line: 702, type: !566, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!665 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !666, line: 144)
!666 = !DISubprogram(name: "vfprintf", scope: !130, file: !130, line: 371, type: !667, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!667 = !DISubroutineType(types: !668)
!668 = !{!29, !549, !220, !263}
!669 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !670, line: 145)
!670 = !DISubprogram(name: "vprintf", scope: !608, file: !608, line: 36, type: !671, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!671 = !DISubroutineType(types: !672)
!672 = !{!29, !220, !263}
!673 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !674, line: 146)
!674 = !DISubprogram(name: "vsprintf", scope: !130, file: !130, line: 379, type: !675, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!675 = !DISubroutineType(types: !676)
!676 = !{!29, !290, !220, !263}
!677 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !46, entity: !678, line: 175)
!678 = !DISubprogram(name: "snprintf", scope: !130, file: !130, line: 386, type: !679, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!679 = !DISubroutineType(types: !680)
!680 = !{!29, !290, !175, !220, null}
!681 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !46, entity: !682, line: 176)
!682 = !DISubprogram(name: "vfscanf", scope: !130, file: !130, line: 471, type: !667, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!683 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !46, entity: !684, line: 177)
!684 = !DISubprogram(name: "vscanf", scope: !130, file: !130, line: 479, type: !671, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!685 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !46, entity: !686, line: 178)
!686 = !DISubprogram(name: "vsnprintf", scope: !130, file: !130, line: 390, type: !687, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!687 = !DISubroutineType(types: !688)
!688 = !{!29, !290, !175, !220, !263}
!689 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !46, entity: !690, line: 179)
!690 = !DISubprogram(name: "vsscanf", scope: !130, file: !130, line: 483, type: !691, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!691 = !DISubroutineType(types: !692)
!692 = !{!29, !220, !220, !263}
!693 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !678, line: 185)
!694 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !682, line: 186)
!695 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !684, line: 187)
!696 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !686, line: 188)
!697 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !690, line: 189)
!698 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !699, line: 102)
!699 = !DISubprogram(name: "acos", scope: !700, file: !700, line: 54, type: !701, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!700 = !DIFile(filename: "/usr/include/bits/mathcalls.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!701 = !DISubroutineType(types: !702)
!702 = !{!30, !30}
!703 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !704, line: 121)
!704 = !DISubprogram(name: "asin", scope: !700, file: !700, line: 56, type: !701, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!705 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !706, line: 140)
!706 = !DISubprogram(name: "atan", scope: !700, file: !700, line: 58, type: !701, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!707 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !708, line: 159)
!708 = !DISubprogram(name: "atan2", scope: !700, file: !700, line: 60, type: !709, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!709 = !DISubroutineType(types: !710)
!710 = !{!30, !30, !30}
!711 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !712, line: 180)
!712 = !DISubprogram(name: "ceil", scope: !700, file: !700, line: 178, type: !701, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!713 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !714, line: 199)
!714 = !DISubprogram(name: "cos", scope: !700, file: !700, line: 63, type: !701, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!715 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !716, line: 218)
!716 = !DISubprogram(name: "cosh", scope: !700, file: !700, line: 72, type: !701, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!717 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !718, line: 237)
!718 = !DISubprogram(name: "exp", scope: !700, file: !700, line: 100, type: !701, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!719 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !720, line: 256)
!720 = !DISubprogram(name: "fabs", scope: !700, file: !700, line: 181, type: !701, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!721 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !722, line: 275)
!722 = !DISubprogram(name: "floor", scope: !700, file: !700, line: 184, type: !701, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!723 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !724, line: 294)
!724 = !DISubprogram(name: "fmod", scope: !700, file: !700, line: 187, type: !709, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!725 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !726, line: 315)
!726 = !DISubprogram(name: "frexp", scope: !700, file: !700, line: 103, type: !727, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!727 = !DISubroutineType(types: !728)
!728 = !{!30, !30, !729}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!730 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !731, line: 334)
!731 = !DISubprogram(name: "ldexp", scope: !700, file: !700, line: 106, type: !732, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!732 = !DISubroutineType(types: !733)
!733 = !{!30, !30, !29}
!734 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !735, line: 353)
!735 = !DISubprogram(name: "log", scope: !700, file: !700, line: 109, type: !701, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!736 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !737, line: 372)
!737 = !DISubprogram(name: "log10", scope: !700, file: !700, line: 112, type: !701, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!738 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !739, line: 391)
!739 = !DISubprogram(name: "modf", scope: !700, file: !700, line: 115, type: !740, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!740 = !DISubroutineType(types: !741)
!741 = !{!30, !30, !742}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!743 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !744, line: 403)
!744 = !DISubprogram(name: "pow", scope: !700, file: !700, line: 153, type: !709, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!745 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !746, line: 440)
!746 = !DISubprogram(name: "sin", scope: !700, file: !700, line: 65, type: !701, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!747 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !748, line: 459)
!748 = !DISubprogram(name: "sinh", scope: !700, file: !700, line: 74, type: !701, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!749 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !750, line: 478)
!750 = !DISubprogram(name: "sqrt", scope: !700, file: !700, line: 156, type: !701, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!751 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !752, line: 497)
!752 = !DISubprogram(name: "tan", scope: !700, file: !700, line: 67, type: !701, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!753 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !754, line: 516)
!754 = !DISubprogram(name: "tanh", scope: !700, file: !700, line: 76, type: !701, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!755 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !0, entity: !5, line: 36)
!756 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !0, entity: !5, line: 33)
!757 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !758, line: 60)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_t", file: !759, line: 59, baseType: !760)
!759 = !DIFile(filename: "/usr/include/time.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !155, line: 135, baseType: !83)
!761 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !762, line: 61)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !759, line: 75, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !155, line: 139, baseType: !83)
!764 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !314, line: 62)
!765 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !766, line: 64)
!766 = !DISubprogram(name: "clock", scope: !759, file: !759, line: 189, type: !767, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!767 = !DISubroutineType(types: !768)
!768 = !{!758}
!769 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !770, line: 65)
!770 = !DISubprogram(name: "difftime", scope: !759, file: !759, line: 195, type: !771, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!771 = !DISubroutineType(types: !772)
!772 = !{!30, !762, !762}
!773 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !774, line: 66)
!774 = !DISubprogram(name: "mktime", scope: !759, file: !759, line: 199, type: !775, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!775 = !DISubroutineType(types: !776)
!776 = !{!762, !777}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!778 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !779, line: 67)
!779 = !DISubprogram(name: "time", scope: !759, file: !759, line: 192, type: !780, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!780 = !DISubroutineType(types: !781)
!781 = !{!762, !782}
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64, align: 64)
!783 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !784, line: 68)
!784 = !DISubprogram(name: "asctime", scope: !759, file: !759, line: 261, type: !785, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!785 = !DISubroutineType(types: !786)
!786 = !{!78, !312}
!787 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !788, line: 69)
!788 = !DISubprogram(name: "ctime", scope: !759, file: !759, line: 264, type: !789, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!789 = !DISubroutineType(types: !790)
!790 = !{!78, !791}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64, align: 64)
!792 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !762)
!793 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !794, line: 70)
!794 = !DISubprogram(name: "gmtime", scope: !759, file: !759, line: 239, type: !795, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!795 = !DISubroutineType(types: !796)
!796 = !{!777, !791}
!797 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !798, line: 71)
!798 = !DISubprogram(name: "localtime", scope: !759, file: !759, line: 243, type: !795, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!799 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !5, entity: !800, line: 72)
!800 = !DISubprogram(name: "strftime", scope: !759, file: !759, line: 205, type: !801, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!801 = !DISubroutineType(types: !802)
!802 = !{!175, !290, !175, !220, !311}
!803 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !0, entity: !5, line: 35)
!804 = !{i32 2, !"Dwarf Version", i32 4}
!805 = !{i32 2, !"Debug Info Version", i32 3}
!806 = !{!"clang version 4.0.0 (http://gitlab.lsc.ic.unicamp.br/luis.mattos/DoAcrossClause-clang.git fe12e4b4ece0fc9f1e1d9cc24a1406f09e8c7a8a) (http://gitlab.lsc.ic.unicamp.br/luis.mattos/DoAcrossClause.git 6ee0695152160be155346b4d0d8daeaf01555185)"}
!807 = distinct !DISubprogram(name: "RotateEngine", linkageName: "_ZN12RotateEngineC2Ev", scope: !808, file: !1, line: 46, type: !887, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: true, unit: !0, declaration: !886, variables: !919)
!808 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "RotateEngine", file: !809, line: 43, size: 960, align: 64, elements: !810, identifier: "_ZTS12RotateEngine")
!809 = !DIFile(filename: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/rotation_engine.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!810 = !{!811, !814, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !890, !891, !892, !895, !896, !899, !902, !905, !908, !909, !912, !913, !916}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "destname", scope: !808, file: !809, line: 52, baseType: !812, size: 256, align: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "string", scope: !42, file: !813, line: 74, baseType: !40)
!813 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/bits/stringfwd.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!814 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !808, file: !809, line: 53, baseType: !815, size: 64, align: 64, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64, align: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Image", file: !33, line: 63, size: 256, align: 64, elements: !817, identifier: "_ZTS5Image")
!817 = !{!818, !829, !830, !831, !832, !833, !834, !835, !839, !842, !845, !848, !851, !854, !857, !858, !859, !860, !863, !871}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "pixels", scope: !816, file: !33, line: 77, baseType: !819, size: 64, align: 64)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64, align: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pixel", file: !33, line: 45, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 43, size: 24, align: 8, elements: !822, identifier: "_ZTS5Pixel")
!822 = !{!823, !827, !828}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !821, file: !33, line: 44, baseType: !824, size: 8, align: 8)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !825, line: 48, baseType: !826)
!825 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!826 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !821, file: !33, line: 44, baseType: !824, size: 8, align: 8, offset: 8)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !821, file: !33, line: 44, baseType: !824, size: 8, align: 8, offset: 16)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !816, file: !33, line: 78, baseType: !112, size: 32, align: 32, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !816, file: !33, line: 78, baseType: !112, size: 32, align: 32, offset: 96)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !816, file: !33, line: 79, baseType: !112, size: 32, align: 32, offset: 128)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "maxcolor", scope: !816, file: !33, line: 79, baseType: !112, size: 32, align: 32, offset: 160)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "x_off", scope: !816, file: !33, line: 80, baseType: !27, size: 32, align: 32, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "y_off", scope: !816, file: !33, line: 80, baseType: !27, size: 32, align: 32, offset: 224)
!835 = !DISubprogram(name: "createImageFromBuffer", linkageName: "_ZN5Image21createImageFromBufferEiiiP5Pixel", scope: !816, file: !33, line: 65, type: !836, isLocal: false, isDefinition: false, scopeLine: 65, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!836 = !DISubroutineType(types: !837)
!837 = !{null, !838, !29, !29, !29, !819}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!839 = !DISubprogram(name: "createImageFromFile", linkageName: "_ZN5Image19createImageFromFileEPKc", scope: !816, file: !33, line: 66, type: !840, isLocal: false, isDefinition: false, scopeLine: 66, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!840 = !DISubroutineType(types: !841)
!841 = !{!94, !838, !221}
!842 = !DISubprogram(name: "createImageFromTemplate", linkageName: "_ZN5Image23createImageFromTemplateEiii", scope: !816, file: !33, line: 67, type: !843, isLocal: false, isDefinition: false, scopeLine: 67, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!843 = !DISubroutineType(types: !844)
!844 = !{null, !838, !29, !29, !29}
!845 = !DISubprogram(name: "getPixelAt", linkageName: "_ZN5Image10getPixelAtEii", scope: !816, file: !33, line: 68, type: !846, isLocal: false, isDefinition: false, scopeLine: 68, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!846 = !DISubroutineType(types: !847)
!847 = !{!820, !838, !29, !29}
!848 = !DISubprogram(name: "setPixelAt", linkageName: "_ZN5Image10setPixelAtEiiP5Pixel", scope: !816, file: !33, line: 69, type: !849, isLocal: false, isDefinition: false, scopeLine: 69, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!849 = !DISubroutineType(types: !850)
!850 = !{null, !838, !29, !29, !819}
!851 = !DISubprogram(name: "containsPixel", linkageName: "_ZN5Image13containsPixelEP5Coord", scope: !816, file: !33, line: 70, type: !852, isLocal: false, isDefinition: false, scopeLine: 70, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!852 = !DISubroutineType(types: !853)
!853 = !{!94, !838, !31}
!854 = !DISubprogram(name: "getWidth", linkageName: "_ZN5Image8getWidthEv", scope: !816, file: !33, line: 71, type: !855, isLocal: false, isDefinition: false, scopeLine: 71, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!855 = !DISubroutineType(types: !856)
!856 = !{!112, !838}
!857 = !DISubprogram(name: "getHeight", linkageName: "_ZN5Image9getHeightEv", scope: !816, file: !33, line: 72, type: !855, isLocal: false, isDefinition: false, scopeLine: 72, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!858 = !DISubprogram(name: "getDepth", linkageName: "_ZN5Image8getDepthEv", scope: !816, file: !33, line: 73, type: !855, isLocal: false, isDefinition: false, scopeLine: 73, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!859 = !DISubprogram(name: "getMaxcolor", linkageName: "_ZN5Image11getMaxcolorEv", scope: !816, file: !33, line: 74, type: !855, isLocal: false, isDefinition: false, scopeLine: 74, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!860 = !DISubprogram(name: "clean", linkageName: "_ZN5Image5cleanEv", scope: !816, file: !33, line: 75, type: !861, isLocal: false, isDefinition: false, scopeLine: 75, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!861 = !DISubroutineType(types: !862)
!862 = !{null, !838}
!863 = !DISubprogram(name: "ppmGetInt", linkageName: "_ZN5Image9ppmGetIntERSt13basic_fstreamIcSt11char_traitsIcEE", scope: !816, file: !33, line: 81, type: !864, isLocal: false, isDefinition: false, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: true)
!864 = !DISubroutineType(types: !865)
!865 = !{!29, !838, !866}
!866 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !867, size: 64, align: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "fstream", scope: !5, file: !868, line: 168, baseType: !869)
!868 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/iosfwd", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!869 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_fstream<char, std::char_traits<char> >", scope: !5, file: !870, line: 1056, size: 4224, align: 64, flags: DIFlagFwdDecl, identifier: "_ZTSSt13basic_fstreamIcSt11char_traitsIcEE")
!870 = !DIFile(filename: "/usr/lib/gcc/x86_64-redhat-linux/5.3.1/../../../../include/c++/5.3.1/bits/fstream.tcc", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T12/apps/ray-rot/build-check")
!871 = !DISubprogram(name: "ppmGetChar", linkageName: "_ZN5Image10ppmGetCharERSt13basic_fstreamIcSt11char_traitsIcEE", scope: !816, file: !33, line: 82, type: !872, isLocal: false, isDefinition: false, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true)
!872 = !DISubroutineType(types: !873)
!873 = !{!79, !838, !866}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !808, file: !809, line: 53, baseType: !815, size: 64, align: 64, offset: 320)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !808, file: !809, line: 54, baseType: !112, size: 32, align: 32, offset: 384)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !808, file: !809, line: 55, baseType: !94, size: 8, align: 8, offset: 416)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !808, file: !809, line: 55, baseType: !94, size: 8, align: 8, offset: 424)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ul", scope: !808, file: !809, line: 56, baseType: !32, size: 64, align: 32, offset: 448)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ur", scope: !808, file: !809, line: 56, baseType: !32, size: 64, align: 32, offset: 512)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ll", scope: !808, file: !809, line: 56, baseType: !32, size: 64, align: 32, offset: 576)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "lr", scope: !808, file: !809, line: 56, baseType: !32, size: 64, align: 32, offset: 640)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "c1", scope: !808, file: !809, line: 56, baseType: !32, size: 64, align: 32, offset: 704)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "c2", scope: !808, file: !809, line: 56, baseType: !32, size: 64, align: 32, offset: 768)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "c3", scope: !808, file: !809, line: 56, baseType: !32, size: 64, align: 32, offset: 832)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "c4", scope: !808, file: !809, line: 56, baseType: !32, size: 64, align: 32, offset: 896)
!886 = !DISubprogram(name: "RotateEngine", scope: !808, file: !809, line: 45, type: !887, isLocal: false, isDefinition: false, scopeLine: 45, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!887 = !DISubroutineType(types: !888)
!888 = !{null, !889}
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64, align: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!890 = !DISubprogram(name: "run", linkageName: "_ZN12RotateEngine3runEv", scope: !808, file: !809, line: 46, type: !887, isLocal: false, isDefinition: false, scopeLine: 46, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!891 = !DISubprogram(name: "finish", linkageName: "_ZN12RotateEngine6finishEv", scope: !808, file: !809, line: 47, type: !887, isLocal: false, isDefinition: false, scopeLine: 47, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!892 = !DISubprogram(name: "init", linkageName: "_ZN12RotateEngine4initEP5ImagejNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE", scope: !808, file: !809, line: 48, type: !893, isLocal: false, isDefinition: false, scopeLine: 48, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!893 = !DISubroutineType(types: !894)
!894 = !{!94, !889, !815, !112, !812}
!895 = !DISubprogram(name: "printRotationState", linkageName: "_ZN12RotateEngine18printRotationStateEv", scope: !808, file: !809, line: 49, type: !887, isLocal: false, isDefinition: false, scopeLine: 49, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!896 = !DISubprogram(name: "writeOutImage", linkageName: "_ZN12RotateEngine13writeOutImageEv", scope: !808, file: !809, line: 58, type: !897, isLocal: false, isDefinition: false, scopeLine: 58, flags: DIFlagPrototyped, isOptimized: true)
!897 = !DISubroutineType(types: !898)
!898 = !{!94, !889}
!899 = !DISubprogram(name: "rotatePoint", linkageName: "_ZN12RotateEngine11rotatePointEPfS0_j", scope: !808, file: !809, line: 59, type: !900, isLocal: false, isDefinition: false, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: true)
!900 = !DISubroutineType(types: !901)
!901 = !{null, !889, !28, !28, !112}
!902 = !DISubprogram(name: "round", linkageName: "_ZN12RotateEngine5roundEdi", scope: !808, file: !809, line: 60, type: !903, isLocal: false, isDefinition: false, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: true)
!903 = !DISubroutineType(types: !904)
!904 = !{!30, !889, !30, !29}
!905 = !DISubprogram(name: "computeTargetHeight", linkageName: "_ZN12RotateEngine19computeTargetHeightEv", scope: !808, file: !809, line: 61, type: !906, isLocal: false, isDefinition: false, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: true)
!906 = !DISubroutineType(types: !907)
!907 = !{!29, !889}
!908 = !DISubprogram(name: "computeTargetWidth", linkageName: "_ZN12RotateEngine18computeTargetWidthEv", scope: !808, file: !809, line: 62, type: !906, isLocal: false, isDefinition: false, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: true)
!909 = !DISubprogram(name: "findMax", linkageName: "_ZN12RotateEngine7findMaxEPf", scope: !808, file: !809, line: 63, type: !910, isLocal: false, isDefinition: false, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: true)
!910 = !DISubroutineType(types: !911)
!911 = !{!27, !889, !28}
!912 = !DISubprogram(name: "findMin", linkageName: "_ZN12RotateEngine7findMinEPf", scope: !808, file: !809, line: 64, type: !910, isLocal: false, isDefinition: false, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true)
!913 = !DISubprogram(name: "filter", linkageName: "_ZN12RotateEngine6filterEP5PixelS1_P5Coord", scope: !808, file: !809, line: 65, type: !914, isLocal: false, isDefinition: false, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: true)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !889, !819, !819, !31}
