; ModuleID = 'CMakeFiles/histo.dir/main-inst.c'
source_filename = "CMakeFiles/histo.dir/main-inst.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%ident_t = type { i32, i32, i32, i32, i8* }
%struct.pb_TimerSet = type { i32, %struct.pb_async_time_marker_list*, i64, i64, [8 x %struct.pb_Timer], [8 x %struct.pb_SubTimerList*] }
%struct.pb_async_time_marker_list = type { i8*, i32, i8*, %struct.pb_async_time_marker_list* }
%struct.pb_Timer = type { i32, i64, i64 }
%struct.pb_SubTimerList = type { %struct.pb_SubTimer*, %struct.pb_SubTimer* }
%struct.pb_SubTimer = type { i8*, %struct.pb_Timer, %struct.pb_SubTimer* }
%struct.pb_Parameters = type { i8*, i8** }

@.str = private unnamed_addr constant [39 x i8] c"Base implementation of histogramming.\0A\00", align 1
@.str.1 = private unnamed_addr constant [48 x i8] c"Maintained by Nady Obeid <obeid1@ece.uiuc.edu>\0A\00", align 1
@.str.2 = private unnamed_addr constant [21 x i8] c"Input file expected\0A\00", align 1
@stderr = external global %struct._IO_FILE*, align 8
@.str.3 = private unnamed_addr constant [45 x i8] c"Expected at least one command line argument\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 4.0.0 (http://gitlab.lsc.ic.unicamp.br/luis.mattos/DoAcrossClause-clang.git 587724e9c6678af22b0b9d7649d8b84fb39aaaee) (http://gitlab.lsc.ic.unicamp.br/luis.mattos/DoAcrossClause.git 6f76a77790273ec9529638e6dc9391b206557c59)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !19)
!1 = !DIFile(filename: "CMakeFiles/histo.dir/main-inst.c", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T11/parboil/benchmarks/histo/build")
!2 = !{!3, !15}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pb_TimerID", file: !4, line: 93, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/home/msc2018-ceb/ra211848/Documents/IPP/T11/parboil/benchmarks/histo/../../common/include/parboil.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T11/parboil/benchmarks/histo/build")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "pb_TimerID_NONE", value: 0)
!7 = !DIEnumerator(name: "pb_TimerID_IO", value: 1)
!8 = !DIEnumerator(name: "pb_TimerID_KERNEL", value: 2)
!9 = !DIEnumerator(name: "pb_TimerID_COPY", value: 3)
!10 = !DIEnumerator(name: "pb_TimerID_DRIVER", value: 4)
!11 = !DIEnumerator(name: "pb_TimerID_COPY_ASYNC", value: 5)
!12 = !DIEnumerator(name: "pb_TimerID_COMPUTE", value: 6)
!13 = !DIEnumerator(name: "pb_TimerID_OVERLAP", value: 7)
!14 = !DIEnumerator(name: "pb_TimerID_LAST", value: 8)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pb_TimerState", file: !4, line: 53, size: 32, align: 32, elements: !16)
!16 = !{!17, !18}
!17 = !DIEnumerator(name: "pb_Timer_STOPPED", value: 0)
!18 = !DIEnumerator(name: "pb_Timer_RUNNING", value: 1)
!19 = !{!20, !22, !24}
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!25 = !{i32 2, !"Dwarf Version", i32 4}
!26 = !{i32 2, !"Debug Info Version", i32 3}
!27 = !{!"clang version 4.0.0 (http://gitlab.lsc.ic.unicamp.br/luis.mattos/DoAcrossClause-clang.git 587724e9c6678af22b0b9d7649d8b84fb39aaaee) (http://gitlab.lsc.ic.unicamp.br/luis.mattos/DoAcrossClause.git 6f76a77790273ec9529638e6dc9391b206557c59)"}
!28 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 29, type: !29, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !35)
!29 = !DISubroutineType(types: !30)
!30 = !{!31, !31, !32}
!31 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!35 = !{}
!36 = !DILocalVariable(name: "argc", arg: 1, scope: !28, file: !1, line: 29, type: !31)
!37 = !DIExpression()
!38 = !DILocation(line: 29, column: 14, scope: !28)
!39 = !DILocalVariable(name: "argv", arg: 2, scope: !28, file: !1, line: 29, type: !32)
!40 = !DILocation(line: 29, column: 26, scope: !28)
!41 = !DILocalVariable(name: "timers", scope: !28, file: !1, line: 30, type: !42)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pb_TimerSet", file: !4, line: 136, size: 2304, align: 64, elements: !43)
!43 = !{!44, !45, !54, !57, !58, !67}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !42, file: !4, line: 137, baseType: !3, size: 32, align: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "async_markers", scope: !42, file: !4, line: 138, baseType: !46, size: 64, align: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pb_async_time_marker_list", file: !4, line: 115, size: 256, align: 64, elements: !48)
!48 = !{!49, !50, !51, !53}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !47, file: !4, line: 116, baseType: !33, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "timerID", scope: !47, file: !4, line: 117, baseType: !3, size: 32, align: 32, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "marker", scope: !47, file: !4, line: 119, baseType: !52, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !47, file: !4, line: 121, baseType: !46, size: 64, align: 64, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "async_begin", scope: !42, file: !4, line: 139, baseType: !55, size: 64, align: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "pb_Timestamp", file: !4, line: 48, baseType: !56)
!56 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "wall_begin", scope: !42, file: !4, line: 140, baseType: !55, size: 64, align: 64, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "timers", scope: !42, file: !4, line: 141, baseType: !59, size: 1536, align: 64, offset: 256)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 1536, align: 64, elements: !65)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pb_Timer", file: !4, line: 58, size: 192, align: 64, elements: !61)
!61 = !{!62, !63, !64}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !60, file: !4, line: 59, baseType: !15, size: 32, align: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !60, file: !4, line: 60, baseType: !55, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !60, file: !4, line: 61, baseType: !55, size: 64, align: 64, offset: 128)
!65 = !{!66}
!66 = !DISubrange(count: 8)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "sub_timer_list", scope: !42, file: !4, line: 142, baseType: !68, size: 512, align: 64, offset: 1792)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 512, align: 64, elements: !65)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64, align: 64)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pb_SubTimerList", file: !4, line: 130, size: 128, align: 64, elements: !71)
!71 = !{!72, !79}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !70, file: !4, line: 131, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pb_SubTimer", file: !4, line: 124, size: 320, align: 64, elements: !75)
!75 = !{!76, !77, !78}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !74, file: !4, line: 125, baseType: !33, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !74, file: !4, line: 126, baseType: !60, size: 192, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !74, file: !4, line: 127, baseType: !73, size: 64, align: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "subtimer_list", scope: !70, file: !4, line: 132, baseType: !73, size: 64, align: 64, offset: 64)
!80 = !DILocation(line: 30, column: 22, scope: !28)
!81 = !DILocalVariable(name: "parameters", scope: !28, file: !1, line: 31, type: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pb_Parameters", file: !4, line: 14, size: 128, align: 64, elements: !84)
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "outFile", scope: !83, file: !4, line: 15, baseType: !33, size: 64, align: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "inpFiles", scope: !83, file: !4, line: 18, baseType: !32, size: 64, align: 64, offset: 64)
!87 = !DILocation(line: 31, column: 25, scope: !28)
!88 = !DILocation(line: 33, column: 3, scope: !28)
!89 = !DILocation(line: 34, column: 3, scope: !28)
!90 = !DILocation(line: 36, column: 41, scope: !28)
!91 = !DILocation(line: 36, column: 16, scope: !28)
!92 = !DILocation(line: 36, column: 14, scope: !28)
!93 = !DILocation(line: 37, column: 8, scope: !94)
!94 = distinct !DILexicalBlock(scope: !28, file: !1, line: 37, column: 7)
!95 = !DILocation(line: 37, column: 7, scope: !28)
!96 = !DILocation(line: 38, column: 5, scope: !97)
!97 = distinct !DILexicalBlock(scope: !94, file: !1, line: 37, column: 20)
!98 = !DILocation(line: 41, column: 8, scope: !99)
!99 = distinct !DILexicalBlock(scope: !28, file: !1, line: 41, column: 7)
!100 = !DILocation(line: 41, column: 20, scope: !99)
!101 = !DILocation(line: 41, column: 7, scope: !28)
!102 = !DILocation(line: 42, column: 36, scope: !103)
!103 = distinct !DILexicalBlock(scope: !99, file: !1, line: 41, column: 33)
!104 = !DILocation(line: 42, column: 5, scope: !103)
!105 = !DILocation(line: 43, column: 5, scope: !103)
!106 = !DILocalVariable(name: "numIterations", scope: !28, file: !1, line: 46, type: !31)
!107 = !DILocation(line: 46, column: 7, scope: !28)
!108 = !DILocation(line: 47, column: 7, scope: !109)
!109 = distinct !DILexicalBlock(scope: !28, file: !1, line: 47, column: 7)
!110 = !DILocation(line: 47, column: 12, scope: !109)
!111 = !DILocation(line: 47, column: 7, scope: !28)
!112 = !DILocation(line: 48, column: 26, scope: !113)
!113 = distinct !DILexicalBlock(scope: !109, file: !1, line: 47, column: 18)
!114 = !DILocation(line: 48, column: 21, scope: !113)
!115 = !DILocation(line: 48, column: 19, scope: !113)
!116 = !DILocation(line: 49, column: 3, scope: !113)
!117 = !DILocation(line: 50, column: 60, scope: !118)
!118 = distinct !DILexicalBlock(scope: !109, file: !1, line: 49, column: 10)
!119 = !DILocation(line: 50, column: 5, scope: !118)
!120 = !DILocation(line: 51, column: 5, scope: !118)
!121 = !DILocation(line: 54, column: 3, scope: !28)
!122 = !DILocalVariable(name: "inputStr", scope: !28, file: !1, line: 56, type: !33)
!123 = !DILocation(line: 56, column: 9, scope: !28)
!124 = !DILocalVariable(name: "outputStr", scope: !28, file: !1, line: 57, type: !33)
!125 = !DILocation(line: 57, column: 9, scope: !28)
!126 = !DILocation(line: 59, column: 27, scope: !28)
!127 = !DILocation(line: 59, column: 3, scope: !28)
!128 = !DILocation(line: 60, column: 27, scope: !28)
!129 = !DILocation(line: 60, column: 3, scope: !28)
!130 = !DILocation(line: 62, column: 32, scope: !28)
!131 = !DILocation(line: 62, column: 3, scope: !28)
!132 = !DILocalVariable(name: "img_width", scope: !28, file: !1, line: 64, type: !21)
!133 = !DILocation(line: 64, column: 16, scope: !28)
!134 = !DILocalVariable(name: "img_height", scope: !28, file: !1, line: 64, type: !21)
!135 = !DILocation(line: 64, column: 27, scope: !28)
!136 = !DILocalVariable(name: "histo_width", scope: !28, file: !1, line: 65, type: !21)
!137 = !DILocation(line: 65, column: 16, scope: !28)
!138 = !DILocalVariable(name: "histo_height", scope: !28, file: !1, line: 65, type: !21)
!139 = !DILocation(line: 65, column: 29, scope: !28)
!140 = !DILocalVariable(name: "f", scope: !28, file: !1, line: 67, type: !141)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !143, line: 48, baseType: !144)
!143 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T11/parboil/benchmarks/histo/build")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !145, line: 245, size: 1728, align: 64, elements: !146)
!145 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T11/parboil/benchmarks/histo/build")
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !167, !168, !169, !170, !173, !175, !177, !181, !184, !186, !187, !188, !189, !190, !194, !195}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !144, file: !145, line: 246, baseType: !31, size: 32, align: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !144, file: !145, line: 251, baseType: !33, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !144, file: !145, line: 252, baseType: !33, size: 64, align: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !144, file: !145, line: 253, baseType: !33, size: 64, align: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !144, file: !145, line: 254, baseType: !33, size: 64, align: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !144, file: !145, line: 255, baseType: !33, size: 64, align: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !144, file: !145, line: 256, baseType: !33, size: 64, align: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !144, file: !145, line: 257, baseType: !33, size: 64, align: 64, offset: 448)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !144, file: !145, line: 258, baseType: !33, size: 64, align: 64, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !144, file: !145, line: 260, baseType: !33, size: 64, align: 64, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !144, file: !145, line: 261, baseType: !33, size: 64, align: 64, offset: 640)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !144, file: !145, line: 262, baseType: !33, size: 64, align: 64, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !144, file: !145, line: 264, baseType: !160, size: 64, align: 64, offset: 768)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64, align: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !145, line: 160, size: 192, align: 64, elements: !162)
!162 = !{!163, !164, !166}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !161, file: !145, line: 161, baseType: !160, size: 64, align: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !161, file: !145, line: 162, baseType: !165, size: 64, align: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !161, file: !145, line: 166, baseType: !31, size: 32, align: 32, offset: 128)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !144, file: !145, line: 266, baseType: !165, size: 64, align: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !144, file: !145, line: 268, baseType: !31, size: 32, align: 32, offset: 896)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !144, file: !145, line: 272, baseType: !31, size: 32, align: 32, offset: 928)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !144, file: !145, line: 274, baseType: !171, size: 64, align: 64, offset: 960)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !172, line: 131, baseType: !24)
!172 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T11/parboil/benchmarks/histo/build")
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !144, file: !145, line: 278, baseType: !174, size: 16, align: 16, offset: 1024)
!174 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !144, file: !145, line: 279, baseType: !176, size: 8, align: 8, offset: 1040)
!176 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !144, file: !145, line: 280, baseType: !178, size: 8, align: 8, offset: 1048)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 8, align: 8, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 1)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !144, file: !145, line: 284, baseType: !182, size: 64, align: 64, offset: 1088)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !145, line: 154, baseType: null)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !144, file: !145, line: 293, baseType: !185, size: 64, align: 64, offset: 1152)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !172, line: 132, baseType: !24)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !144, file: !145, line: 302, baseType: !52, size: 64, align: 64, offset: 1216)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !144, file: !145, line: 303, baseType: !52, size: 64, align: 64, offset: 1280)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !144, file: !145, line: 304, baseType: !52, size: 64, align: 64, offset: 1344)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !144, file: !145, line: 305, baseType: !52, size: 64, align: 64, offset: 1408)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !144, file: !145, line: 306, baseType: !191, size: 64, align: 64, offset: 1472)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !192, line: 62, baseType: !193)
!192 = !DIFile(filename: "/opt/aclang/install/bin/../lib/clang/4.0.0/include/stddef.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T11/parboil/benchmarks/histo/build")
!193 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !144, file: !145, line: 308, baseType: !31, size: 32, align: 32, offset: 1536)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !144, file: !145, line: 310, baseType: !196, size: 160, align: 8, offset: 1568)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !34, size: 160, align: 8, elements: !197)
!197 = !{!198}
!198 = !DISubrange(count: 20)
!199 = !DILocation(line: 67, column: 9, scope: !28)
!200 = !DILocation(line: 67, column: 19, scope: !28)
!201 = !DILocation(line: 67, column: 31, scope: !28)
!202 = !DILocation(line: 67, column: 13, scope: !28)
!203 = !DILocalVariable(name: "result", scope: !28, file: !1, line: 68, type: !31)
!204 = !DILocation(line: 68, column: 7, scope: !28)
!205 = !DILocation(line: 70, column: 19, scope: !28)
!206 = !DILocation(line: 70, column: 56, scope: !28)
!207 = !DILocation(line: 70, column: 13, scope: !28)
!208 = !DILocation(line: 70, column: 10, scope: !28)
!209 = !DILocation(line: 71, column: 19, scope: !28)
!210 = !DILocation(line: 71, column: 57, scope: !28)
!211 = !DILocation(line: 71, column: 13, scope: !28)
!212 = !DILocation(line: 71, column: 10, scope: !28)
!213 = !DILocation(line: 72, column: 19, scope: !28)
!214 = !DILocation(line: 72, column: 58, scope: !28)
!215 = !DILocation(line: 72, column: 13, scope: !28)
!216 = !DILocation(line: 72, column: 10, scope: !28)
!217 = !DILocation(line: 73, column: 19, scope: !28)
!218 = !DILocation(line: 73, column: 59, scope: !28)
!219 = !DILocation(line: 73, column: 13, scope: !28)
!220 = !DILocation(line: 73, column: 10, scope: !28)
!221 = !DILocation(line: 75, column: 7, scope: !222)
!222 = distinct !DILexicalBlock(scope: !28, file: !1, line: 75, column: 7)
!223 = !DILocation(line: 75, column: 14, scope: !222)
!224 = !DILocation(line: 75, column: 7, scope: !28)
!225 = !DILocation(line: 76, column: 68, scope: !226)
!226 = distinct !DILexicalBlock(scope: !222, file: !1, line: 75, column: 20)
!227 = !DILocation(line: 76, column: 5, scope: !226)
!228 = !DILocation(line: 77, column: 5, scope: !226)
!229 = !DILocalVariable(name: "img", scope: !28, file: !1, line: 80, type: !20)
!230 = !DILocation(line: 80, column: 17, scope: !28)
!231 = !DILocation(line: 81, column: 30, scope: !28)
!232 = !DILocation(line: 81, column: 42, scope: !28)
!233 = !DILocation(line: 81, column: 40, scope: !28)
!234 = !DILocation(line: 81, column: 53, scope: !28)
!235 = !DILocation(line: 81, column: 23, scope: !28)
!236 = !DILocation(line: 81, column: 7, scope: !28)
!237 = !DILocalVariable(name: "histo", scope: !28, file: !1, line: 82, type: !22)
!238 = !DILocation(line: 82, column: 18, scope: !28)
!239 = !DILocation(line: 82, column: 50, scope: !28)
!240 = !DILocation(line: 82, column: 64, scope: !28)
!241 = !DILocation(line: 82, column: 62, scope: !28)
!242 = !DILocation(line: 82, column: 43, scope: !28)
!243 = !DILocation(line: 85, column: 3, scope: !28)
!244 = !DILocation(line: 87, column: 18, scope: !28)
!245 = !DILocation(line: 87, column: 45, scope: !28)
!246 = !DILocation(line: 87, column: 57, scope: !28)
!247 = !DILocation(line: 87, column: 55, scope: !28)
!248 = !DILocation(line: 87, column: 69, scope: !28)
!249 = !DILocation(line: 87, column: 12, scope: !28)
!250 = !DILocation(line: 87, column: 10, scope: !28)
!251 = !DILocation(line: 89, column: 10, scope: !28)
!252 = !DILocation(line: 89, column: 3, scope: !28)
!253 = !DILocation(line: 91, column: 7, scope: !254)
!254 = distinct !DILexicalBlock(scope: !28, file: !1, line: 91, column: 7)
!255 = !DILocation(line: 91, column: 17, scope: !254)
!256 = !DILocation(line: 91, column: 29, scope: !254)
!257 = !DILocation(line: 91, column: 27, scope: !254)
!258 = !DILocation(line: 91, column: 14, scope: !254)
!259 = !DILocation(line: 91, column: 7, scope: !28)
!260 = !DILocation(line: 92, column: 52, scope: !261)
!261 = distinct !DILexicalBlock(scope: !254, file: !1, line: 91, column: 41)
!262 = !DILocation(line: 92, column: 5, scope: !261)
!263 = !DILocation(line: 93, column: 5, scope: !261)
!264 = !DILocation(line: 96, column: 3, scope: !28)
