; ModuleID = 'CMakeFiles/histo.dir/util-inst.c'
source_filename = "CMakeFiles/histo.dir/util-inst.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RGB = type { i8, i8, i8 }
%struct.bmp_image = type { [2 x i8], %struct.bmpfile_header_t, %struct.bmp_dib_header_t, i32*, i8* }
%struct.bmpfile_header_t = type { i32, i16, i16, i32 }
%struct.bmp_dib_header_t = type { i32, i32, i32, i16, i16, i32, i32, i32, i32, i32, i32 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [3 x i8] c"wb\00", align 1
@0 = internal constant [33 x i8] c"CMakeFiles/histo.dir/util-inst.c\00"

; Function Attrs: nounwind uwtable
define void @create_bmp(%struct.RGB*, i32, i32, i8*) #0 !dbg !19 {
  %5 = alloca %struct.RGB*, align 8
  %6 = alloca i32, align 4
  %7 = alloca i32, align 4
  %8 = alloca i8*, align 8
  %9 = alloca %struct.bmp_image, align 8
  %10 = alloca i32, align 4
  %11 = alloca i8*, align 8
  %12 = alloca %struct._IO_FILE*, align 8
  %13 = alloca i32, align 4
  store %struct.RGB* %0, %struct.RGB** %5, align 8
  call void @llvm.dbg.declare(metadata %struct.RGB** %5, metadata !25, metadata !26), !dbg !27
  store i32 %1, i32* %6, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 4.0.0 (http://gitlab.lsc.ic.unicamp.br/luis.mattos/DoAcrossClause-clang.git 587724e9c6678af22b0b9d7649d8b84fb39aaaee) (http://gitlab.lsc.ic.unicamp.br/luis.mattos/DoAcrossClause.git 6f76a77790273ec9529638e6dc9391b206557c59)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "CMakeFiles/histo.dir/util-inst.c", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T11/parboil/benchmarks/histo/build")
!2 = !{}
!3 = !{!4, !6, !15}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64, align: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "RGB", file: !8, line: 16, baseType: !9)
!8 = !DIFile(filename: "/home/msc2018-ceb/ra211848/Documents/IPP/T11/parboil/benchmarks/histo/bmp.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T11/parboil/benchmarks/histo/build")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 12, size: 24, align: 8, elements: !10)
!10 = !{!11, !13, !14}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !9, file: !8, line: 13, baseType: !12, size: 8, align: 8)
!12 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "G", scope: !9, file: !8, line: 14, baseType: !12, size: 8, align: 8, offset: 8)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "R", scope: !9, file: !8, line: 15, baseType: !12, size: 8, align: 8, offset: 16)
!15 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!16 = !{i32 2, !"Dwarf Version", i32 4}
!17 = !{i32 2, !"Debug Info Version", i32 3}
!18 = !{!"clang version 4.0.0 (http://gitlab.lsc.ic.unicamp.br/luis.mattos/DoAcrossClause-clang.git 587724e9c6678af22b0b9d7649d8b84fb39aaaee) (http://gitlab.lsc.ic.unicamp.br/luis.mattos/DoAcrossClause.git 6f76a77790273ec9529638e6dc9391b206557c59)"}
!19 = distinct !DISubprogram(name: "create_bmp", scope: !8, file: !8, line: 56, type: !20, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !6, !22, !22, !23}
!22 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!25 = !DILocalVariable(name: "bitmap", arg: 1, scope: !19, file: !8, line: 56, type: !6)
!26 = !DIExpression()
!27 = !DILocation(line: 56, column: 22, scope: !19)
!28 = !DILocalVariable(name: "height", arg: 2, scope: !19, file: !8, line: 56, type: !22)
!29 = !DILocation(line: 56, column: 34, scope: !19)
!30 = !DILocalVariable(name: "width", arg: 3, scope: !19, file: !8, line: 56, type: !22)
!31 = !DILocation(line: 56, column: 46, scope: !19)
!32 = !DILocalVariable(name: "filename", arg: 4, scope: !19, file: !8, line: 56, type: !23)
!33 = !DILocation(line: 56, column: 65, scope: !19)
!34 = !DILocalVariable(name: "image", scope: !19, file: !8, line: 57, type: !35)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "bmp_image", file: !8, line: 54, baseType: !36)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 48, size: 576, align: 64, elements: !37)
!37 = !{!38, !42, !52, !67, !69}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !36, file: !8, line: 49, baseType: !39, size: 16, align: 8)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 16, align: 8, elements: !40)
!40 = !{!41}
!41 = !DISubrange(count: 2)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "file_header", scope: !36, file: !8, line: 50, baseType: !43, size: 96, align: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "bmpfile_header_t", file: !8, line: 23, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 18, size: 96, align: 32, elements: !45)
!45 = !{!46, !48, !50, !51}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "filesz", scope: !44, file: !8, line: 19, baseType: !47, size: 32, align: 32)
!47 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "creator1", scope: !44, file: !8, line: 20, baseType: !49, size: 16, align: 16, offset: 32)
!49 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "creator2", scope: !44, file: !8, line: 21, baseType: !49, size: 16, align: 16, offset: 48)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "bmp_offset", scope: !44, file: !8, line: 22, baseType: !47, size: 32, align: 32, offset: 64)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "dib_header", scope: !36, file: !8, line: 51, baseType: !53, size: 320, align: 32, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "bmp_dib_header_t", file: !8, line: 37, baseType: !54)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 25, size: 320, align: 32, elements: !55)
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "header_sz", scope: !54, file: !8, line: 26, baseType: !47, size: 32, align: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !54, file: !8, line: 27, baseType: !47, size: 32, align: 32, offset: 32)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !54, file: !8, line: 28, baseType: !47, size: 32, align: 32, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "nplanes", scope: !54, file: !8, line: 29, baseType: !49, size: 16, align: 16, offset: 96)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "bitspp", scope: !54, file: !8, line: 30, baseType: !49, size: 16, align: 16, offset: 112)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "compress_type", scope: !54, file: !8, line: 31, baseType: !47, size: 32, align: 32, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "bmp_bytesz", scope: !54, file: !8, line: 32, baseType: !47, size: 32, align: 32, offset: 160)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "hres", scope: !54, file: !8, line: 33, baseType: !47, size: 32, align: 32, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "vres", scope: !54, file: !8, line: 34, baseType: !47, size: 32, align: 32, offset: 224)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ncolors", scope: !54, file: !8, line: 35, baseType: !47, size: 32, align: 32, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "nimpcolors", scope: !54, file: !8, line: 36, baseType: !47, size: 32, align: 32, offset: 288)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !36, file: !8, line: 52, baseType: !68, size: 64, align: 64, offset: 448)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_map", scope: !36, file: !8, line: 53, baseType: !70, size: 64, align: 64, offset: 512)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!71 = !DILocation(line: 57, column: 13, scope: !19)
!72 = !DILocalVariable(name: "padded_width", scope: !19, file: !8, line: 59, type: !22)
!73 = !DILocation(line: 59, column: 7, scope: !19)
!74 = !DILocation(line: 59, column: 29, scope: !19)
!75 = !DILocation(line: 59, column: 35, scope: !19)
!76 = !DILocation(line: 59, column: 41, scope: !19)
!77 = !DILocation(line: 59, column: 47, scope: !19)
!78 = !DILocation(line: 59, column: 24, scope: !19)
!79 = !DILocation(line: 60, column: 19, scope: !19)
!80 = !DILocation(line: 60, column: 25, scope: !19)
!81 = !DILocation(line: 60, column: 16, scope: !19)
!82 = !DILocalVariable(name: "pad", scope: !19, file: !8, line: 62, type: !4)
!83 = !DILocation(line: 62, column: 9, scope: !19)
!84 = !DILocation(line: 62, column: 30, scope: !19)
!85 = !DILocation(line: 62, column: 23, scope: !19)
!86 = !DILocation(line: 64, column: 9, scope: !19)
!87 = !DILocation(line: 64, column: 3, scope: !19)
!88 = !DILocation(line: 64, column: 18, scope: !19)
!89 = !DILocation(line: 65, column: 9, scope: !19)
!90 = !DILocation(line: 65, column: 3, scope: !19)
!91 = !DILocation(line: 65, column: 18, scope: !19)
!92 = !DILocation(line: 69, column: 30, scope: !19)
!93 = !DILocation(line: 69, column: 39, scope: !19)
!94 = !DILocation(line: 69, column: 37, scope: !19)
!95 = !DILocation(line: 69, column: 45, scope: !19)
!96 = !DILocation(line: 68, column: 55, scope: !19)
!97 = !DILocation(line: 67, column: 30, scope: !19)
!98 = !DILocation(line: 67, column: 9, scope: !19)
!99 = !DILocation(line: 67, column: 21, scope: !19)
!100 = !DILocation(line: 67, column: 28, scope: !19)
!101 = !DILocation(line: 70, column: 38, scope: !19)
!102 = !DILocation(line: 70, column: 50, scope: !19)
!103 = !DILocation(line: 70, column: 59, scope: !19)
!104 = !DILocation(line: 70, column: 9, scope: !19)
!105 = !DILocation(line: 70, column: 21, scope: !19)
!106 = !DILocation(line: 70, column: 30, scope: !19)
!107 = !DILocation(line: 71, column: 9, scope: !19)
!108 = !DILocation(line: 71, column: 21, scope: !19)
!109 = !DILocation(line: 71, column: 32, scope: !19)
!110 = !DILocation(line: 74, column: 9, scope: !19)
!111 = !DILocation(line: 74, column: 20, scope: !19)
!112 = !DILocation(line: 74, column: 30, scope: !19)
!113 = !DILocation(line: 75, column: 28, scope: !19)
!114 = !DILocation(line: 75, column: 9, scope: !19)
!115 = !DILocation(line: 75, column: 20, scope: !19)
!116 = !DILocation(line: 75, column: 26, scope: !19)
!117 = !DILocation(line: 76, column: 29, scope: !19)
!118 = !DILocation(line: 76, column: 9, scope: !19)
!119 = !DILocation(line: 76, column: 20, scope: !19)
!120 = !DILocation(line: 76, column: 27, scope: !19)
!121 = !DILocation(line: 77, column: 9, scope: !19)
!122 = !DILocation(line: 77, column: 20, scope: !19)
!123 = !DILocation(line: 77, column: 28, scope: !19)
!124 = !DILocation(line: 78, column: 9, scope: !19)
!125 = !DILocation(line: 78, column: 20, scope: !19)
!126 = !DILocation(line: 78, column: 27, scope: !19)
!127 = !DILocation(line: 79, column: 9, scope: !19)
!128 = !DILocation(line: 79, column: 20, scope: !19)
!129 = !DILocation(line: 79, column: 34, scope: !19)
!130 = !DILocation(line: 80, column: 33, scope: !19)
!131 = !DILocation(line: 80, column: 41, scope: !19)
!132 = !DILocation(line: 80, column: 39, scope: !19)
!133 = !DILocation(line: 80, column: 48, scope: !19)
!134 = !DILocation(line: 80, column: 9, scope: !19)
!135 = !DILocation(line: 80, column: 20, scope: !19)
!136 = !DILocation(line: 80, column: 31, scope: !19)
!137 = !DILocation(line: 81, column: 9, scope: !19)
!138 = !DILocation(line: 81, column: 20, scope: !19)
!139 = !DILocation(line: 81, column: 25, scope: !19)
!140 = !DILocation(line: 82, column: 9, scope: !19)
!141 = !DILocation(line: 82, column: 20, scope: !19)
!142 = !DILocation(line: 82, column: 25, scope: !19)
!143 = !DILocation(line: 83, column: 9, scope: !19)
!144 = !DILocation(line: 83, column: 20, scope: !19)
!145 = !DILocation(line: 83, column: 28, scope: !19)
!146 = !DILocation(line: 84, column: 9, scope: !19)
!147 = !DILocation(line: 84, column: 20, scope: !19)
!148 = !DILocation(line: 84, column: 31, scope: !19)
!149 = !DILocalVariable(name: "out_file", scope: !19, file: !8, line: 86, type: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !152, line: 48, baseType: !153)
!152 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T11/parboil/benchmarks/histo/build")
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !154, line: 245, size: 1728, align: 64, elements: !155)
!154 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T11/parboil/benchmarks/histo/build")
!155 = !{!156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !176, !177, !178, !179, !183, !184, !186, !190, !193, !195, !196, !197, !198, !199, !203, !204}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !153, file: !154, line: 246, baseType: !22, size: 32, align: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !153, file: !154, line: 251, baseType: !4, size: 64, align: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !153, file: !154, line: 252, baseType: !4, size: 64, align: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !153, file: !154, line: 253, baseType: !4, size: 64, align: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !153, file: !154, line: 254, baseType: !4, size: 64, align: 64, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !153, file: !154, line: 255, baseType: !4, size: 64, align: 64, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !153, file: !154, line: 256, baseType: !4, size: 64, align: 64, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !153, file: !154, line: 257, baseType: !4, size: 64, align: 64, offset: 448)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !153, file: !154, line: 258, baseType: !4, size: 64, align: 64, offset: 512)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !153, file: !154, line: 260, baseType: !4, size: 64, align: 64, offset: 576)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !153, file: !154, line: 261, baseType: !4, size: 64, align: 64, offset: 640)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !153, file: !154, line: 262, baseType: !4, size: 64, align: 64, offset: 704)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !153, file: !154, line: 264, baseType: !169, size: 64, align: 64, offset: 768)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !154, line: 160, size: 192, align: 64, elements: !171)
!171 = !{!172, !173, !175}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !170, file: !154, line: 161, baseType: !169, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !170, file: !154, line: 162, baseType: !174, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !170, file: !154, line: 166, baseType: !22, size: 32, align: 32, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !153, file: !154, line: 266, baseType: !174, size: 64, align: 64, offset: 832)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !153, file: !154, line: 268, baseType: !22, size: 32, align: 32, offset: 896)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !153, file: !154, line: 272, baseType: !22, size: 32, align: 32, offset: 928)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !153, file: !154, line: 274, baseType: !180, size: 64, align: 64, offset: 960)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !181, line: 131, baseType: !182)
!181 = !DIFile(filename: "/usr/include/bits/types.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T11/parboil/benchmarks/histo/build")
!182 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !153, file: !154, line: 278, baseType: !49, size: 16, align: 16, offset: 1024)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !153, file: !154, line: 279, baseType: !185, size: 8, align: 8, offset: 1040)
!185 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !153, file: !154, line: 280, baseType: !187, size: 8, align: 8, offset: 1048)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 8, align: 8, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 1)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !153, file: !154, line: 284, baseType: !191, size: 64, align: 64, offset: 1088)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !154, line: 154, baseType: null)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !153, file: !154, line: 293, baseType: !194, size: 64, align: 64, offset: 1152)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !181, line: 132, baseType: !182)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !153, file: !154, line: 302, baseType: !70, size: 64, align: 64, offset: 1216)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !153, file: !154, line: 303, baseType: !70, size: 64, align: 64, offset: 1280)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !153, file: !154, line: 304, baseType: !70, size: 64, align: 64, offset: 1344)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !153, file: !154, line: 305, baseType: !70, size: 64, align: 64, offset: 1408)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !153, file: !154, line: 306, baseType: !200, size: 64, align: 64, offset: 1472)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !201, line: 62, baseType: !202)
!201 = !DIFile(filename: "/opt/aclang/install/bin/../lib/clang/4.0.0/include/stddef.h", directory: "/home/msc2018-ceb/ra211848/Documents/IPP/T11/parboil/benchmarks/histo/build")
!202 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !153, file: !154, line: 308, baseType: !22, size: 32, align: 32, offset: 1536)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !153, file: !154, line: 310, baseType: !205, size: 160, align: 8, offset: 1568)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 160, align: 8, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 20)
!208 = !DILocation(line: 86, column: 9, scope: !19)
!209 = !DILocation(line: 86, column: 26, scope: !19)
!210 = !DILocation(line: 86, column: 20, scope: !19)
!211 = !DILocation(line: 88, column: 16, scope: !19)
!212 = !DILocation(line: 88, column: 10, scope: !19)
!213 = !DILocation(line: 88, column: 40, scope: !19)
!214 = !DILocation(line: 88, column: 3, scope: !19)
!215 = !DILocation(line: 89, column: 18, scope: !19)
!216 = !DILocation(line: 89, column: 10, scope: !19)
!217 = !DILocation(line: 90, column: 10, scope: !19)
!218 = !DILocation(line: 89, column: 3, scope: !19)
!219 = !DILocation(line: 91, column: 18, scope: !19)
!220 = !DILocation(line: 91, column: 10, scope: !19)
!221 = !DILocation(line: 91, column: 71, scope: !19)
!222 = !DILocation(line: 91, column: 3, scope: !19)
!223 = !DILocalVariable(name: "h", scope: !19, file: !8, line: 93, type: !22)
!224 = !DILocation(line: 93, column: 7, scope: !19)
!225 = !DILocation(line: 94, column: 12, scope: !226)
!226 = distinct !DILexicalBlock(scope: !19, file: !8, line: 94, column: 3)
!227 = !DILocation(line: 94, column: 19, scope: !226)
!228 = !DILocation(line: 94, column: 10, scope: !226)
!229 = !DILocation(line: 94, column: 8, scope: !226)
!230 = !DILocation(line: 94, column: 24, scope: !231)
!231 = !DILexicalBlockFile(scope: !232, file: !8, discriminator: 1)
!232 = distinct !DILexicalBlock(scope: !226, file: !8, line: 94, column: 3)
!233 = !DILocation(line: 94, column: 26, scope: !231)
!234 = !DILocation(line: 94, column: 3, scope: !231)
!235 = !DILocation(line: 95, column: 20, scope: !236)
!236 = distinct !DILexicalBlock(scope: !232, file: !8, line: 94, column: 37)
!237 = !DILocation(line: 95, column: 24, scope: !236)
!238 = !DILocation(line: 95, column: 22, scope: !236)
!239 = !DILocation(line: 95, column: 13, scope: !236)
!240 = !DILocation(line: 95, column: 12, scope: !236)
!241 = !DILocation(line: 95, column: 45, scope: !236)
!242 = !DILocation(line: 95, column: 52, scope: !236)
!243 = !DILocation(line: 95, column: 5, scope: !236)
!244 = !DILocation(line: 96, column: 12, scope: !236)
!245 = !DILocation(line: 96, column: 31, scope: !236)
!246 = !DILocation(line: 96, column: 45, scope: !236)
!247 = !DILocation(line: 96, column: 5, scope: !236)
!248 = !DILocation(line: 97, column: 3, scope: !236)
!249 = !DILocation(line: 94, column: 33, scope: !250)
!250 = !DILexicalBlockFile(scope: !232, file: !8, discriminator: 2)
!251 = !DILocation(line: 94, column: 3, scope: !250)
!252 = distinct !{!252, !253}
!253 = !DILocation(line: 94, column: 3, scope: !19)
!254 = !DILocation(line: 99, column: 10, scope: !19)
!255 = !DILocation(line: 99, column: 3, scope: !19)
!256 = !DILocation(line: 100, column: 1, scope: !19)
!257 = distinct !DISubprogram(name: "HSVtoRGB", scope: !1, file: !1, line: 20, type: !258, isLocal: false, isDefinition: true, scopeLine: 20, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!258 = !DISubroutineType(types: !259)
!259 = !{!7, !15, !15, !15}
!260 = !DILocalVariable(name: "h", arg: 1, scope: !257, file: !1, line: 20, type: !15)
!261 = !DILocation(line: 20, column: 20, scope: !257)
!262 = !DILocalVariable(name: "s", arg: 2, scope: !257, file: !1, line: 20, type: !15)
!263 = !DILocation(line: 20, column: 29, scope: !257)
!264 = !DILocalVariable(name: "v", arg: 3, scope: !257, file: !1, line: 20, type: !15)
!265 = !DILocation(line: 20, column: 38, scope: !257)
!266 = !DILocalVariable(name: "i", scope: !257, file: !1, line: 21, type: !22)
!267 = !DILocation(line: 21, column: 7, scope: !257)
!268 = !DILocalVariable(name: "f", scope: !257, file: !1, line: 22, type: !15)
!269 = !DILocation(line: 22, column: 9, scope: !257)
